ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
//////////////////////////////////////////////////////////////////////////////////////
// File: MKL25Z128LK4.h
// Purpose: Define the peripheral registers.
// This file has been automatically generated from the APIF knowledgebase
//
// Revisions:
// - rev. 1.0 (2011-06-01)
//     Initial public version.
// - rev. 1.1 (2012-03-13)
//     Bit/group constants related to 32-bit registers typecasted to uint32_t.
//
//////////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>
//
//////////////////////////////////////////////////////////////////////////////////////
// Generic Bit Definitions Used Elsewhere in this File
//
// Peripheral Base Address Defines in Alphabetical Order
//
#define  ADC0_BASE_PTR               ((uint8_t *) (0x4003B000u))

#define  CMP0_BASE_PTR               ((uint8_t *) (0x40073000u))

#define  DAC0_BASE_PTR               ((uint8_t *) (0x4003F000u))

#define  DMA_BASE_PTR                ((uint8_t *) (0x40008000u))

#define  DMAMUX0_BASE_PTR            ((uint8_t *) (0x40021000u))

#define  FTFA_BASE_PTR               ((uint8_t *) (0x40020000u))

#define  FTM0_BASE_PTR               ((uint32_t *) (0x40038000u))

#define  FTM1_BASE_PTR               ((uint32_t *) (0x40039000u))

#define  FTM2_BASE_PTR               ((uint32_t *) (0x4003A000u))

#define  GPIOA_BASE_PTR              ((uint8_t *) (0x400FF000u))

#define  GPIOB_BASE_PTR              ((uint8_t *) (0x400FF040u))

#define  GPIOC_BASE_PTR              ((uint8_t *) (0x400FF080u))

#define  GPIOD_BASE_PTR              ((uint8_t *) (0x400FF0C0u))

#define  GPIOE_BASE_PTR              ((uint8_t *) (0x400FF100u))

#define  I2C0_BASE_PTR               ((uint8_t *) (0x40066000u))

#define  I2C1_BASE_PTR               ((uint8_t *) (0x40067000u))

#define  LLWU_BASE_PTR               ((uint8_t *) (0x4007C000u))

#define  LPTMR0_BASE_PTR             ((uint32_t *) (0x40040000u))

#define  MCG_BASE_PTR                ((uint8_t *) (0x40064000u))

#define  MCM_BASE_PTR                ((uint8_t *) (0xF0003000u))

#define  MTB_BASE_PTR                ((uint8_t *) (0xF0000000u))

#define  MTBDWT_BASE_PTR             ((uint8_t *) (0xF0001000u))

#define  OSC0_BASE_PTR               ((uint8_t *) (0x40065000u))

#define  PIT_BASE_PTR                ((uint32_t *) (0x40037000u))

#define  PMC_BASE_PTR                ((uint8_t *) (0x4007D000u))

#define  PORTA_BASE_PTR              ((uint8_t *) (0x40049000u))

#define  PORTB_BASE_PTR              ((uint8_t *) (0x4004A000u))

#define  PORTC_BASE_PTR              ((uint8_t *) (0x4004B000u))

#define  PORTD_BASE_PTR              ((uint8_t *) (0x4004C000u))

#define  PORTE_BASE_PTR              ((uint8_t *) (0x4004D000u))

#define  RCM_BASE_PTR                ((uint8_t *) (0x4007F000u))

#define  ROM_BASE_PTR                ((uint8_t *) (0xF0002000u))

#define  RTC_BASE_PTR                ((uint8_t *) (0x4003D000u))

#define  SIM_BASE_PTR                ((uint8_t *) (0x40047000u))

#define  SMC_BASE_PTR                ((uint8_t *) (0x4007E000u))

#define  SPI0_BASE_PTR               ((uint8_t *) (0x40076000u))

#define  SPI1_BASE_PTR               ((uint8_t *) (0x40077000u))

#define  TSI0_BASE_PTR               ((uint8_t *) (0x40045000u))

#define  UART0_BASE              ((uint8_t *) (0x4006A000u))
/*
#define  UART1_BASE_PTR              ((uint8_t *) (0x4006B000u))

#define  UART2_BASE_PTR              ((uint8_t *) (0x4006C000u))
*/
#define  USB0_BASE_PTR               ((uint8_t *) (0x40072000u))


//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register locations.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC0_SC1A                   (*(uint32_t *) (0x4003B000))

#define  ADC0_SC1B                   (*(uint32_t *) (0x4003B004))

#define  ADC0_CFG1                   (*(uint32_t *) (0x4003B008))

#define  ADC0_CFG2                   (*(uint32_t *) (0x4003B00C))

#define  ADC0_RA                     (*(uint32_t *) (0x4003B010))

#define  ADC0_RB                     (*(uint32_t *) (0x4003B014))

#define  ADC0_CV1                    (*(uint32_t *) (0x4003B018))

#define  ADC0_CV2                    (*(uint32_t *) (0x4003B01C))

#define  ADC0_SC2                    (*(uint32_t *) (0x4003B020))

#define  ADC0_SC3                    (*(uint32_t *) (0x4003B024))

#define  ADC0_OFS                    (*(uint32_t *) (0x4003B028))

#define  ADC0_PG                     (*(uint32_t *) (0x4003B02C))

#define  ADC0_MG                     (*(uint32_t *) (0x4003B030))

#define  ADC0_CLPD                   (*(uint32_t *) (0x4003B034))

#define  ADC0_CLPS                   (*(uint32_t *) (0x4003B038))

#define  ADC0_CLP4                   (*(uint32_t *) (0x4003B03C))

#define  ADC0_CLP3                   (*(uint32_t *) (0x4003B040))

#define  ADC0_CLP2                   (*(uint32_t *) (0x4003B044))

#define  ADC0_CLP1                   (*(uint32_t *) (0x4003B048))

#define  ADC0_CLP0                   (*(uint32_t *) (0x4003B04C))

#define  ADC0_CLMD                   (*(uint32_t *) (0x4003B054))

#define  ADC0_CLMS                   (*(uint32_t *) (0x4003B058))

#define  ADC0_CLM4                   (*(uint32_t *) (0x4003B05C))

#define  ADC0_CLM3                   (*(uint32_t *) (0x4003B060))

#define  ADC0_CLM2                   (*(uint32_t *) (0x4003B064))

#define  ADC0_CLM1                   (*(uint32_t *) (0x4003B068))

#define  ADC0_CLM0                   (*(uint32_t *) (0x4003B06C))

#define  CMP0_CR0                    (*(uint8_t *) (0x40073000))

#define  CMP0_CR1                    (*(uint8_t *) (0x40073001))

#define  CMP0_FPR                    (*(uint8_t *) (0x40073002))

#define  CMP0_SCR                    (*(uint8_t *) (0x40073003))

#define  CMP0_DACCR                  (*(uint8_t *) (0x40073004))

#define  CMP0_MUXCR                  (*(uint8_t *) (0x40073005))

#define  DAC0_DAT0L                  (*(uint8_t *) (0x4003F000))

#define  DAC0_DAT0H                  (*(uint8_t *) (0x4003F001))

#define  DAC0_DAT1L                  (*(uint8_t *) (0x4003F002))

