ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  DAC0_DAT1H                  (*(uint8_t *) (0x4003F003))

#define  DAC0_SR                     (*(uint8_t *) (0x4003F020))

#define  DAC0_C0                     (*(uint8_t *) (0x4003F021))

#define  DAC0_C1                     (*(uint8_t *) (0x4003F022))

#define  DAC0_C2                     (*(uint8_t *) (0x4003F023))

#define  DMA_SAR0                    (*(uint32_t *) (0x40008100))

#define  DMA_DAR0                    (*(uint32_t *) (0x40008104))

#define  DMA_DSR_BCR0                (*(uint32_t *) (0x40008108))

#define  DMA_DCR0                    (*(uint32_t *) (0x4000810C))

#define  DMA_SAR1                    (*(uint32_t *) (0x40008110))

#define  DMA_DAR1                    (*(uint32_t *) (0x40008114))

#define  DMA_DSR_BCR1                (*(uint32_t *) (0x40008118))

#define  DMA_DCR1                    (*(uint32_t *) (0x4000811C))

#define  DMA_SAR2                    (*(uint32_t *) (0x40008120))

#define  DMA_DAR2                    (*(uint32_t *) (0x40008124))

#define  DMA_DSR_BCR2                (*(uint32_t *) (0x40008128))

#define  DMA_DCR2                    (*(uint32_t *) (0x4000812C))

#define  DMA_SAR3                    (*(uint32_t *) (0x40008130))

#define  DMA_DAR3                    (*(uint32_t *) (0x40008134))

#define  DMA_DSR_BCR3                (*(uint32_t *) (0x40008138))

#define  DMA_DCR3                    (*(uint32_t *) (0x4000813C))

#define  DMAMUX0_CHCFG0              (*(uint8_t *) (0x40021000))

#define  DMAMUX0_CHCFG1              (*(uint8_t *) (0x40021001))

#define  DMAMUX0_CHCFG2              (*(uint8_t *) (0x40021002))

#define  DMAMUX0_CHCFG3              (*(uint8_t *) (0x40021003))

#define  FTFA_FSTAT                  (*(uint8_t *) (0x40020000))

#define  FTFA_FCNFG                  (*(uint8_t *) (0x40020001))

#define  FTFA_FSEC                   (*(uint8_t *) (0x40020002))

#define  FTFA_FOPT                   (*(uint8_t *) (0x40020003))

#define  FTFA_FCCOB3                 (*(uint8_t *) (0x40020004))

#define  FTFA_FCCOB2                 (*(uint8_t *) (0x40020005))

#define  FTFA_FCCOB1                 (*(uint8_t *) (0x40020006))

#define  FTFA_FCCOB0                 (*(uint8_t *) (0x40020007))

#define  FTFA_FCCOB7                 (*(uint8_t *) (0x40020008))

#define  FTFA_FCCOB6                 (*(uint8_t *) (0x40020009))

#define  FTFA_FCCOB5                 (*(uint8_t *) (0x4002000A))

#define  FTFA_FCCOB4                 (*(uint8_t *) (0x4002000B))

#define  FTFA_FCCOBB                 (*(uint8_t *) (0x4002000C))

#define  FTFA_FCCOBA                 (*(uint8_t *) (0x4002000D))

#define  FTFA_FCCOB9                 (*(uint8_t *) (0x4002000E))

#define  FTFA_FCCOB8                 (*(uint8_t *) (0x4002000F))

#define  FTFA_FPROT3                 (*(uint8_t *) (0x40020010))

#define  FTFA_FPROT2                 (*(uint8_t *) (0x40020011))

#define  FTFA_FPROT1                 (*(uint8_t *) (0x40020012))

#define  FTFA_FPROT0                 (*(uint8_t *) (0x40020013))

#define  FTM0_SC                     (*(uint32_t *) (0x40038000))

#define  FTM0_CNT                    (*(uint32_t *) (0x40038004))

#define  FTM0_MOD                    (*(uint32_t *) (0x40038008))

#define  FTM0_C0SC                   (*(uint32_t *) (0x4003800C))

#define  FTM0_C0V                    (*(uint32_t *) (0x40038010))

#define  FTM0_C1SC                   (*(uint32_t *) (0x40038014))

#define  FTM0_C1V                    (*(uint32_t *) (0x40038018))

#define  FTM0_C2SC                   (*(uint32_t *) (0x4003801C))

#define  FTM0_C2V                    (*(uint32_t *) (0x40038020))

#define  FTM0_C3SC                   (*(uint32_t *) (0x40038024))

#define  FTM0_C3V                    (*(uint32_t *) (0x40038028))

#define  FTM0_C4SC                   (*(uint32_t *) (0x4003802C))

#define  FTM0_C4V                    (*(uint32_t *) (0x40038030))

#define  FTM0_C5SC                   (*(uint32_t *) (0x40038034))

#define  FTM0_C5V                    (*(uint32_t *) (0x40038038))

#define  FTM0_STATUS                 (*(uint32_t *) (0x40038050))

#define  FTM0_CONF                   (*(uint32_t *) (0x40038084))

#define  FTM1_SC                     (*(uint32_t *) (0x40039000))

#define  FTM1_CNT                    (*(uint32_t *) (0x40039004))

#define  FTM1_MOD                    (*(uint32_t *) (0x40039008))

#define  FTM1_C0SC                   (*(uint32_t *) (0x4003900C))

#define  FTM1_C0V                    (*(uint32_t *) (0x40039010))

#define  FTM1_C1SC                   (*(uint32_t *) (0x40039014))

#define  FTM1_C1V                    (*(uint32_t *) (0x40039018))

#define  FTM1_C2SC                   (*(uint32_t *) (0x4003901C))

#define  FTM1_C2V                    (*(uint32_t *) (0x40039020))

#define  FTM1_C3SC                   (*(uint32_t *) (0x40039024))

#define  FTM1_C3V                    (*(uint32_t *) (0x40039028))

#define  FTM1_C4SC                   (*(uint32_t *) (0x4003902C))

#define  FTM1_C4V                    (*(uint32_t *) (0x40039030))

#define  FTM1_C5SC                   (*(uint32_t *) (0x40039034))

#define  FTM1_C5V                    (*(uint32_t *) (0x40039038))

#define  FTM1_STATUS                 (*(uint32_t *) (0x40039050))

#define  FTM1_CONF                   (*(uint32_t *) (0x40039084))

#define  FTM2_SC                     (*(uint32_t *) (0x4003A000))

#define  FTM2_CNT                    (*(uint32_t *) (0x4003A004))

#define  FTM2_MOD                    (*(uint32_t *) (0x4003A008))

#define  FTM2_C0SC                   (*(uint32_t *) (0x4003A00C))

#define  FTM2_C0V                    (*(uint32_t *) (0x4003A010))

#define  FTM2_C1SC                   (*(uint32_t *) (0x4003A014))

#define  FTM2_C1V                    (*(uint32_t *) (0x4003A018))

#define  FTM2_C2SC                   (*(uint32_t *) (0x4003A01C))

#define  FTM2_C2V                    (*(uint32_t *) (0x4003A020))

#define  FTM2_C3SC                   (*(uint32_t *) (0x4003A024))

#define  FTM2_C3V                    (*(uint32_t *) (0x4003A028))

#define  FTM2_C4SC                   (*(uint32_t *) (0x4003A02C))

#define  FTM2_C4V                    (*(uint32_t *) (0x4003A030))

#define  FTM2_C5SC                   (*(uint32_t *) (0x4003A034))

#define  FTM2_C5V                    (*(uint32_t *) (0x4003A038))

#define  FTM2_STATUS                 (*(uint32_t *) (0x4003A050))

#define  FTM2_CONF                   (*(uint32_t *) (0x4003A084))

#define  GPIOA_PDOR                  (*(uint32_t *) (0x400FF000))

#define  GPIOA_PSOR                  (*(uint32_t *) (0x400FF004))

#define  GPIOA_PCOR                  (*(uint32_t *) (0x400FF008))

#define  GPIOA_PTOR                  (*(uint32_t *) (0x400FF00C))

