ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  GPIOA_PDIR                  (*(uint32_t *) (0x400FF010))

#define  GPIOA_PDDR                  (*(uint32_t *) (0x400FF014))

#define  GPIOB_PDOR                  (*(uint32_t *) (0x400FF040))

#define  GPIOB_PSOR                  (*(uint32_t *) (0x400FF044))

#define  GPIOB_PCOR                  (*(uint32_t *) (0x400FF048))

#define  GPIOB_PTOR                  (*(uint32_t *) (0x400FF04C))

#define  GPIOB_PDIR                  (*(uint32_t *) (0x400FF050))

#define  GPIOB_PDDR                  (*(uint32_t *) (0x400FF054))

#define  GPIOC_PDOR                  (*(uint32_t *) (0x400FF080))

#define  GPIOC_PSOR                  (*(uint32_t *) (0x400FF084))

#define  GPIOC_PCOR                  (*(uint32_t *) (0x400FF088))

#define  GPIOC_PTOR                  (*(uint32_t *) (0x400FF08C))

#define  GPIOC_PDIR                  (*(uint32_t *) (0x400FF090))

#define  GPIOC_PDDR                  (*(uint32_t *) (0x400FF094))

#define  GPIOD_PDOR                  (*(uint32_t *) (0x400FF0C0))

#define  GPIOD_PSOR                  (*(uint32_t *) (0x400FF0C4))

#define  GPIOD_PCOR                  (*(uint32_t *) (0x400FF0C8))

#define  GPIOD_PTOR                  (*(uint32_t *) (0x400FF0CC))

#define  GPIOD_PDIR                  (*(uint32_t *) (0x400FF0D0))

#define  GPIOD_PDDR                  (*(uint32_t *) (0x400FF0D4))

#define  GPIOE_PDOR                  (*(uint32_t *) (0x400FF100))

#define  GPIOE_PSOR                  (*(uint32_t *) (0x400FF104))

#define  GPIOE_PCOR                  (*(uint32_t *) (0x400FF108))

#define  GPIOE_PTOR                  (*(uint32_t *) (0x400FF10C))

#define  GPIOE_PDIR                  (*(uint32_t *) (0x400FF110))

#define  GPIOE_PDDR                  (*(uint32_t *) (0x400FF114))

#define  I2C0_A1                     (*(uint8_t *) (0x40066000))

#define  I2C0_F                      (*(uint8_t *) (0x40066001))

#define  I2C0_C1                     (*(uint8_t *) (0x40066002))

#define  I2C0_S                      (*(uint8_t *) (0x40066003))

#define  I2C0_D                      (*(uint8_t *) (0x40066004))

#define  I2C0_C2                     (*(uint8_t *) (0x40066005))

#define  I2C0_FLT                    (*(uint8_t *) (0x40066006))

#define  I2C0_RA                     (*(uint8_t *) (0x40066007))

#define  I2C0_SMB                    (*(uint8_t *) (0x40066008))

#define  I2C0_A2                     (*(uint8_t *) (0x40066009))

#define  I2C0_SLTH                   (*(uint8_t *) (0x4006600A))

#define  I2C0_SLTL                   (*(uint8_t *) (0x4006600B))

#define  I2C1_A1                     (*(uint8_t *) (0x40067000))

#define  I2C1_F                      (*(uint8_t *) (0x40067001))

#define  I2C1_C1                     (*(uint8_t *) (0x40067002))

#define  I2C1_S                      (*(uint8_t *) (0x40067003))

#define  I2C1_D                      (*(uint8_t *) (0x40067004))

#define  I2C1_C2                     (*(uint8_t *) (0x40067005))

#define  I2C1_FLT                    (*(uint8_t *) (0x40067006))

#define  I2C1_RA                     (*(uint8_t *) (0x40067007))

#define  I2C1_SMB                    (*(uint8_t *) (0x40067008))

#define  I2C1_A2                     (*(uint8_t *) (0x40067009))

#define  I2C1_SLTH                   (*(uint8_t *) (0x4006700A))

#define  I2C1_SLTL                   (*(uint8_t *) (0x4006700B))

#define  LLWU_PE1                    (*(uint8_t *) (0x4007C000))

#define  LLWU_PE2                    (*(uint8_t *) (0x4007C001))

#define  LLWU_PE3                    (*(uint8_t *) (0x4007C002))

#define  LLWU_PE4                    (*(uint8_t *) (0x4007C003))

#define  LLWU_ME                     (*(uint8_t *) (0x4007C004))

#define  LLWU_F1                     (*(uint8_t *) (0x4007C005))

#define  LLWU_F2                     (*(uint8_t *) (0x4007C006))

#define  LLWU_F3                     (*(uint8_t *) (0x4007C007))

#define  LLWU_FILT1                  (*(uint8_t *) (0x4007C008))

#define  LLWU_FILT2                  (*(uint8_t *) (0x4007C009))

#define  LPTMR0_CSR                  (*(uint32_t *) (0x40040000))

#define  LPTMR0_PSR                  (*(uint32_t *) (0x40040004))

#define  LPTMR0_CMR                  (*(uint32_t *) (0x40040008))

#define  LPTMR0_CNR                  (*(uint32_t *) (0x4004000C))

#define  MCG_C1                      (*(uint8_t *) (0x40064000))

#define  MCG_C2                      (*(uint8_t *) (0x40064001))

#define  MCG_C3                      (*(uint8_t *) (0x40064002))

#define  MCG_C4                      (*(uint8_t *) (0x40064003))

#define  MCG_C5                      (*(uint8_t *) (0x40064004))

#define  MCG_C6                      (*(uint8_t *) (0x40064005))

#define  MCG_S                       (*(uint8_t *) (0x40064006))

#define  MCG_SC                      (*(uint8_t *) (0x40064008))

#define  MCG_ATCVH                   (*(uint8_t *) (0x4006400A))

#define  MCG_ATCVL                   (*(uint8_t *) (0x4006400B))

#define  MCG_C7                      (*(uint8_t *) (0x4006400C))

#define  MCG_C8                      (*(uint8_t *) (0x4006400D))

#define  MCG_C9                      (*(uint8_t *) (0x4006400E))

#define  MCG_C10                     (*(uint8_t *) (0x4006400F))

#define  MCM_PLASC                   (*(uint16_t *) (0xF0003008))

#define  MCM_PLAMC                   (*(uint16_t *) (0xF000300A))

#define  MCM_PLACR                   (*(uint32_t *) (0xF000300C))

#define  MCM_CPO                     (*(uint32_t *) (0xF0003040))

#define  MTB_POSITION                (*(uint32_t *) (0xF0000000))

#define  MTB_MASTER                  (*(uint32_t *) (0xF0000004))

#define  MTB_FLOW                    (*(uint32_t *) (0xF0000008))

#define  MTB_BASE                    (*(uint32_t *) (0xF000000C))

#define  MTB_MODECTRL                (*(uint32_t *) (0xF0000F00))

#define  MTB_TAGSET                  (*(uint32_t *) (0xF0000FA0))

#define  MTB_TAGCLEAR                (*(uint32_t *) (0xF0000FA4))

#define  MTB_LOCKACCESS              (*(uint32_t *) (0xF0000FB0))

#define  MTB_LOCKSTAT                (*(uint32_t *) (0xF0000FB4))

#define  MTB_AUTHSTAT                (*(uint32_t *) (0xF0000FB8))

#define  MTB_DEVICEARCH              (*(uint32_t *) (0xF0000FBC))

#define  MTB_DEVICECFG               (*(uint32_t *) (0xF0000FC8))

#define  MTB_DEVICETYPID             (*(uint32_t *) (0xF0000FCC))

