ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  MTB_PERIPHID4               (*(uint32_t *) (0xF0000FD0))

#define  MTB_PERIPHID5               (*(uint32_t *) (0xF0000FD4))

#define  MTB_PERIPHID6               (*(uint32_t *) (0xF0000FD8))

#define  MTB_PERIPHID7               (*(uint32_t *) (0xF0000FDC))

#define  MTB_PERIPHID0               (*(uint32_t *) (0xF0000FE0))

#define  MTB_PERIPHID1               (*(uint32_t *) (0xF0000FE4))

#define  MTB_PERIPHID2               (*(uint32_t *) (0xF0000FE8))

#define  MTB_PERIPHID3               (*(uint32_t *) (0xF0000FEC))

#define  MTB_COMPID0                 (*(uint32_t *) (0xF0000FF0))

#define  MTB_COMPID1                 (*(uint32_t *) (0xF0000FF4))

#define  MTB_COMPID2                 (*(uint32_t *) (0xF0000FF8))

#define  MTB_COMPID3                 (*(uint32_t *) (0xF0000FFC))

#define  MTBDWT_CTRL                 (*(uint32_t *) (0xF0002000))

#define  MTBDWT_COMP0                (*(uint32_t *) (0xF0002020))

#define  MTBDWT_MASK0                (*(uint32_t *) (0xF0002024))

#define  MTBDWT_MASK1                (*(uint32_t *) (0xF000202E))

#define  MTBDWT_COMP1                (*(uint32_t *) (0xF0002030))

#define  MTBDWT_FCT1                 (*(uint32_t *) (0xF0002038))

#define  MTBDWT_TBCTRL               (*(uint32_t *) (0xF0002200))

#define  MTBDWT_DEVICECFG            (*(uint32_t *) (0xF0002FC8))

#define  MTBDWT_DEVICETYPID          (*(uint32_t *) (0xF0002FCC))

#define  MTBDWT_PERIPHID4            (*(uint32_t *) (0xF0002FD0))

#define  MTBDWT_PERIPHID5            (*(uint32_t *) (0xF0002FD4))

#define  MTBDWT_PERIPHID6            (*(uint32_t *) (0xF0002FD8))

#define  MTBDWT_PERIPHID7            (*(uint32_t *) (0xF0002FDC))

#define  MTBDWT_PERIPHID0            (*(uint32_t *) (0xF0002FE0))

#define  MTBDWT_PERIPHID1            (*(uint32_t *) (0xF0002FE4))

#define  MTBDWT_PERIPHID2            (*(uint32_t *) (0xF0002FE8))

#define  MTBDWT_PERIPHID3            (*(uint32_t *) (0xF0002FEC))

#define  MTBDWT_COMPID0              (*(uint32_t *) (0xF0002FF0))

#define  MTBDWT_COMPID1              (*(uint32_t *) (0xF0002FF4))

#define  MTBDWT_COMPID2              (*(uint32_t *) (0xF0002FF8))

#define  MTBDWT_COMPID3              (*(uint32_t *) (0xF0002FFC))

#define  OSC0_CR                     (*(uint8_t *) (0x40065000))

#define  PIT_MCR                     (*(uint32_t *) (0x40037000))

#define  PIT_LTMR64H                 (*(uint32_t *) (0x400370E0))

#define  PIT_LTMR64L                 (*(uint32_t *) (0x400370E4))

#define  PIT_LDVAL0                  (*(uint32_t *) (0x40037100))

#define  PIT_CVAL0                   (*(uint32_t *) (0x40037104))

#define  PIT_TCTRL0                  (*(uint32_t *) (0x40037108))

#define  PIT_TFLG0                   (*(uint32_t *) (0x4003710C))

#define  PIT_LDVAL1                  (*(uint32_t *) (0x40037110))

#define  PIT_CVAL1                   (*(uint32_t *) (0x40037114))

#define  PIT_TCTRL1                  (*(uint32_t *) (0x40037118))

#define  PIT_TFLG1                   (*(uint32_t *) (0x4003711C))

#define  PIT_LDVAL2                  (*(uint32_t *) (0x40037120))

#define  PIT_CVAL2                   (*(uint32_t *) (0x40037124))

#define  PIT_TCTRL2                  (*(uint32_t *) (0x40037128))

#define  PIT_TFLG2                   (*(uint32_t *) (0x4003712C))

#define  PIT_LDVAL3                  (*(uint32_t *) (0x40037130))

#define  PIT_CVAL3                   (*(uint32_t *) (0x40037134))

#define  PIT_TCTRL3                  (*(uint32_t *) (0x40037138))

#define  PIT_TFLG3                   (*(uint32_t *) (0x4003713C))

#define  PMC_LVDSC1                  (*(uint8_t *) (0x4007D000))

#define  PMC_LVDSC2                  (*(uint8_t *) (0x4007D001))

#define  PMC_REGSC                   (*(uint8_t *) (0x4007D002))

#define  PORTA_PCR0                  (*(uint32_t *) (0x40049000))

#define  PORTA_PCR1                  (*(uint32_t *) (0x40049004))

#define  PORTA_PCR2                  (*(uint32_t *) (0x40049008))

#define  PORTA_PCR3                  (*(uint32_t *) (0x4004900C))

#define  PORTA_PCR4                  (*(uint32_t *) (0x40049010))

#define  PORTA_PCR5                  (*(uint32_t *) (0x40049014))

#define  PORTA_PCR6                  (*(uint32_t *) (0x40049018))

#define  PORTA_PCR7                  (*(uint32_t *) (0x4004901C))

#define  PORTA_PCR8                  (*(uint32_t *) (0x40049020))

#define  PORTA_PCR9                  (*(uint32_t *) (0x40049024))

#define  PORTA_PCR10                 (*(uint32_t *) (0x40049028))

#define  PORTA_PCR11                 (*(uint32_t *) (0x4004902C))

#define  PORTA_PCR12                 (*(uint32_t *) (0x40049030))

#define  PORTA_PCR13                 (*(uint32_t *) (0x40049034))

#define  PORTA_PCR14                 (*(uint32_t *) (0x40049038))

#define  PORTA_PCR15                 (*(uint32_t *) (0x4004903C))

#define  PORTA_PCR16                 (*(uint32_t *) (0x40049040))

#define  PORTA_PCR17                 (*(uint32_t *) (0x40049044))

#define  PORTA_PCR18                 (*(uint32_t *) (0x40049048))

#define  PORTA_PCR19                 (*(uint32_t *) (0x4004904C))

#define  PORTA_PCR20                 (*(uint32_t *) (0x40049050))

#define  PORTA_PCR21                 (*(uint32_t *) (0x40049054))

#define  PORTA_PCR22                 (*(uint32_t *) (0x40049058))

#define  PORTA_PCR23                 (*(uint32_t *) (0x4004905C))

#define  PORTA_PCR24                 (*(uint32_t *) (0x40049060))

#define  PORTA_PCR25                 (*(uint32_t *) (0x40049064))

#define  PORTA_PCR26                 (*(uint32_t *) (0x40049068))

#define  PORTA_PCR27                 (*(uint32_t *) (0x4004906C))

#define  PORTA_PCR28                 (*(uint32_t *) (0x40049070))

#define  PORTA_PCR29                 (*(uint32_t *) (0x40049074))

#define  PORTA_PCR30                 (*(uint32_t *) (0x40049078))

#define  PORTA_PCR31                 (*(uint32_t *) (0x4004907C))

#define  PORTA_GPCLR                 (*(uint32_t *) (0x40049080))

#define  PORTA_GPCHR                 (*(uint32_t *) (0x40049084))

#define  PORTA_ISFR                  (*(uint32_t *) (0x400490A0))

#define  PORTB_PCR0                  (*(uint32_t *) (0x4004A000))

