ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  PORTB_PCR1                  (*(uint32_t *) (0x4004A004))

#define  PORTB_PCR2                  (*(uint32_t *) (0x4004A008))

#define  PORTB_PCR3                  (*(uint32_t *) (0x4004A00C))

#define  PORTB_PCR4                  (*(uint32_t *) (0x4004A010))

#define  PORTB_PCR5                  (*(uint32_t *) (0x4004A014))

#define  PORTB_PCR6                  (*(uint32_t *) (0x4004A018))

#define  PORTB_PCR7                  (*(uint32_t *) (0x4004A01C))

#define  PORTB_PCR8                  (*(uint32_t *) (0x4004A020))

#define  PORTB_PCR9                  (*(uint32_t *) (0x4004A024))

#define  PORTB_PCR10                 (*(uint32_t *) (0x4004A028))

#define  PORTB_PCR11                 (*(uint32_t *) (0x4004A02C))

#define  PORTB_PCR12                 (*(uint32_t *) (0x4004A030))

#define  PORTB_PCR13                 (*(uint32_t *) (0x4004A034))

#define  PORTB_PCR14                 (*(uint32_t *) (0x4004A038))

#define  PORTB_PCR15                 (*(uint32_t *) (0x4004A03C))

#define  PORTB_PCR16                 (*(uint32_t *) (0x4004A040))

#define  PORTB_PCR17                 (*(uint32_t *) (0x4004A044))

#define  PORTB_PCR18                 (*(uint32_t *) (0x4004A048))

#define  PORTB_PCR19                 (*(uint32_t *) (0x4004A04C))

#define  PORTB_PCR20                 (*(uint32_t *) (0x4004A050))

#define  PORTB_PCR21                 (*(uint32_t *) (0x4004A054))

#define  PORTB_PCR22                 (*(uint32_t *) (0x4004A058))

#define  PORTB_PCR23                 (*(uint32_t *) (0x4004A05C))

#define  PORTB_PCR24                 (*(uint32_t *) (0x4004A060))

#define  PORTB_PCR25                 (*(uint32_t *) (0x4004A064))

#define  PORTB_PCR26                 (*(uint32_t *) (0x4004A068))

#define  PORTB_PCR27                 (*(uint32_t *) (0x4004A06C))

#define  PORTB_PCR28                 (*(uint32_t *) (0x4004A070))

#define  PORTB_PCR29                 (*(uint32_t *) (0x4004A074))

#define  PORTB_PCR30                 (*(uint32_t *) (0x4004A078))

#define  PORTB_PCR31                 (*(uint32_t *) (0x4004A07C))

#define  PORTB_GPCLR                 (*(uint32_t *) (0x4004A080))

#define  PORTB_GPCHR                 (*(uint32_t *) (0x4004A084))

#define  PORTB_ISFR                  (*(uint32_t *) (0x4004A0A0))

#define  PORTC_PCR0                  (*(uint32_t *) (0x4004B000))

#define  PORTC_PCR1                  (*(uint32_t *) (0x4004B004))

#define  PORTC_PCR2                  (*(uint32_t *) (0x4004B008))

#define  PORTC_PCR3                  (*(uint32_t *) (0x4004B00C))

#define  PORTC_PCR4                  (*(uint32_t *) (0x4004B010))

#define  PORTC_PCR5                  (*(uint32_t *) (0x4004B014))

#define  PORTC_PCR6                  (*(uint32_t *) (0x4004B018))

#define  PORTC_PCR7                  (*(uint32_t *) (0x4004B01C))

#define  PORTC_PCR8                  (*(uint32_t *) (0x4004B020))

#define  PORTC_PCR9                  (*(uint32_t *) (0x4004B024))

#define  PORTC_PCR10                 (*(uint32_t *) (0x4004B028))

#define  PORTC_PCR11                 (*(uint32_t *) (0x4004B02C))

#define  PORTC_PCR12                 (*(uint32_t *) (0x4004B030))

#define  PORTC_PCR13                 (*(uint32_t *) (0x4004B034))

#define  PORTC_PCR14                 (*(uint32_t *) (0x4004B038))

#define  PORTC_PCR15                 (*(uint32_t *) (0x4004B03C))

#define  PORTC_PCR16                 (*(uint32_t *) (0x4004B040))

#define  PORTC_PCR17                 (*(uint32_t *) (0x4004B044))

#define  PORTC_PCR18                 (*(uint32_t *) (0x4004B048))

#define  PORTC_PCR19                 (*(uint32_t *) (0x4004B04C))

#define  PORTC_PCR20                 (*(uint32_t *) (0x4004B050))

#define  PORTC_PCR21                 (*(uint32_t *) (0x4004B054))

#define  PORTC_PCR22                 (*(uint32_t *) (0x4004B058))

#define  PORTC_PCR23                 (*(uint32_t *) (0x4004B05C))

#define  PORTC_PCR24                 (*(uint32_t *) (0x4004B060))

#define  PORTC_PCR25                 (*(uint32_t *) (0x4004B064))

#define  PORTC_PCR26                 (*(uint32_t *) (0x4004B068))

#define  PORTC_PCR27                 (*(uint32_t *) (0x4004B06C))

#define  PORTC_PCR28                 (*(uint32_t *) (0x4004B070))

#define  PORTC_PCR29                 (*(uint32_t *) (0x4004B074))

#define  PORTC_PCR30                 (*(uint32_t *) (0x4004B078))

#define  PORTC_PCR31                 (*(uint32_t *) (0x4004B07C))

#define  PORTC_GPCLR                 (*(uint32_t *) (0x4004B080))

#define  PORTC_GPCHR                 (*(uint32_t *) (0x4004B084))

#define  PORTC_ISFR                  (*(uint32_t *) (0x4004B0A0))

#define  PORTD_PCR0                  (*(uint32_t *) (0x4004C000))

#define  PORTD_PCR1                  (*(uint32_t *) (0x4004C004))

#define  PORTD_PCR2                  (*(uint32_t *) (0x4004C008))

#define  PORTD_PCR3                  (*(uint32_t *) (0x4004C00C))

#define  PORTD_PCR4                  (*(uint32_t *) (0x4004C010))

#define  PORTD_PCR5                  (*(uint32_t *) (0x4004C014))

#define  PORTD_PCR6                  (*(uint32_t *) (0x4004C018))

#define  PORTD_PCR7                  (*(uint32_t *) (0x4004C01C))

#define  PORTD_PCR8                  (*(uint32_t *) (0x4004C020))

#define  PORTD_PCR9                  (*(uint32_t *) (0x4004C024))

#define  PORTD_PCR10                 (*(uint32_t *) (0x4004C028))

#define  PORTD_PCR11                 (*(uint32_t *) (0x4004C02C))

#define  PORTD_PCR12                 (*(uint32_t *) (0x4004C030))

#define  PORTD_PCR13                 (*(uint32_t *) (0x4004C034))

#define  PORTD_PCR14                 (*(uint32_t *) (0x4004C038))

#define  PORTD_PCR15                 (*(uint32_t *) (0x4004C03C))

#define  PORTD_PCR16                 (*(uint32_t *) (0x4004C040))

#define  PORTD_PCR17                 (*(uint32_t *) (0x4004C044))

#define  PORTD_PCR18                 (*(uint32_t *) (0x4004C048))

#define  PORTD_PCR19                 (*(uint32_t *) (0x4004C04C))

#define  PORTD_PCR20                 (*(uint32_t *) (0x4004C050))

#define  PORTD_PCR21                 (*(uint32_t *) (0x4004C054))

#define  PORTD_PCR22                 (*(uint32_t *) (0x4004C058))

#define  PORTD_PCR23                 (*(uint32_t *) (0x4004C05C))

#define  PORTD_PCR24                 (*(uint32_t *) (0x4004C060))

#define  PORTD_PCR25                 (*(uint32_t *) (0x4004C064))

