ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  PORTD_PCR26                 (*(uint32_t *) (0x4004C068))

#define  PORTD_PCR27                 (*(uint32_t *) (0x4004C06C))

#define  PORTD_PCR28                 (*(uint32_t *) (0x4004C070))

#define  PORTD_PCR29                 (*(uint32_t *) (0x4004C074))

#define  PORTD_PCR30                 (*(uint32_t *) (0x4004C078))

#define  PORTD_PCR31                 (*(uint32_t *) (0x4004C07C))

#define  PORTD_GPCLR                 (*(uint32_t *) (0x4004C080))

#define  PORTD_GPCHR                 (*(uint32_t *) (0x4004C084))

#define  PORTD_ISFR                  (*(uint32_t *) (0x4004C0A0))

#define  PORTE_PCR0                  (*(uint32_t *) (0x4004D000))

#define  PORTE_PCR1                  (*(uint32_t *) (0x4004D004))

#define  PORTE_PCR2                  (*(uint32_t *) (0x4004D008))

#define  PORTE_PCR3                  (*(uint32_t *) (0x4004D00C))

#define  PORTE_PCR4                  (*(uint32_t *) (0x4004D010))

#define  PORTE_PCR5                  (*(uint32_t *) (0x4004D014))

#define  PORTE_PCR6                  (*(uint32_t *) (0x4004D018))

#define  PORTE_PCR7                  (*(uint32_t *) (0x4004D01C))

#define  PORTE_PCR8                  (*(uint32_t *) (0x4004D020))

#define  PORTE_PCR9                  (*(uint32_t *) (0x4004D024))

#define  PORTE_PCR10                 (*(uint32_t *) (0x4004D028))

#define  PORTE_PCR11                 (*(uint32_t *) (0x4004D02C))

#define  PORTE_PCR12                 (*(uint32_t *) (0x4004D030))

#define  PORTE_PCR13                 (*(uint32_t *) (0x4004D034))

#define  PORTE_PCR14                 (*(uint32_t *) (0x4004D038))

#define  PORTE_PCR15                 (*(uint32_t *) (0x4004D03C))

#define  PORTE_PCR16                 (*(uint32_t *) (0x4004D040))

#define  PORTE_PCR17                 (*(uint32_t *) (0x4004D044))

#define  PORTE_PCR18                 (*(uint32_t *) (0x4004D048))

#define  PORTE_PCR19                 (*(uint32_t *) (0x4004D04C))

#define  PORTE_PCR20                 (*(uint32_t *) (0x4004D050))

#define  PORTE_PCR21                 (*(uint32_t *) (0x4004D054))

#define  PORTE_PCR22                 (*(uint32_t *) (0x4004D058))

#define  PORTE_PCR23                 (*(uint32_t *) (0x4004D05C))

#define  PORTE_PCR24                 (*(uint32_t *) (0x4004D060))

#define  PORTE_PCR25                 (*(uint32_t *) (0x4004D064))

#define  PORTE_PCR26                 (*(uint32_t *) (0x4004D068))

#define  PORTE_PCR27                 (*(uint32_t *) (0x4004D06C))

#define  PORTE_PCR28                 (*(uint32_t *) (0x4004D070))

#define  PORTE_PCR29                 (*(uint32_t *) (0x4004D074))

#define  PORTE_PCR30                 (*(uint32_t *) (0x4004D078))

#define  PORTE_PCR31                 (*(uint32_t *) (0x4004D07C))

#define  PORTE_GPCLR                 (*(uint32_t *) (0x4004D080))

#define  PORTE_GPCHR                 (*(uint32_t *) (0x4004D084))

#define  PORTE_ISFR                  (*(uint32_t *) (0x4004D0A0))

#define  RCM_SRS0                    (*(uint8_t *) (0x4007F000))

#define  RCM_SRS1                    (*(uint8_t *) (0x4007F001))

#define  RCM_RPFC                    (*(uint8_t *) (0x4007F004))

#define  RCM_RPFW                    (*(uint8_t *) (0x4007F005))

#define  ROM_ENTRY0                  (*(uint32_t *) (0xF0004000))

#define  ROM_ENTRY1                  (*(uint32_t *) (0xF0004004))

#define  ROM_ENTRY2                  (*(uint32_t *) (0xF0004008))

#define  ROM_TABLEMARK               (*(uint32_t *) (0xF000400C))

#define  ROM_SYSACCESS               (*(uint32_t *) (0xF0004FCC))

#define  ROM_PERIPHID4               (*(uint32_t *) (0xF0004FD0))

#define  ROM_PERIPHID5               (*(uint32_t *) (0xF0004FD4))

#define  ROM_PERIPHID6               (*(uint32_t *) (0xF0004FD8))

#define  ROM_PERIPHID7               (*(uint32_t *) (0xF0004FDC))

#define  ROM_PERIPHID0               (*(uint32_t *) (0xF0004FE0))

#define  ROM_PERIPHID1               (*(uint32_t *) (0xF0004FE4))

#define  ROM_PERIPHID2               (*(uint32_t *) (0xF0004FE8))

#define  ROM_PERIPHID3               (*(uint32_t *) (0xF0004FEC))

#define  ROM_COMPID0                 (*(uint32_t *) (0xF0004FF0))

#define  ROM_COMPID1                 (*(uint32_t *) (0xF0004FF4))

#define  ROM_COMPID2                 (*(uint32_t *) (0xF0004FF8))

#define  ROM_COMPID3                 (*(uint32_t *) (0xF0004FFC))

#define  RTC_TSR                     (*(uint32_t *) (0x4003D000))

#define  RTC_TPR                     (*(uint32_t *) (0x4003D004))

#define  RTC_TAR                     (*(uint32_t *) (0x4003D008))

#define  RTC_TCR                     (*(uint32_t *) (0x4003D00C))

#define  RTC_CR                      (*(uint32_t *) (0x4003D010))

#define  RTC_SR                      (*(uint32_t *) (0x4003D014))

#define  RTC_LR                      (*(uint32_t *) (0x4003D018))

#define  RTC_IER                     (*(uint32_t *) (0x4003D01C))

#define  SIM_SOPT1                   (*(uint32_t *) (0x40047000))

#define  SIM_SOPT1CFG                (*(uint32_t *) (0x40047004))

#define  SIM_SOPT2                   (*(uint32_t *) (0x40048004))

#define  SIM_SOPT4                   (*(uint32_t *) (0x4004800C))

#define  SIM_SOPT5                   (*(uint32_t *) (0x40048010))

#define  SIM_SOPT7                   (*(uint32_t *) (0x40048018))

#define  SIM_SDID                    (*(uint32_t *) (0x40048024))

#define  SIM_SCGC4                   (*(uint32_t *) (0x40048034))

#define  SIM_SCGC5                   (*(uint32_t *) (0x40048038))

#define  SIM_SCGC6                   (*(uint32_t *) (0x4004803C))

#define  SIM_SCGC7                   (*(uint32_t *) (0x40048040))

#define  SIM_CLKDIV1                 (*(uint32_t *) (0x40048044))

#define  SIM_FCFG1                   (*(uint32_t *) (0x4004804C))

#define  SIM_FCFG2                   (*(uint32_t *) (0x40048050))

#define  SIM_UIDMH                   (*(uint32_t *) (0x40048058))

#define  SIM_UIDML                   (*(uint32_t *) (0x4004805C))

#define  SIM_UIDL                    (*(uint32_t *) (0x40048060))

#define  SIM_COPC                    (*(uint32_t *) (0x40048100))

#define  SIM_SRVCOP                  (*(uint32_t *) (0x40048104))

#define  SMC_PMPROT                  (*(uint8_t *) (0x4007E000))

#define  SMC_PMCTRL                  (*(uint8_t *) (0x4007E001))

#define  SMC_STOPCTRL                (*(uint8_t *) (0x4007E002))

#define  SMC_PMSTAT                  (*(uint8_t *) (0x4007E003))

#define  SPI0_C1                     (*(uint8_t *) (0x40076000))

#define  SPI0_C2                     (*(uint8_t *) (0x40076001))

#define  SPI0_BR                     (*(uint8_t *) (0x40076002))

#define  SPI0_S                      (*(uint8_t *) (0x40076003))

#define  SPI0_D                      (*(uint8_t *) (0x40076005))

