ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  SPI0_M                      (*(uint8_t *) (0x40076007))

#define  SPI1_C1                     (*(uint8_t *) (0x40077000))

#define  SPI1_C2                     (*(uint8_t *) (0x40077001))

#define  SPI1_BR                     (*(uint8_t *) (0x40077002))

#define  SPI1_S                      (*(uint8_t *) (0x40077003))

#define  SPI1_D                      (*(uint8_t *) (0x40077005))

#define  SPI1_M                      (*(uint8_t *) (0x40077007))

#define  TSI0_GENCS                  (*(uint32_t *) (0x40045000))

#define  TSI0_DATA                   (*(uint32_t *) (0x40045004))

#define  TSI0_TSHD                   (*(uint32_t *) (0x40045008))
/*
#define  UART0_BDH                   (*(uint8_t *) (0x4006A000))

#define  UART0_BDL                   (*(uint8_t *) (0x4006A001))

#define  UART0_C1                    (*(uint8_t *) (0x4006A002))

#define  UART0_C2                    (*(uint8_t *) (0x4006A003))

#define  UART0_S1                    (*(uint8_t *) (0x4006A004))

#define  UART0_S2                    (*(uint8_t *) (0x4006A005))

#define  UART0_C3                    (*(uint8_t *) (0x4006A006))

#define  UART0_D                     (*(uint8_t *) (0x4006A007))

#define  UART0_MA1                   (*(uint8_t *) (0x4006A008))

#define  UART0_MA2                   (*(uint8_t *) (0x4006A009))

#define  UART0_C4                    (*(uint8_t *) (0x4006A00A))

#define  UART0_C5                    (*(uint8_t *) (0x4006A00B))

#define  UART1_BDH                   (*(uint8_t *) (0x4006B000))

#define  UART1_BDL                   (*(uint8_t *) (0x4006B001))

#define  UART1_C1                    (*(uint8_t *) (0x4006B002))

#define  UART1_C2                    (*(uint8_t *) (0x4006B003))

#define  UART1_S1                    (*(uint8_t *) (0x4006B004))

#define  UART1_S2                    (*(uint8_t *) (0x4006B005))

#define  UART1_C3                    (*(uint8_t *) (0x4006B006))

#define  UART1_D                     (*(uint8_t *) (0x4006B007))

#define  UART1_C4                    (*(uint8_t *) (0x4006B008))

#define  UART2_BDH                   (*(uint8_t *) (0x4006C000))

#define  UART2_BDL                   (*(uint8_t *) (0x4006C001))

#define  UART2_C1                    (*(uint8_t *) (0x4006C002))

#define  UART2_C2                    (*(uint8_t *) (0x4006C003))

#define  UART2_S1                    (*(uint8_t *) (0x4006C004))

#define  UART2_S2                    (*(uint8_t *) (0x4006C005))

#define  UART2_C3                    (*(uint8_t *) (0x4006C006))

#define  UART2_D                     (*(uint8_t *) (0x4006C007))

#define  UART2_C4                    (*(uint8_t *) (0x4006C008))
*/
#define  USB0_PERID                  (*(uint8_t *) (0x40072000))

#define  USB0_IDCOMP                 (*(uint8_t *) (0x40072004))

#define  USB0_REV                    (*(uint8_t *) (0x40072008))

#define  USB0_ADDINFO                (*(uint8_t *) (0x4007200C))

#define  USB0_OTGISTAT               (*(uint8_t *) (0x40072010))

#define  USB0_OTGICR                 (*(uint8_t *) (0x40072014))

#define  USB0_OTGSTAT                (*(uint8_t *) (0x40072018))

#define  USB0_OTGCTL                 (*(uint8_t *) (0x4007201C))

#define  USB0_ISTAT                  (*(uint8_t *) (0x40072080))

#define  USB0_INTEN                  (*(uint8_t *) (0x40072084))

#define  USB0_ERRSTAT                (*(uint8_t *) (0x40072088))

#define  USB0_ERREN                  (*(uint8_t *) (0x4007208C))

#define  USB0_STAT                   (*(uint8_t *) (0x40072090))

#define  USB0_CTL                    (*(uint8_t *) (0x40072094))

#define  USB0_ADDR                   (*(uint8_t *) (0x40072098))

#define  USB0_BDTPAGE1               (*(uint8_t *) (0x4007209C))

#define  USB0_FRMNUML                (*(uint8_t *) (0x400720A0))

#define  USB0_FRMNUMH                (*(uint8_t *) (0x400720A4))

#define  USB0_TOKEN                  (*(uint8_t *) (0x400720A8))

#define  USB0_SOFTHLD                (*(uint8_t *) (0x400720AC))

#define  USB0_BDTPAGE2               (*(uint8_t *) (0x400720B0))

#define  USB0_BDTPAGE3               (*(uint8_t *) (0x400720B4))

#define  USB0_ENDPT0                 (*(uint8_t *) (0x400720C0))

#define  USB0_ENDPT1                 (*(uint8_t *) (0x400720C4))

#define  USB0_ENDPT2                 (*(uint8_t *) (0x400720C8))

#define  USB0_ENDPT3                 (*(uint8_t *) (0x400720CC))

#define  USB0_ENDPT4                 (*(uint8_t *) (0x400720D0))

#define  USB0_ENDPT5                 (*(uint8_t *) (0x400720D4))

#define  USB0_ENDPT6                 (*(uint8_t *) (0x400720D8))

#define  USB0_ENDPT7                 (*(uint8_t *) (0x400720DC))

#define  USB0_ENDPT8                 (*(uint8_t *) (0x400720E0))

#define  USB0_ENDPT9                 (*(uint8_t *) (0x400720E4))

#define  USB0_ENDPT10                (*(uint8_t *) (0x400720E8))

#define  USB0_ENDPT11                (*(uint8_t *) (0x400720EC))

#define  USB0_ENDPT12                (*(uint8_t *) (0x400720F0))

#define  USB0_ENDPT13                (*(uint8_t *) (0x400720F4))

#define  USB0_ENDPT14                (*(uint8_t *) (0x400720F8))

#define  USB0_ENDPT15                (*(uint8_t *) (0x400720FC))

#define  USB0_USBCTRL                (*(uint8_t *) (0x40072100))

#define  USB0_OBSERVE                (*(uint8_t *) (0x40072104))

#define  USB0_CONTROL                (*(uint8_t *) (0x40072108))

#define  USB0_USBTRC0                (*(uint8_t *) (0x4007210C))

//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register bitfield locations and includes some commentary on the meaning of some settings.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC0_SC1A_ADCH_MASK         0x1Fu
#define  ADC0_SC1A_ADCH_SHIFT        0
#define  ADC0_SC1A_ADCH(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_SC1A_ADCH_SHIFT))&ADC0_SC1A_ADCH_MASK)
//   Input channel select
//     0b00000 ==> When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input.
//     0b00001 ==> When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input.
//     0b00010 ==> When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input.
//     0b00011 ==> When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input.
//     0b00100 ==> When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved.
//     0b00101 ==> When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved.
//     0b00110 ==> When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved.
//     0b00111 ==> When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved.
//     0b01000 ==> When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved.
//     0b01001 ==> When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved.
//     0b01010 ==> When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved.
//     0b01011 ==> When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved.
//     0b01100 ==> When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved.
//     0b01101 ==> When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved.
//     0b01110 ==> When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved.
//     0b01111 ==> When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved.
//     0b10000 ==> When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved.
//     0b10001 ==> When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved.
//     0b10010 ==> When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved.
//     0b10011 ==> When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved.
//     0b10100 ==> When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved.
//     0b10101 ==> When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved.
//     0b10110 ==> When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved.
//     0b10111 ==> When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> When DIFF=0, Temp Sensor (single-ended) is selected as input; when DIFF=1, Temp Sensor (differential) is selected as input.
//     0b11011 ==> When DIFF=0, Bandgap (single-ended) is selected as input; when DIFF=1, Bandgap (differential) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> When DIFF=0,VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by SC2[REFSEL].
//     0b11110 ==> When DIFF=0,VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by SC2[REFSEL].
//     0b11111 ==> Module is disabled.

