ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  ADC0_SC1A_DIFF_MASK         0x20u
#define  ADC0_SC1A_DIFF_SHIFT        5
//   Differential Mode Enable
//     0b0 ==> Single-ended conversions and input channels are selected.
//     0b1 ==> Differential conversions and input channels are selected.

#define  ADC0_SC1A_AIEN_MASK         0x40u
#define  ADC0_SC1A_AIEN_SHIFT        6
//   Interrupt Enable
//     0b0 ==> Conversion complete interrupt is disabled.
//     0b1 ==> Conversion complete interrupt is enabled.

#define  ADC0_SC1A_COCO_MASK         0x80u
#define  ADC0_SC1A_COCO_SHIFT        7
//   Conversion Complete Flag
//     0b0 ==> Conversion is not completed.
//     0b1 ==> Conversion is completed.

#define  ADC0_SC1B_ADCH_MASK         0x1Fu
#define  ADC0_SC1B_ADCH_SHIFT        0
#define  ADC0_SC1B_ADCH(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_SC1B_ADCH_SHIFT))&ADC0_SC1B_ADCH_MASK)
//   Input channel select
//     0b00000 ==> When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input.
//     0b00001 ==> When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input.
//     0b00010 ==> When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input.
//     0b00011 ==> When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input.
//     0b00100 ==> When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved.
//     0b00101 ==> When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved.
//     0b00110 ==> When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved.
//     0b00111 ==> When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved.
//     0b01000 ==> When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved.
//     0b01001 ==> When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved.
//     0b01010 ==> When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved.
//     0b01011 ==> When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved.
//     0b01100 ==> When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved.
//     0b01101 ==> When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved.
//     0b01110 ==> When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved.
//     0b01111 ==> When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved.
//     0b10000 ==> When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved.
//     0b10001 ==> When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved.
//     0b10010 ==> When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved.
//     0b10011 ==> When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved.
//     0b10100 ==> When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved.
//     0b10101 ==> When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved.
//     0b10110 ==> When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved.
//     0b10111 ==> When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> When DIFF=0, Temp Sensor (single-ended) is selected as input; when DIFF=1, Temp Sensor (differential) is selected as input.
//     0b11011 ==> When DIFF=0, Bandgap (single-ended) is selected as input; when DIFF=1, Bandgap (differential) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> When DIFF=0,VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by SC2[REFSEL].
//     0b11110 ==> When DIFF=0,VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by SC2[REFSEL].
//     0b11111 ==> Module is disabled.

#define  ADC0_SC1B_DIFF_MASK         0x20u
#define  ADC0_SC1B_DIFF_SHIFT        5
//   Differential Mode Enable
//     0b0 ==> Single-ended conversions and input channels are selected.
//     0b1 ==> Differential conversions and input channels are selected.

#define  ADC0_SC1B_AIEN_MASK         0x40u
#define  ADC0_SC1B_AIEN_SHIFT        6
//   Interrupt Enable
//     0b0 ==> Conversion complete interrupt is disabled.
//     0b1 ==> Conversion complete interrupt is enabled.

#define  ADC0_SC1B_COCO_MASK         0x80u
#define  ADC0_SC1B_COCO_SHIFT        7
//   Conversion Complete Flag
//     0b0 ==> Conversion is not completed.
//     0b1 ==> Conversion is completed.

#define  ADC0_CFG1_ADICLK_MASK       0x3u
#define  ADC0_CFG1_ADICLK_SHIFT      0
#define  ADC0_CFG1_ADICLK(x)         (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_ADICLK_SHIFT))&ADC0_CFG1_ADICLK_MASK)
//   Input Clock Select
//     0b00 ==> Bus clock
//     0b01 ==> (Bus clock)/2
//     0b10 ==> Alternate clock (ALTCLK)
//     0b11 ==> Asynchronous clock (ADACK)

#define  ADC0_CFG1_MODE_MASK         0xCu
#define  ADC0_CFG1_MODE_SHIFT        2
#define  ADC0_CFG1_MODE(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_MODE_SHIFT))&ADC0_CFG1_MODE_MASK)
//   Conversion mode selection
//     0b00 ==> When DIFF=0:It is single-ended 8-bit conversion; when DIFF=1, it is differential 9-bit conversion with 2's complement output.
//     0b01 ==> When DIFF=0:It is single-ended 12-bit conversion ; when DIFF=1, it is differential 13-bit conversion with 2's complement output.
//     0b10 ==> When DIFF=0:It is single-ended 10-bit conversion ; when DIFF=1, it is differential 11-bit conversion with 2's complement output.
//     0b11 ==> When DIFF=0:It is single-ended 16-bit conversion; when DIFF=1, it is differential 16-bit conversion with 2's complement output.

#define  ADC0_CFG1_ADLSMP_MASK       0x10u
#define  ADC0_CFG1_ADLSMP_SHIFT      4
//   Sample time configuration
//     0b0 ==> Short sample time.
//     0b1 ==> Long sample time.

#define  ADC0_CFG1_ADIV_MASK         0x60u
#define  ADC0_CFG1_ADIV_SHIFT        5
#define  ADC0_CFG1_ADIV(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_ADIV_SHIFT))&ADC0_CFG1_ADIV_MASK)
//   Clock Divide Select
//     0b00 ==> The divide ratio is 1 and the clock rate is input clock.
//     0b01 ==> The divide ratio is 2 and the clock rate is (input clock)/2.
//     0b10 ==> The divide ratio is 4 and the clock rate is (input clock)/4.
//     0b11 ==> The divide ratio is 8 and the clock rate is (input clock)/8.

