ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  ADC0_CFG1_ADLPC_MASK        0x80u
#define  ADC0_CFG1_ADLPC_SHIFT       7
//   Low-Power Configuration
//     0b0 ==> Normal power configuration.
//     0b1 ==> Low-power configuration. The power is reduced at the expense of maximum clock speed.

#define  ADC0_CFG2_ADLSTS_MASK       0x3u
#define  ADC0_CFG2_ADLSTS_SHIFT      0
#define  ADC0_CFG2_ADLSTS(x)         (((uint32_t)(((uint32_t)(x))<<ADC0_CFG2_ADLSTS_SHIFT))&ADC0_CFG2_ADLSTS_MASK)
//   Long Sample Time Select
//     0b00 ==> Default longest sample time; 20 extra ADCK cycles; 24 ADCK cycles total.
//     0b01 ==> 12 extra ADCK cycles; 16 ADCK cycles total sample time.
//     0b10 ==> 6 extra ADCK cycles; 10 ADCK cycles total sample time.
//     0b11 ==> 2 extra ADCK cycles; 6 ADCK cycles total sample time.

#define  ADC0_CFG2_ADHSC_MASK        0x4u
#define  ADC0_CFG2_ADHSC_SHIFT       2
//   High-Speed Configuration
//     0b0 ==> Normal conversion sequence selected.
//     0b1 ==> High-speed conversion sequence selected with 2 additional ADCK cycles to total conversion time.

#define  ADC0_CFG2_ADACKEN_MASK      0x8u
#define  ADC0_CFG2_ADACKEN_SHIFT     3
//   Asynchronous Clock Output Enable
//     0b0 ==> Asynchronous clock output disabled; Asynchronous clock is enabled only if selected by ADICLK and a conversion is active.
//     0b1 ==> Asynchronous clock and clock output is enabled regardless of the state of the ADC.

#define  ADC0_CFG2_MUXSEL_MASK       0x10u
#define  ADC0_CFG2_MUXSEL_SHIFT      4
//   ADC Mux Select
//     0b0 ==> ADxxa channels are selected.
//     0b1 ==> ADxxb channels are selected.

#define  ADC0_RA_D_MASK              0xFFFFu
#define  ADC0_RA_D_SHIFT             0
#define  ADC0_RA_D(x)                (((uint32_t)(((uint32_t)(x))<<ADC0_RA_D_SHIFT))&ADC0_RA_D_MASK)
//   Data result.

#define  ADC0_RB_D_MASK              0xFFFFu
#define  ADC0_RB_D_SHIFT             0
#define  ADC0_RB_D(x)                (((uint32_t)(((uint32_t)(x))<<ADC0_RB_D_SHIFT))&ADC0_RB_D_MASK)
//   Data result.

#define  ADC0_CV1_CV_MASK            0xFFFFu
#define  ADC0_CV1_CV_SHIFT           0
#define  ADC0_CV1_CV(x)              (((uint32_t)(((uint32_t)(x))<<ADC0_CV1_CV_SHIFT))&ADC0_CV1_CV_MASK)
//   Compare Value.

#define  ADC0_CV2_CV_MASK            0xFFFFu
#define  ADC0_CV2_CV_SHIFT           0
#define  ADC0_CV2_CV(x)              (((uint32_t)(((uint32_t)(x))<<ADC0_CV2_CV_SHIFT))&ADC0_CV2_CV_MASK)
//   Compare Value.

#define  ADC0_SC2_REFSEL_MASK        0x3u
#define  ADC0_SC2_REFSEL_SHIFT       0
#define  ADC0_SC2_REFSEL(x)          (((uint32_t)(((uint32_t)(x))<<ADC0_SC2_REFSEL_SHIFT))&ADC0_SC2_REFSEL_MASK)
//   Voltage Reference Selection
//     0b00 ==> Default voltage reference pin pair, that is, external pins V and V REFH REFL
//     0b01 ==> Alternate reference pair, that is, V and V . This pair may be additional external pins or internal sources depending on the MCU configuration. See the chip configuration information for details specific to this MCU. ALTH ALTL
//     0b10 ==> Internal bandgap reference and associated ground reference (V BGH and V BGL ). Consult the Chip Configuration information for details specific to this MCU.
//     0b11 ==> Reserved

#define  ADC0_SC2_DMAEN_MASK         0x4u
#define  ADC0_SC2_DMAEN_SHIFT        2
//   DMA Enable
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled and will assert the ADC DMA request during an ADC conversion complete event noted when any of the SC1n[COCO] flags is asserted.

#define  ADC0_SC2_ACREN_MASK         0x8u
#define  ADC0_SC2_ACREN_SHIFT        3
//   Compare Function Range Enable
//     0b0 ==> Range function disabled. Only CV1 is compared.
//     0b1 ==> Range function enabled. Both CV1 and CV2 are compared.

#define  ADC0_SC2_ACFGT_MASK         0x10u
#define  ADC0_SC2_ACFGT_SHIFT        4
//   Compare Function Greater Than Enable
//     0b0 ==> Configures less than threshold, outside range not inclusive and inside range not inclusive; functionality based on the values placed in CV1 and CV2.
//     0b1 ==> Configures greater than or equal to threshold, outside and inside ranges inclusive; functionality based on the values placed in CV1 and CV2.

#define  ADC0_SC2_ACFE_MASK          0x20u
#define  ADC0_SC2_ACFE_SHIFT         5
//   Compare Function Enable
//     0b0 ==> Compare function disabled.
//     0b1 ==> Compare function enabled.

#define  ADC0_SC2_ADTRG_MASK         0x40u
#define  ADC0_SC2_ADTRG_SHIFT        6
//   Conversion Trigger Select
//     0b0 ==> Software trigger selected.
//     0b1 ==> Hardware trigger selected.

#define  ADC0_SC2_ADACT_MASK         0x80u
#define  ADC0_SC2_ADACT_SHIFT        7
//   Conversion Active
//     0b0 ==> Conversion not in progress.
//     0b1 ==> Conversion in progress.

#define  ADC0_SC3_AVGS_MASK          0x3u
#define  ADC0_SC3_AVGS_SHIFT         0
#define  ADC0_SC3_AVGS(x)            (((uint32_t)(((uint32_t)(x))<<ADC0_SC3_AVGS_SHIFT))&ADC0_SC3_AVGS_MASK)
//   Hardware Average Select
//     0b00 ==> 4 samples averaged.
//     0b01 ==> 8 samples averaged.
//     0b10 ==> 16 samples averaged.
//     0b11 ==> 32 samples averaged.

#define  ADC0_SC3_AVGE_MASK          0x4u
#define  ADC0_SC3_AVGE_SHIFT         2
//   Hardware Average Enable
//     0b0 ==> Hardware average function disabled.
//     0b1 ==> Hardware average function enabled.

#define  ADC0_SC3_ADCO_MASK          0x8u
#define  ADC0_SC3_ADCO_SHIFT         3
//   Continuous Conversion Enable
//     0b0 ==> One conversion or one set of conversions if the hardware average function is enabled, that is, AVGE=1, after initiating a conversion.
//     0b1 ==> Continuous conversions or sets of conversions if the hardware average function is enabled, that is, AVGE=1, after initiating a conversion.

#define  ADC0_SC3_CALF_MASK          0x40u
#define  ADC0_SC3_CALF_SHIFT         6
//   Calibration Failed Flag
//     0b0 ==> Calibration completed normally.
//     0b1 ==> Calibration failed. ADC accuracy specifications are not guaranteed.

#define  ADC0_SC3_CAL_MASK           0x80u
#define  ADC0_SC3_CAL_SHIFT          7
//   Calibration

#define  ADC0_OFS_OFS_MASK           0xFFFFu
#define  ADC0_OFS_OFS_SHIFT          0
#define  ADC0_OFS_OFS(x)             (((uint32_t)(((uint32_t)(x))<<ADC0_OFS_OFS_SHIFT))&ADC0_OFS_OFS_MASK)
//   Offset Error Correction Value

#define  ADC0_PG_PG_MASK             0xFFFFu
#define  ADC0_PG_PG_SHIFT            0
#define  ADC0_PG_PG(x)               (((uint32_t)(((uint32_t)(x))<<ADC0_PG_PG_SHIFT))&ADC0_PG_PG_MASK)
//   Plus-Side Gain

#define  ADC0_MG_MG_MASK             0xFFFFu
#define  ADC0_MG_MG_SHIFT            0
#define  ADC0_MG_MG(x)               (((uint32_t)(((uint32_t)(x))<<ADC0_MG_MG_SHIFT))&ADC0_MG_MG_MASK)
//   Minus-Side Gain

#define  ADC0_CLPD_CLPD_MASK         0x3Fu
#define  ADC0_CLPD_CLPD_SHIFT        0
#define  ADC0_CLPD_CLPD(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLPD_CLPD_SHIFT))&ADC0_CLPD_CLPD_MASK)

#define  ADC0_CLPS_CLPS_MASK         0x3Fu
#define  ADC0_CLPS_CLPS_SHIFT        0
#define  ADC0_CLPS_CLPS(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLPS_CLPS_SHIFT))&ADC0_CLPS_CLPS_MASK)

#define  ADC0_CLP4_CLP4_MASK         0x3FFu
#define  ADC0_CLP4_CLP4_SHIFT        0
#define  ADC0_CLP4_CLP4(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP4_CLP4_SHIFT))&ADC0_CLP4_CLP4_MASK)

