ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  CMP0_SCR_IEF_MASK           0x8u
#define  CMP0_SCR_IEF_SHIFT          3
//   Comparator Interrupt Enable Falling
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  CMP0_SCR_IER_MASK           0x10u
#define  CMP0_SCR_IER_SHIFT          4
//   Comparator Interrupt Enable Rising
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  CMP0_SCR_DMAEN_MASK         0x40u
#define  CMP0_SCR_DMAEN_SHIFT        6
//   DMA Enable Control
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled.

#define  CMP0_DACCR_VOSEL_MASK       0x3Fu
#define  CMP0_DACCR_VOSEL_SHIFT      0
#define  CMP0_DACCR_VOSEL(x)         (((uint8_t)(((uint8_t)(x))<<CMP0_DACCR_VOSEL_SHIFT))&CMP0_DACCR_VOSEL_MASK)
//   DAC Output Voltage Select

#define  CMP0_DACCR_VRSEL_MASK       0x40u
#define  CMP0_DACCR_VRSEL_SHIFT      6
//   Supply Voltage Reference Source Select
//     0b0 ==> V is selected as resistor ladder network supply reference V. in1 in
//     0b1 ==> V is selected as resistor ladder network supply reference V. in2 in

#define  CMP0_DACCR_DACEN_MASK       0x80u
#define  CMP0_DACCR_DACEN_SHIFT      7
//   DAC Enable
//     0b0 ==> DAC is disabled.
//     0b1 ==> DAC is enabled.

#define  CMP0_MUXCR_MSEL_MASK        0x7u
#define  CMP0_MUXCR_MSEL_SHIFT       0
#define  CMP0_MUXCR_MSEL(x)          (((uint8_t)(((uint8_t)(x))<<CMP0_MUXCR_MSEL_SHIFT))&CMP0_MUXCR_MSEL_MASK)
//   Minus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP0_MUXCR_PSEL_MASK        0x38u
#define  CMP0_MUXCR_PSEL_SHIFT       3
#define  CMP0_MUXCR_PSEL(x)          (((uint8_t)(((uint8_t)(x))<<CMP0_MUXCR_PSEL_SHIFT))&CMP0_MUXCR_PSEL_MASK)
//   Plus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP0_MUXCR_PSTM_MASK        0x40u
#define  CMP0_MUXCR_PSTM_SHIFT       6
//   Pass Through Mode Enable
//     0b0 ==> Pass Through Mode is disabled.
//     0b1 ==> Pass Through Mode is enabled.

#define  DAC0_DAT0L_DATA0_MASK       0xFFu
#define  DAC0_DAT0L_DATA0_SHIFT      0
#define  DAC0_DAT0L_DATA0(x)         (((uint8_t)(((uint8_t)(x))<<DAC0_DAT0L_DATA0_SHIFT))&DAC0_DAT0L_DATA0_MASK)

#define  DAC0_DAT0H_DATA1_MASK       0xFu
#define  DAC0_DAT0H_DATA1_SHIFT      0
#define  DAC0_DAT0H_DATA1(x)         (((uint8_t)(((uint8_t)(x))<<DAC0_DAT0H_DATA1_SHIFT))&DAC0_DAT0H_DATA1_MASK)

#define  DAC0_DAT1L_DATA0_MASK       0xFFu
#define  DAC0_DAT1L_DATA0_SHIFT      0
#define  DAC0_DAT1L_DATA0(x)         (((uint8_t)(((uint8_t)(x))<<DAC0_DAT1L_DATA0_SHIFT))&DAC0_DAT1L_DATA0_MASK)

#define  DAC0_DAT1H_DATA1_MASK       0xFu
#define  DAC0_DAT1H_DATA1_SHIFT      0
#define  DAC0_DAT1H_DATA1(x)         (((uint8_t)(((uint8_t)(x))<<DAC0_DAT1H_DATA1_SHIFT))&DAC0_DAT1H_DATA1_MASK)

#define  DAC0_SR_DACBFRPBF_MASK      0x1u
#define  DAC0_SR_DACBFRPBF_SHIFT     0
//   DAC Buffer Read Pointer Bottom Position Flag
//     0b0 ==> The DAC buffer read pointer is not equal to C2[DACBFUP].
//     0b1 ==> The DAC buffer read pointer is equal to C2[DACBFUP].

#define  DAC0_SR_DACBFRPTF_MASK      0x2u
#define  DAC0_SR_DACBFRPTF_SHIFT     1
//   DAC Buffer Read Pointer Top Position Flag
//     0b0 ==> The DAC buffer read pointer is not zero.
//     0b1 ==> The DAC buffer read pointer is zero.

#define  DAC0_C0_DACBBIEN_MASK       0x1u
#define  DAC0_C0_DACBBIEN_SHIFT      0
//   DAC Buffer Read Pointer Bottom Flag Interrupt Enable
//     0b0 ==> The DAC buffer read pointer bottom flag interrupt is disabled.
//     0b1 ==> The DAC buffer read pointer bottom flag interrupt is enabled.

#define  DAC0_C0_DACBTIEN_MASK       0x2u
#define  DAC0_C0_DACBTIEN_SHIFT      1
//   DAC Buffer Read Pointer Top Flag Interrupt Enable
//     0b0 ==> The DAC buffer read pointer top flag interrupt is disabled.
//     0b1 ==> The DAC buffer read pointer top flag interrupt is enabled.

#define  DAC0_C0_LPEN_MASK           0x8u
#define  DAC0_C0_LPEN_SHIFT          3
//   DAC Low Power Control
//     0b0 ==> High-Power mode
//     0b1 ==> Low-Power mode

#define  DAC0_C0_DACSWTRG_MASK       0x10u
#define  DAC0_C0_DACSWTRG_SHIFT      4
//   DAC Software Trigger
//     0b0 ==> The DAC soft trigger is not valid.
//     0b1 ==> The DAC soft trigger is valid.

#define  DAC0_C0_DACTRGSEL_MASK      0x20u
#define  DAC0_C0_DACTRGSEL_SHIFT     5
//   DAC Trigger Select
//     0b0 ==> The DAC hardware trigger is selected.
//     0b1 ==> The DAC software trigger is selected.

#define  DAC0_C0_DACRFS_MASK         0x40u
#define  DAC0_C0_DACRFS_SHIFT        6
//   DAC Reference Select
//     0b0 ==> The DAC selects DACREF_1 as the reference voltage.
//     0b1 ==> The DAC selects DACREF_2 as the reference voltage.

#define  DAC0_C0_DACEN_MASK          0x80u
#define  DAC0_C0_DACEN_SHIFT         7
//   DAC Enable
//     0b0 ==> The DAC system is disabled.
//     0b1 ==> The DAC system is enabled.

#define  DAC0_C1_DACBFEN_MASK        0x1u
#define  DAC0_C1_DACBFEN_SHIFT       0
//   DAC Buffer Enable
//     0b0 ==> Buffer read pointer is disabled. The converted data is always the first word of the buffer.
//     0b1 ==> Buffer read pointer is enabled. The converted data is the word that the read pointer points to. It means converted data can be from any word of the buffer.

#define  DAC0_C1_DACBFMD_MASK        0x4u
#define  DAC0_C1_DACBFMD_SHIFT       2
//   DAC Buffer Work Mode Select
//     0b0 ==> Normal mode
//     0b1 ==> One-Time Scan mode

#define  DAC0_C1_DMAEN_MASK          0x80u
#define  DAC0_C1_DMAEN_SHIFT         7
//   DMA Enable Select
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled. When DMA is enabled, the DMA request will be generated by original interrupts. The interrupts will not be presented on this module at the same time.

#define  DAC0_C2_DACBFUP_MASK        0x1u
#define  DAC0_C2_DACBFUP_SHIFT       0
//   DAC Buffer Upper Limit

#define  DAC0_C2_DACBFRP_MASK        0x10u
#define  DAC0_C2_DACBFRP_SHIFT       4
//   DAC Buffer Read Pointer

