ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  DMA_SAR0_SAR_MASK           0xFFFFFFFFu
#define  DMA_SAR0_SAR_SHIFT          0
#define  DMA_SAR0_SAR(x)             (((uint32_t)(((uint32_t)(x))<<DMA_SAR0_SAR_SHIFT))&DMA_SAR0_SAR_MASK)

#define  DMA_DAR0_DAR_MASK           0xFFFFFFFFu
#define  DMA_DAR0_DAR_SHIFT          0
#define  DMA_DAR0_DAR(x)             (((uint32_t)(((uint32_t)(x))<<DMA_DAR0_DAR_SHIFT))&DMA_DAR0_DAR_MASK)

#define  DMA_DSR_BCR0_BCR_MASK       0xFFFFFFu
#define  DMA_DSR_BCR0_BCR_SHIFT      0
#define  DMA_DSR_BCR0_BCR(x)         (((uint32_t)(((uint32_t)(x))<<DMA_DSR_BCR0_BCR_SHIFT))&DMA_DSR_BCR0_BCR_MASK)

#define  DMA_DSR_BCR0_DONE_MASK      0x1000000u
#define  DMA_DSR_BCR0_DONE_SHIFT     24
//   Transactions done
//     0b0 ==> DMA transfer is not yet complete. Writing a 0 has no effect.
//     0b1 ==> DMA transfer completed. Writing a 1 to this bit clears all DMA status bits and should be used in an interrupt service routine to clear the DMA interrupt and error bits.

#define  DMA_DSR_BCR0_BSY_MASK       0x2000000u
#define  DMA_DSR_BCR0_BSY_SHIFT      25
//   Busy
//     0b0 ==> DMA channel is inactive. Cleared when the DMA has finished the last transaction.
//     0b1 ==> BSY is set the first time the channel is enabled after a transfer is initiated.

#define  DMA_DSR_BCR0_REQ_MASK       0x4000000u
#define  DMA_DSR_BCR0_REQ_SHIFT      26
//   Request
//     0b0 ==> No request is pending or the channel is currently active. Cleared when the channel is selected.
//     0b1 ==> The DMA channel has a transfer remaining and the channel is not selected.

#define  DMA_DSR_BCR0_BED_MASK       0x10000000u
#define  DMA_DSR_BCR0_BED_SHIFT      28
//   Bus error on destination
//     0b0 ==> No bus error occurred.
//     0b1 ==> The DMA channel terminated with a bus error during the write portion of a transfer.

#define  DMA_DSR_BCR0_BES_MASK       0x20000000u
#define  DMA_DSR_BCR0_BES_SHIFT      29
//   Bus error on source
//     0b0 ==> No bus error occurred.
//     0b1 ==> The DMA channel terminated with a bus error during the read portion of a transfer.

#define  DMA_DSR_BCR0_CE_MASK        0x40000000u
#define  DMA_DSR_BCR0_CE_SHIFT       30
//   Configuration error
//     0b0 ==> No configuration error exists.
//     0b1 ==> A configuration error has occurred.

#define  DMA_DCR0_LCH2_MASK          0x3u
#define  DMA_DCR0_LCH2_SHIFT         0
#define  DMA_DCR0_LCH2(x)            (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_LCH2_SHIFT))&DMA_DCR0_LCH2_MASK)
//   Link channel 2
//     0b00 ==> DMA Channel 0
//     0b01 ==> DMA Channel 1
//     0b10 ==> DMA Channel 2
//     0b11 ==> DMA Channel 3

#define  DMA_DCR0_LCH1_MASK          0xCu
#define  DMA_DCR0_LCH1_SHIFT         2
#define  DMA_DCR0_LCH1(x)            (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_LCH1_SHIFT))&DMA_DCR0_LCH1_MASK)
//   Link channel 1
//     0b00 ==> DMA Channel 0
//     0b01 ==> DMA Channel 1
//     0b10 ==> DMA Channel 2
//     0b11 ==> DMA Channel 3

#define  DMA_DCR0_LINKCC_MASK        0x30u
#define  DMA_DCR0_LINKCC_SHIFT       4
#define  DMA_DCR0_LINKCC(x)          (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_LINKCC_SHIFT))&DMA_DCR0_LINKCC_MASK)
//   Link channel control
//     0b00 ==> No channel-to-channel linking
//     0b01 ==> Perform a link to channel LCH1 after each cycle-steal transfer followed by a link to LCH2 after the BCR decrements to zero
//     0b10 ==> Perform a link to channel LCH1 after each cycle-steal transfer
//     0b11 ==> Perform a link to channel LCH1 after the BCR decrements to zero

#define  DMA_DCR0_D_REQ_MASK         0x80u
#define  DMA_DCR0_D_REQ_SHIFT        7
//   Disable request
//     0b0 ==> ERQ bit is not affected.
//     0b1 ==> ERQ bit is cleared when the BCR is exhausted.

#define  DMA_DCR0_DMOD_MASK          0xF00u
#define  DMA_DCR0_DMOD_SHIFT         8
#define  DMA_DCR0_DMOD(x)            (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_DMOD_SHIFT))&DMA_DCR0_DMOD_MASK)
//   Destination address modulo
//     0b0000 ==> Buffer disabled
//     0b0001 ==> Circular buffer size is 16 bytes
//     0b0010 ==> Circular buffer size is 32 bytes
//     0b0011 ==> Circular buffer size is 64 bytes
//     0b0100 ==> Circular buffer size is 128 bytes
//     0b0101 ==> Circular buffer size is 256 bytes
//     0b0110 ==> Circular buffer size is 512 bytes
//     0b0111 ==> Circular buffer size is 1 KB
//     0b1000 ==> Circular buffer size is 2 KB
//     0b1001 ==> Circular buffer size is 4 KB
//     0b1010 ==> Circular buffer size is 8 KB
//     0b1011 ==> Circular buffer size is 16 KB
//     0b1100 ==> Circular buffer size is 32 KB
//     0b1101 ==> Circular buffer size is 64 KB
//     0b1110 ==> Circular buffer size is 128 KB
//     0b1111 ==> Circular buffer size is 256 KB

#define  DMA_DCR0_SMOD_MASK          0xF000u
#define  DMA_DCR0_SMOD_SHIFT         12
#define  DMA_DCR0_SMOD(x)            (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_SMOD_SHIFT))&DMA_DCR0_SMOD_MASK)
//   Source address modulo
//     0b0000 ==> Buffer disabled
//     0b0001 ==> Circular buffer size is 16 bytes
//     0b0010 ==> Circular buffer size is 32 bytes
//     0b0011 ==> Circular buffer size is 64 bytes
//     0b0100 ==> Circular buffer size is 128 bytes
//     0b0101 ==> Circular buffer size is 256 bytes
//     0b0110 ==> Circular buffer size is 512 bytes
//     0b0111 ==> Circular buffer size is 1 KB
//     0b1000 ==> Circular buffer size is 2 KB
//     0b1001 ==> Circular buffer size is 4 KB
//     0b1010 ==> Circular buffer size is 8 KB
//     0b1011 ==> Circular buffer size is 16 KB
//     0b1100 ==> Circular buffer size is 32 KB
//     0b1101 ==> Circular buffer size is 64 KB
//     0b1110 ==> Circular buffer size is 128 KB
//     0b1111 ==> Circular buffer size is 256 KB

#define  DMA_DCR0_START_MASK         0x10000u
#define  DMA_DCR0_START_SHIFT        16
//   Start transfer
//     0b0 ==> DMA inactive
//     0b1 ==> The DMA begins the transfer in accordance to the values in the TCDn. START is cleared automatically after one module clock and always reads as logic 0.

#define  DMA_DCR0_DSIZE_MASK         0x60000u
#define  DMA_DCR0_DSIZE_SHIFT        17
#define  DMA_DCR0_DSIZE(x)           (((uint32_t)(((uint32_t)(x))<<DMA_DCR0_DSIZE_SHIFT))&DMA_DCR0_DSIZE_MASK)
//   Destination size
//     0b00 ==> Longword
//     0b01 ==> Byte
//     0b10 ==> Word
//     0b11 ==> Reserved (generates a configuration error (DSRn[CE]) if incorrectly specified at time of channel activation)

#define  DMA_DCR0_DINC_MASK          0x80000u
#define  DMA_DCR0_DINC_SHIFT         19
//   Destination increment
//     0b0 ==> No change to the DAR after a successful transfer.
//     0b1 ==> The DAR increments by 1, 2, 4 depending upon the size of the transfer.

