ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  FTM0_CONF_CSOO_MASK         0x20000u
#define  FTM0_CONF_CSOO_SHIFT        17
//   Counter Stop On Overflow
//     0b0 ==> FTM counter continues incrementing or decrementing after overflow
//     0b1 ==> FTM counter stops incrementing or decrementing after overflow.

#define  FTM0_CONF_CROT_MASK         0x40000u
#define  FTM0_CONF_CROT_SHIFT        18
//   Counter Reload On Trigger
//     0b0 ==> Counter is not reloaded due to a rising edge on the selected input trigger
//     0b1 ==> Counter is reloaded when a rising edge is detected on the selected input trigger

#define  FTM0_CONF_TRGSEL_MASK       0xF000000u
#define  FTM0_CONF_TRGSEL_SHIFT      24
#define  FTM0_CONF_TRGSEL(x)         (((uint32_t)(((uint32_t)(x))<<FTM0_CONF_TRGSEL_SHIFT))&FTM0_CONF_TRGSEL_MASK)
//   Trigger Select

#define  FTM1_SC_PS_MASK             0x7u
#define  FTM1_SC_PS_SHIFT            0
#define  FTM1_SC_PS(x)               (((uint32_t)(((uint32_t)(x))<<FTM1_SC_PS_SHIFT))&FTM1_SC_PS_MASK)
//   Prescale Factor Selection
//     0b000 ==> Divide by 1
//     0b001 ==> Divide by 2
//     0b010 ==> Divide by 4
//     0b011 ==> Divide by 8
//     0b100 ==> Divide by 16
//     0b101 ==> Divide by 32
//     0b110 ==> Divide by 64
//     0b111 ==> Divide by 128

#define  FTM1_SC_CMOD_MASK           0x18u
#define  FTM1_SC_CMOD_SHIFT          3
#define  FTM1_SC_CMOD(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_SC_CMOD_SHIFT))&FTM1_SC_CMOD_MASK)
//   Clock Mode Selection
//     0b00 ==> FTM counter is disabled
//     0b01 ==> FTM counter increments on every FTM counter clock
//     0b10 ==> FTM counter increments on rising edge of FTM_EXTCLK synchronized to the FTM counter clock
//     0b11 ==> Reserved

#define  FTM1_SC_CPWMS_MASK          0x20u
#define  FTM1_SC_CPWMS_SHIFT         5
//   Center-aligned PWM Select
//     0b0 ==> FTM counter operates in up counting mode.
//     0b1 ==> FTM counter operates in up-down counting mode.

#define  FTM1_SC_TOIE_MASK           0x40u
#define  FTM1_SC_TOIE_SHIFT          6
//   Timer Overflow Interrupt Enable
//     0b0 ==> Disable TOF interrupts. Use software polling or DMA request.
//     0b1 ==> Enable TOF interrupts. An interrupt is generated when TOF equals one.

#define  FTM1_SC_TOF_MASK            0x80u
#define  FTM1_SC_TOF_SHIFT           7
//   Timer Overflow Flag
//     0b0 ==> FTM counter has not overflowed.
//     0b1 ==> FTM counter has overflowed.

#define  FTM1_SC_DMA_MASK            0x100u
#define  FTM1_SC_DMA_SHIFT           8
//   DMA Enable
//     0b0 ==> Disables DMA transfers.
//     0b1 ==> Enables DMA transfers.

#define  FTM1_CNT_COUNT_MASK         0xFFFFu
#define  FTM1_CNT_COUNT_SHIFT        0
#define  FTM1_CNT_COUNT(x)           (((uint32_t)(((uint32_t)(x))<<FTM1_CNT_COUNT_SHIFT))&FTM1_CNT_COUNT_MASK)
//   Counter value

#define  FTM1_MOD_MOD_MASK           0xFFFFu
#define  FTM1_MOD_MOD_SHIFT          0
#define  FTM1_MOD_MOD(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_MOD_MOD_SHIFT))&FTM1_MOD_MOD_MASK)
//   Modulo value

#define  FTM1_C0SC_DMA_MASK          0x1u
#define  FTM1_C0SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C0SC_ELSA_MASK         0x4u
#define  FTM1_C0SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C0SC_ELSB_MASK         0x8u
#define  FTM1_C0SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C0SC_MSA_MASK          0x10u
#define  FTM1_C0SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C0SC_MSB_MASK          0x20u
#define  FTM1_C0SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C0SC_CHIE_MASK         0x40u
#define  FTM1_C0SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C0SC_CHF_MASK          0x80u
#define  FTM1_C0SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_C0V_VAL_MASK           0xFFFFu
#define  FTM1_C0V_VAL_SHIFT          0
#define  FTM1_C0V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C0V_VAL_SHIFT))&FTM1_C0V_VAL_MASK)
//   Channel Value

#define  FTM1_C1SC_DMA_MASK          0x1u
#define  FTM1_C1SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C1SC_ELSA_MASK         0x4u
#define  FTM1_C1SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C1SC_ELSB_MASK         0x8u
#define  FTM1_C1SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C1SC_MSA_MASK          0x10u
#define  FTM1_C1SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C1SC_MSB_MASK          0x20u
#define  FTM1_C1SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C1SC_CHIE_MASK         0x40u
#define  FTM1_C1SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C1SC_CHF_MASK          0x80u
#define  FTM1_C1SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_C1V_VAL_MASK           0xFFFFu
#define  FTM1_C1V_VAL_SHIFT          0
#define  FTM1_C1V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C1V_VAL_SHIFT))&FTM1_C1V_VAL_MASK)
//   Channel Value

#define  FTM1_C2SC_DMA_MASK          0x1u
#define  FTM1_C2SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C2SC_ELSA_MASK         0x4u
#define  FTM1_C2SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C2SC_ELSB_MASK         0x8u
#define  FTM1_C2SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C2SC_MSA_MASK          0x10u
#define  FTM1_C2SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C2SC_MSB_MASK          0x20u
#define  FTM1_C2SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C2SC_CHIE_MASK         0x40u
#define  FTM1_C2SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C2SC_CHF_MASK          0x80u
#define  FTM1_C2SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

