ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  FTM1_C2V_VAL_MASK           0xFFFFu
#define  FTM1_C2V_VAL_SHIFT          0
#define  FTM1_C2V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C2V_VAL_SHIFT))&FTM1_C2V_VAL_MASK)
//   Channel Value

#define  FTM1_C3SC_DMA_MASK          0x1u
#define  FTM1_C3SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C3SC_ELSA_MASK         0x4u
#define  FTM1_C3SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C3SC_ELSB_MASK         0x8u
#define  FTM1_C3SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C3SC_MSA_MASK          0x10u
#define  FTM1_C3SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C3SC_MSB_MASK          0x20u
#define  FTM1_C3SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C3SC_CHIE_MASK         0x40u
#define  FTM1_C3SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C3SC_CHF_MASK          0x80u
#define  FTM1_C3SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_C3V_VAL_MASK           0xFFFFu
#define  FTM1_C3V_VAL_SHIFT          0
#define  FTM1_C3V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C3V_VAL_SHIFT))&FTM1_C3V_VAL_MASK)
//   Channel Value

#define  FTM1_C4SC_DMA_MASK          0x1u
#define  FTM1_C4SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C4SC_ELSA_MASK         0x4u
#define  FTM1_C4SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C4SC_ELSB_MASK         0x8u
#define  FTM1_C4SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C4SC_MSA_MASK          0x10u
#define  FTM1_C4SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C4SC_MSB_MASK          0x20u
#define  FTM1_C4SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C4SC_CHIE_MASK         0x40u
#define  FTM1_C4SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C4SC_CHF_MASK          0x80u
#define  FTM1_C4SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_C4V_VAL_MASK           0xFFFFu
#define  FTM1_C4V_VAL_SHIFT          0
#define  FTM1_C4V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C4V_VAL_SHIFT))&FTM1_C4V_VAL_MASK)
//   Channel Value

#define  FTM1_C5SC_DMA_MASK          0x1u
#define  FTM1_C5SC_DMA_SHIFT         0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  FTM1_C5SC_ELSA_MASK         0x4u
#define  FTM1_C5SC_ELSA_SHIFT        2
//   Edge or Level Select

#define  FTM1_C5SC_ELSB_MASK         0x8u
#define  FTM1_C5SC_ELSB_SHIFT        3
//   Edge or Level Select

#define  FTM1_C5SC_MSA_MASK          0x10u
#define  FTM1_C5SC_MSA_SHIFT         4
//   Channel Mode Select

#define  FTM1_C5SC_MSB_MASK          0x20u
#define  FTM1_C5SC_MSB_SHIFT         5
//   Channel Mode Select

#define  FTM1_C5SC_CHIE_MASK         0x40u
#define  FTM1_C5SC_CHIE_SHIFT        6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  FTM1_C5SC_CHF_MASK          0x80u
#define  FTM1_C5SC_CHF_SHIFT         7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_C5V_VAL_MASK           0xFFFFu
#define  FTM1_C5V_VAL_SHIFT          0
#define  FTM1_C5V_VAL(x)             (((uint32_t)(((uint32_t)(x))<<FTM1_C5V_VAL_SHIFT))&FTM1_C5V_VAL_MASK)
//   Channel Value

#define  FTM1_STATUS_CH0F_MASK       0x1u
#define  FTM1_STATUS_CH0F_SHIFT      0
//   Channel 0 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_CH1F_MASK       0x2u
#define  FTM1_STATUS_CH1F_SHIFT      1
//   Channel 1 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_CH2F_MASK       0x4u
#define  FTM1_STATUS_CH2F_SHIFT      2
//   Channel 2 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_CH3F_MASK       0x8u
#define  FTM1_STATUS_CH3F_SHIFT      3
//   Channel 3 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_CH4F_MASK       0x10u
#define  FTM1_STATUS_CH4F_SHIFT      4
//   Channel 4 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_CH5F_MASK       0x20u
#define  FTM1_STATUS_CH5F_SHIFT      5
//   Channel 5 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  FTM1_STATUS_TOF_MASK        0x100u
#define  FTM1_STATUS_TOF_SHIFT       8
//   Timer Overflow Flag
//     0b0 ==> FTM counter has not overflowed.
//     0b1 ==> FTM counter has overflowed.

#define  FTM1_CONF_DOZEEN_MASK       0x20u
#define  FTM1_CONF_DOZEEN_SHIFT      5
//   Doze Enable
//     0b0 ==> Internal FTM counter continues in Doze mode.
//     0b1 ==> Internal FTM counter is paused and does not increment during Doze mode. Trigger inputs and input capture events are also ignored.

#define  FTM1_CONF_DBGMODE_MASK      0xC0u
#define  FTM1_CONF_DBGMODE_SHIFT     6
#define  FTM1_CONF_DBGMODE(x)        (((uint32_t)(((uint32_t)(x))<<FTM1_CONF_DBGMODE_SHIFT))&FTM1_CONF_DBGMODE_MASK)
//   Debug Mode
//     0b00 ==> FTM counter is paused and does not increment during debug mode. Trigger inputs and input capture events are also ignored.
//     0b11 ==> FTM counter continues in debug mode.

#define  FTM1_CONF_GTBEEN_MASK       0x200u
#define  FTM1_CONF_GTBEEN_SHIFT      9
//   Global time base enable
//     0b0 ==> All channels use the internally generated FTM counter as their timebase
//     0b1 ==> All channels use an externally generated global timebase as their timebase

#define  FTM1_CONF_CSOT_MASK         0x10000u
#define  FTM1_CONF_CSOT_SHIFT        16
//   Counter Start on Trigger
//     0b0 ==> FTM counter starts to increment immediately, once it is enabled.
//     0b1 ==> FTM counter only starts to increment when it a rising edge on the selected input trigger is detected, after it has been enabled or after it has stopped due to overflow.

#define  FTM1_CONF_CSOO_MASK         0x20000u
#define  FTM1_CONF_CSOO_SHIFT        17
//   Counter Stop On Overflow
//     0b0 ==> FTM counter continues incrementing or decrementing after overflow
//     0b1 ==> FTM counter stops incrementing or decrementing after overflow.

#define  FTM1_CONF_CROT_MASK         0x40000u
#define  FTM1_CONF_CROT_SHIFT        18
//   Counter Reload On Trigger
//     0b0 ==> Counter is not reloaded due to a rising edge on the selected input trigger
//     0b1 ==> Counter is reloaded when a rising edge is detected on the selected input trigger

