ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  GPIOA_PCOR_PTCO_MASK        0xFFFFFFFFu
#define  GPIOA_PCOR_PTCO_SHIFT       0
#define  GPIOA_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOA_PCOR_PTCO_SHIFT))&GPIOA_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOA_PTOR_PTTO_MASK        0xFFFFFFFFu
#define  GPIOA_PTOR_PTTO_SHIFT       0
#define  GPIOA_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOA_PTOR_PTTO_SHIFT))&GPIOA_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOA_PDIR_PDI_MASK         0xFFFFFFFFu
#define  GPIOA_PDIR_PDI_SHIFT        0
#define  GPIOA_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOA_PDIR_PDI_SHIFT))&GPIOA_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOA_PDDR_PDD_MASK         0xFFFFFFFFu
#define  GPIOA_PDDR_PDD_SHIFT        0
#define  GPIOA_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOA_PDDR_PDD_SHIFT))&GPIOA_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  GPIOB_PDOR_PDO_MASK         0xFFFFFFFFu
#define  GPIOB_PDOR_PDO_SHIFT        0
#define  GPIOB_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDOR_PDO_SHIFT))&GPIOB_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOB_PSOR_PTSO_MASK        0xFFFFFFFFu
#define  GPIOB_PSOR_PTSO_SHIFT       0
#define  GPIOB_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PSOR_PTSO_SHIFT))&GPIOB_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOB_PCOR_PTCO_MASK        0xFFFFFFFFu
#define  GPIOB_PCOR_PTCO_SHIFT       0
#define  GPIOB_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PCOR_PTCO_SHIFT))&GPIOB_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOB_PTOR_PTTO_MASK        0xFFFFFFFFu
#define  GPIOB_PTOR_PTTO_SHIFT       0
#define  GPIOB_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PTOR_PTTO_SHIFT))&GPIOB_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOB_PDIR_PDI_MASK         0xFFFFFFFFu
#define  GPIOB_PDIR_PDI_SHIFT        0
#define  GPIOB_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDIR_PDI_SHIFT))&GPIOB_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOB_PDDR_PDD_MASK         0xFFFFFFFFu
#define  GPIOB_PDDR_PDD_SHIFT        0
#define  GPIOB_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDDR_PDD_SHIFT))&GPIOB_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  GPIOC_PDOR_PDO_MASK         0xFFFFFFFFu
#define  GPIOC_PDOR_PDO_SHIFT        0
#define  GPIOC_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOC_PDOR_PDO_SHIFT))&GPIOC_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOC_PSOR_PTSO_MASK        0xFFFFFFFFu
#define  GPIOC_PSOR_PTSO_SHIFT       0
#define  GPIOC_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOC_PSOR_PTSO_SHIFT))&GPIOC_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOC_PCOR_PTCO_MASK        0xFFFFFFFFu
#define  GPIOC_PCOR_PTCO_SHIFT       0
#define  GPIOC_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOC_PCOR_PTCO_SHIFT))&GPIOC_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOC_PTOR_PTTO_MASK        0xFFFFFFFFu
#define  GPIOC_PTOR_PTTO_SHIFT       0
#define  GPIOC_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOC_PTOR_PTTO_SHIFT))&GPIOC_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOC_PDIR_PDI_MASK         0xFFFFFFFFu
#define  GPIOC_PDIR_PDI_SHIFT        0
#define  GPIOC_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOC_PDIR_PDI_SHIFT))&GPIOC_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOC_PDDR_PDD_MASK         0xFFFFFFFFu
#define  GPIOC_PDDR_PDD_SHIFT        0
#define  GPIOC_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOC_PDDR_PDD_SHIFT))&GPIOC_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  GPIOD_PDOR_PDO_MASK         0xFFFFFFFFu
#define  GPIOD_PDOR_PDO_SHIFT        0
#define  GPIOD_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOD_PDOR_PDO_SHIFT))&GPIOD_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOD_PSOR_PTSO_MASK        0xFFFFFFFFu
#define  GPIOD_PSOR_PTSO_SHIFT       0
#define  GPIOD_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOD_PSOR_PTSO_SHIFT))&GPIOD_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOD_PCOR_PTCO_MASK        0xFFFFFFFFu
#define  GPIOD_PCOR_PTCO_SHIFT       0
#define  GPIOD_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOD_PCOR_PTCO_SHIFT))&GPIOD_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

