ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  GPIOD_PTOR_PTTO_MASK        0xFFFFFFFFu
#define  GPIOD_PTOR_PTTO_SHIFT       0
#define  GPIOD_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOD_PTOR_PTTO_SHIFT))&GPIOD_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOD_PDIR_PDI_MASK         0xFFFFFFFFu
#define  GPIOD_PDIR_PDI_SHIFT        0
#define  GPIOD_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOD_PDIR_PDI_SHIFT))&GPIOD_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOD_PDDR_PDD_MASK         0xFFFFFFFFu
#define  GPIOD_PDDR_PDD_SHIFT        0
#define  GPIOD_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOD_PDDR_PDD_SHIFT))&GPIOD_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  GPIOE_PDOR_PDO_MASK         0xFFFFFFFFu
#define  GPIOE_PDOR_PDO_SHIFT        0
#define  GPIOE_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOE_PDOR_PDO_SHIFT))&GPIOE_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOE_PSOR_PTSO_MASK        0xFFFFFFFFu
#define  GPIOE_PSOR_PTSO_SHIFT       0
#define  GPIOE_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOE_PSOR_PTSO_SHIFT))&GPIOE_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOE_PCOR_PTCO_MASK        0xFFFFFFFFu
#define  GPIOE_PCOR_PTCO_SHIFT       0
#define  GPIOE_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOE_PCOR_PTCO_SHIFT))&GPIOE_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOE_PTOR_PTTO_MASK        0xFFFFFFFFu
#define  GPIOE_PTOR_PTTO_SHIFT       0
#define  GPIOE_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOE_PTOR_PTTO_SHIFT))&GPIOE_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOE_PDIR_PDI_MASK         0xFFFFFFFFu
#define  GPIOE_PDIR_PDI_SHIFT        0
#define  GPIOE_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOE_PDIR_PDI_SHIFT))&GPIOE_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOE_PDDR_PDD_MASK         0xFFFFFFFFu
#define  GPIOE_PDDR_PDD_SHIFT        0
#define  GPIOE_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOE_PDDR_PDD_SHIFT))&GPIOE_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  I2C0_A1_AD_MASK             0xFEu
#define  I2C0_A1_AD_SHIFT            1
#define  I2C0_A1_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_A1_AD_SHIFT))&I2C0_A1_AD_MASK)
//   Address

#define  I2C0_F_ICR_MASK             0x3Fu
#define  I2C0_F_ICR_SHIFT            0
#define  I2C0_F_ICR(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_F_ICR_SHIFT))&I2C0_F_ICR_MASK)
//   ClockRate

#define  I2C0_F_MULT_MASK            0xC0u
#define  I2C0_F_MULT_SHIFT           6
#define  I2C0_F_MULT(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_F_MULT_SHIFT))&I2C0_F_MULT_MASK)
//     0b00 ==> mul = 1
//     0b01 ==> mul = 2
//     0b10 ==> mul = 4
//     0b11 ==> Reserved

#define  I2C0_C1_DMAEN_MASK          0x1u
#define  I2C0_C1_DMAEN_SHIFT         0
//   DMA Enable
//     0b0 ==> All DMA signalling disabled.
//     0b1 ==> DMA transfer is enabled and the following conditions trigger the DMA request: While FACK = 0, a data byte is received, either address or data is transmitted. (ACK/NACK automatic) While FACK = 0, the first byte received matches the A1 register or is general call address. If any address matching occurs, IAAS and TCF are set. If the direction of transfer is known from master to slave, then it is not required to check the SRW. With this assumption, DMA can also be used in this
//             case. In other cases, if the master reads data from the slave, then it is required to rewrite the C1 register operation. With this assumption, DMA cannot be used. When FACK = 1, an address or a data byte is transmitted.

#define  I2C0_C1_WUEN_MASK           0x2u
#define  I2C0_C1_WUEN_SHIFT          1
//   Wakeup Enable
//     0b0 ==> Normal operation. No interrupt generated when address matching in low power mode.
//     0b1 ==> Enables the wakeup function in low power mode.

#define  I2C0_C1_RSTA_MASK           0x4u
#define  I2C0_C1_RSTA_SHIFT          2
//   Repeat START

#define  I2C0_C1_TXAK_MASK           0x8u
#define  I2C0_C1_TXAK_SHIFT          3
//   Transmit Acknowledge Enable
//     0b0 ==> An acknowledge signal is sent to the bus on the following receiving byte (if FACK is cleared) or the current receiving byte (if FACK is set).
//     0b1 ==> No acknowledge signal is sent to the bus on the following receiving data byte (if FACK is cleared) or the current receiving data byte (if FACK is set).

#define  I2C0_C1_TX_MASK             0x10u
#define  I2C0_C1_TX_SHIFT            4
//   Transmit Mode Select
//     0b0 ==> Receive
//     0b1 ==> Transmit

#define  I2C0_C1_MST_MASK            0x20u
#define  I2C0_C1_MST_SHIFT           5
//   Master Mode Select
//     0b0 ==> Slave mode
//     0b1 ==> Master mode

#define  I2C0_C1_IICIE_MASK          0x40u
#define  I2C0_C1_IICIE_SHIFT         6
//   I2C Interrupt Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

