ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  I2C1_SMB_SIICAEN_MASK       0x20u
#define  I2C1_SMB_SIICAEN_SHIFT      5
//   Second I2C Address Enable
//     0b0 ==> I2C address register 2 matching is disabled
//     0b1 ==> I2C address register 2 matching is enabled

#define  I2C1_SMB_ALERTEN_MASK       0x40u
#define  I2C1_SMB_ALERTEN_SHIFT      6
//   SMBus Alert Response Address Enable
//     0b0 ==> SMBus alert response address matching is disabled
//     0b1 ==> SMBus alert response address matching is enabled

#define  I2C1_SMB_FACK_MASK          0x80u
#define  I2C1_SMB_FACK_SHIFT         7
//   Fast NACK/ACK Enable
//     0b0 ==> An ACK or NACK is sent on the following receiving data byte
//     0b1 ==> Writing 0 to TXAK after receiving a data byte generates an ACK. Writing 1 to TXAK after receiving a data byte generates a NACK.

#define  I2C1_A2_SAD_MASK            0xFEu
#define  I2C1_A2_SAD_SHIFT           1
#define  I2C1_A2_SAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C1_A2_SAD_SHIFT))&I2C1_A2_SAD_MASK)
//   SMBus Address

#define  I2C1_SLTH_SSLT_MASK         0xFFu
#define  I2C1_SLTH_SSLT_SHIFT        0
#define  I2C1_SLTH_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C1_SLTH_SSLT_SHIFT))&I2C1_SLTH_SSLT_MASK)

#define  I2C1_SLTL_SSLT_MASK         0xFFu
#define  I2C1_SLTL_SSLT_SHIFT        0
#define  I2C1_SLTL_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C1_SLTL_SSLT_SHIFT))&I2C1_SLTL_SSLT_MASK)

#define  LLWU_PE1_WUPE0_MASK         0x3u
#define  LLWU_PE1_WUPE0_SHIFT        0
#define  LLWU_PE1_WUPE0(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE0_SHIFT))&LLWU_PE1_WUPE0_MASK)
//   Wakeup Pin Enable For LLWU_P0
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE1_MASK         0xCu
#define  LLWU_PE1_WUPE1_SHIFT        2
#define  LLWU_PE1_WUPE1(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE1_SHIFT))&LLWU_PE1_WUPE1_MASK)
//   Wakeup Pin Enable For LLWU_P1
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE2_MASK         0x30u
#define  LLWU_PE1_WUPE2_SHIFT        4
#define  LLWU_PE1_WUPE2(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE2_SHIFT))&LLWU_PE1_WUPE2_MASK)
//   Wakeup Pin Enable For LLWU_P2
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE3_MASK         0xC0u
#define  LLWU_PE1_WUPE3_SHIFT        6
#define  LLWU_PE1_WUPE3(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE3_SHIFT))&LLWU_PE1_WUPE3_MASK)
//   Wakeup Pin Enable For LLWU_P3
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE4_MASK         0x3u
#define  LLWU_PE2_WUPE4_SHIFT        0
#define  LLWU_PE2_WUPE4(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE4_SHIFT))&LLWU_PE2_WUPE4_MASK)
//   Wakeup Pin Enable For LLWU_P4
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE5_MASK         0xCu
#define  LLWU_PE2_WUPE5_SHIFT        2
#define  LLWU_PE2_WUPE5(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE5_SHIFT))&LLWU_PE2_WUPE5_MASK)
//   Wakeup Pin Enable For LLWU_P5
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE6_MASK         0x30u
#define  LLWU_PE2_WUPE6_SHIFT        4
#define  LLWU_PE2_WUPE6(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE6_SHIFT))&LLWU_PE2_WUPE6_MASK)
//   Wakeup Pin Enable For LLWU_P6
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE7_MASK         0xC0u
#define  LLWU_PE2_WUPE7_SHIFT        6
#define  LLWU_PE2_WUPE7(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE7_SHIFT))&LLWU_PE2_WUPE7_MASK)
//   Wakeup Pin Enable For LLWU_P7
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE8_MASK         0x3u
#define  LLWU_PE3_WUPE8_SHIFT        0
#define  LLWU_PE3_WUPE8(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE8_SHIFT))&LLWU_PE3_WUPE8_MASK)
//   Wakeup Pin Enable For LLWU_P8
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE9_MASK         0xCu
#define  LLWU_PE3_WUPE9_SHIFT        2
#define  LLWU_PE3_WUPE9(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE9_SHIFT))&LLWU_PE3_WUPE9_MASK)
//   Wakeup Pin Enable For LLWU_P9
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE10_MASK        0x30u
#define  LLWU_PE3_WUPE10_SHIFT       4
#define  LLWU_PE3_WUPE10(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE10_SHIFT))&LLWU_PE3_WUPE10_MASK)
//   Wakeup Pin Enable For LLWU_P10
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE11_MASK        0xC0u
#define  LLWU_PE3_WUPE11_SHIFT       6
#define  LLWU_PE3_WUPE11(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE11_SHIFT))&LLWU_PE3_WUPE11_MASK)
//   Wakeup Pin Enable For LLWU_P11
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE12_MASK        0x3u
#define  LLWU_PE4_WUPE12_SHIFT       0
#define  LLWU_PE4_WUPE12(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE12_SHIFT))&LLWU_PE4_WUPE12_MASK)
//   Wakeup Pin Enable For LLWU_P12
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE13_MASK        0xCu
#define  LLWU_PE4_WUPE13_SHIFT       2
#define  LLWU_PE4_WUPE13(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE13_SHIFT))&LLWU_PE4_WUPE13_MASK)
//   Wakeup Pin Enable For LLWU_P13
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE14_MASK        0x30u
#define  LLWU_PE4_WUPE14_SHIFT       4
#define  LLWU_PE4_WUPE14(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE14_SHIFT))&LLWU_PE4_WUPE14_MASK)
//   Wakeup Pin Enable For LLWU_P14
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE15_MASK        0xC0u
#define  LLWU_PE4_WUPE15_SHIFT       6
#define  LLWU_PE4_WUPE15(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE15_SHIFT))&LLWU_PE4_WUPE15_MASK)
//   Wakeup Pin Enable For LLWU_P15
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

