ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  LLWU_ME_WUME0_MASK          0x1u
#define  LLWU_ME_WUME0_SHIFT         0
//   Wakeup Module Enable For Module 0
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME1_MASK          0x2u
#define  LLWU_ME_WUME1_SHIFT         1
//   Wakeup Module Enable for Module 1
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME2_MASK          0x4u
#define  LLWU_ME_WUME2_SHIFT         2
//   Wakeup Module Enable For Module 2
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME3_MASK          0x8u
#define  LLWU_ME_WUME3_SHIFT         3
//   Wakeup Module Enable For Module 3
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME4_MASK          0x10u
#define  LLWU_ME_WUME4_SHIFT         4
//   Wakeup Module Enable For Module 4
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME5_MASK          0x20u
#define  LLWU_ME_WUME5_SHIFT         5
//   Wakeup Module Enable For Module 5
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME6_MASK          0x40u
#define  LLWU_ME_WUME6_SHIFT         6
//   Wakeup Module Enable For Module 6
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME7_MASK          0x80u
#define  LLWU_ME_WUME7_SHIFT         7
//   Wakeup Module Enable For Module 7
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_F1_WUF0_MASK           0x1u
#define  LLWU_F1_WUF0_SHIFT          0
//   Wakeup Flag For LLWU_P0
//     0b0 ==> LLWU_P0 input was not a wakeup source
//     0b1 ==> LLWU_P0 input was a wakeup source

#define  LLWU_F1_WUF1_MASK           0x2u
#define  LLWU_F1_WUF1_SHIFT          1
//   Wakeup Flag For LLWU_P1
//     0b0 ==> LLWU_P1 input was not a wakeup source
//     0b1 ==> LLWU_P1 input was a wakeup source

#define  LLWU_F1_WUF2_MASK           0x4u
#define  LLWU_F1_WUF2_SHIFT          2
//   Wakeup Flag For LLWU_P2
//     0b0 ==> LLWU_P2 input was not a wakeup source
//     0b1 ==> LLWU_P2 input was a wakeup source

#define  LLWU_F1_WUF3_MASK           0x8u
#define  LLWU_F1_WUF3_SHIFT          3
//   Wakeup Flag For LLWU_P3
//     0b0 ==> LLWU_P3 input was not a wakeup source
//     0b1 ==> LLWU_P3 input was a wakeup source

#define  LLWU_F1_WUF4_MASK           0x10u
#define  LLWU_F1_WUF4_SHIFT          4
//   Wakeup Flag For LLWU_P4
//     0b0 ==> LLWU_P4 input was not a wakeup source
//     0b1 ==> LLWU_P4 input was a wakeup source

#define  LLWU_F1_WUF5_MASK           0x20u
#define  LLWU_F1_WUF5_SHIFT          5
//   Wakeup Flag For LLWU_P5
//     0b0 ==> LLWU_P5 input was not a wakeup source
//     0b1 ==> LLWU_P5 input was a wakeup source

#define  LLWU_F1_WUF6_MASK           0x40u
#define  LLWU_F1_WUF6_SHIFT          6
//   Wakeup Flag For LLWU_P6
//     0b0 ==> LLWU_P6 input was not a wakeup source
//     0b1 ==> LLWU_P6 input was a wakeup source

#define  LLWU_F1_WUF7_MASK           0x80u
#define  LLWU_F1_WUF7_SHIFT          7
//   Wakeup Flag For LLWU_P7
//     0b0 ==> LLWU_P7 input was not a wakeup source
//     0b1 ==> LLWU_P7 input was a wakeup source

#define  LLWU_F2_WUF8_MASK           0x1u
#define  LLWU_F2_WUF8_SHIFT          0
//   Wakeup Flag For LLWU_P8
//     0b0 ==> LLWU_P8 input was not a wakeup source
//     0b1 ==> LLWU_P8 input was a wakeup source

#define  LLWU_F2_WUF9_MASK           0x2u
#define  LLWU_F2_WUF9_SHIFT          1
//   Wakeup Flag For LLWU_P9
//     0b0 ==> LLWU_P9 input was not a wakeup source
//     0b1 ==> LLWU_P9 input was a wakeup source

#define  LLWU_F2_WUF10_MASK          0x4u
#define  LLWU_F2_WUF10_SHIFT         2
//   Wakeup Flag For LLWU_P10
//     0b0 ==> LLWU_P10 input was not a wakeup source
//     0b1 ==> LLWU_P10 input was a wakeup source

#define  LLWU_F2_WUF11_MASK          0x8u
#define  LLWU_F2_WUF11_SHIFT         3
//   Wakeup Flag For LLWU_P11
//     0b0 ==> LLWU_P11 input was not a wakeup source
//     0b1 ==> LLWU_P11 input was a wakeup source

#define  LLWU_F2_WUF12_MASK          0x10u
#define  LLWU_F2_WUF12_SHIFT         4
//   Wakeup Flag For LLWU_P12
//     0b0 ==> LLWU_P12 input was not a wakeup source
//     0b1 ==> LLWU_P12 input was a wakeup source

#define  LLWU_F2_WUF13_MASK          0x20u
#define  LLWU_F2_WUF13_SHIFT         5
//   Wakeup Flag For LLWU_P13
//     0b0 ==> LLWU_P13 input was not a wakeup source
//     0b1 ==> LLWU_P13 input was a wakeup source

#define  LLWU_F2_WUF14_MASK          0x40u
#define  LLWU_F2_WUF14_SHIFT         6
//   Wakeup Flag For LLWU_P14
//     0b0 ==> LLWU_P14 input was not a wakeup source
//     0b1 ==> LLWU_P14 input was a wakeup source

#define  LLWU_F2_WUF15_MASK          0x80u
#define  LLWU_F2_WUF15_SHIFT         7
//   Wakeup Flag For LLWU_P15
//     0b0 ==> LLWU_P15 input was not a wakeup source
//     0b1 ==> LLWU_P15 input was a wakeup source

#define  LLWU_F3_MWUF0_MASK          0x1u
#define  LLWU_F3_MWUF0_SHIFT         0
//   Wakeup flag For module 0
//     0b0 ==> Module 0 input was not a wakeup source
//     0b1 ==> Module 0 input was a wakeup source

#define  LLWU_F3_MWUF1_MASK          0x2u
#define  LLWU_F3_MWUF1_SHIFT         1
//   Wakeup flag For module 1
//     0b0 ==> Module 1 input was not a wakeup source
//     0b1 ==> Module 1 input was a wakeup source

#define  LLWU_F3_MWUF2_MASK          0x4u
#define  LLWU_F3_MWUF2_SHIFT         2
//   Wakeup flag For module 2
//     0b0 ==> Module 2 input was not a wakeup source
//     0b1 ==> Module 2 input was a wakeup source

#define  LLWU_F3_MWUF3_MASK          0x8u
#define  LLWU_F3_MWUF3_SHIFT         3
//   Wakeup flag For module 3
//     0b0 ==> Module 3 input was not a wakeup source
//     0b1 ==> Module 3 input was a wakeup source

#define  LLWU_F3_MWUF4_MASK          0x10u
#define  LLWU_F3_MWUF4_SHIFT         4
//   Wakeup flag For module 4
//     0b0 ==> Module 4 input was not a wakeup source
//     0b1 ==> Module 4 input was a wakeup source

#define  LLWU_F3_MWUF5_MASK          0x20u
#define  LLWU_F3_MWUF5_SHIFT         5
//   Wakeup flag For module 5
//     0b0 ==> Module 5 input was not a wakeup source
//     0b1 ==> Module 5 input was a wakeup source

