ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  MCG_C6_LOLIE0_MASK          0x80u
#define  MCG_C6_LOLIE0_SHIFT         7
//   Loss of Lock Interrrupt Enable
//     0b0 ==> No interrupt request is generated on loss of lock.
//     0b1 ==> Generate an interrupt request on loss of lock.

#define  MCG_S_IRCST_MASK            0x1u
#define  MCG_S_IRCST_SHIFT           0
//   Internal Reference Clock Status
//     0b0 ==> Source of internal reference clock is the slow clock (32 kHz IRC).
//     0b1 ==> Source of internal reference clock is the fast clock (4 MHz IRC).

#define  MCG_S_OSCINIT0_MASK         0x2u
#define  MCG_S_OSCINIT0_SHIFT        1
//   OSC Initialization

#define  MCG_S_CLKST_MASK            0xCu
#define  MCG_S_CLKST_SHIFT           2
#define  MCG_S_CLKST(x)              (((uint8_t)(((uint8_t)(x))<<MCG_S_CLKST_SHIFT))&MCG_S_CLKST_MASK)
//   Clock Mode Status
//     0b00 ==> Encoding 0 - Output of the FLL is selected (reset default).
//     0b01 ==> Encoding 1 - Internal reference clock is selected.
//     0b10 ==> Encoding 2 - External reference clock is selected.
//     0b11 ==> Encoding 3 - Output of the PLL is selected.

#define  MCG_S_IREFST_MASK           0x10u
#define  MCG_S_IREFST_SHIFT          4
//   Internal Reference Status
//     0b0 ==> Source of FLL reference clock is the external reference clock.
//     0b1 ==> Source of FLL reference clock is the internal reference clock.

#define  MCG_S_PLLST_MASK            0x20u
#define  MCG_S_PLLST_SHIFT           5
//   PLL Select Status
//     0b0 ==> Source of PLLS clock is FLL clock.
//     0b1 ==> Source of PLLS clock is PLL clock.

#define  MCG_S_LOCK0_MASK            0x40u
#define  MCG_S_LOCK0_SHIFT           6
//   Lock Status
//     0b0 ==> PLL is currently unlocked.
//     0b1 ==> PLL is currently locked.

#define  MCG_S_LOLS0_MASK            0x80u
#define  MCG_S_LOLS0_SHIFT           7
//   Loss of Lock Status
//     0b0 ==> PLL has not lost lock since LOLS 0 was last cleared.
//     0b1 ==> PLL has lost lock since LOLS 0 was last cleared.

#define  MCG_SC_LOCS0_MASK           0x1u
#define  MCG_SC_LOCS0_SHIFT          0
//   OSC0 Loss of Clock Status
//     0b0 ==> Loss of OSC0 has not occurred.
//     0b1 ==> Loss of OSC0 has occurred.

#define  MCG_SC_FCRDIV_MASK          0xEu
#define  MCG_SC_FCRDIV_SHIFT         1
#define  MCG_SC_FCRDIV(x)            (((uint8_t)(((uint8_t)(x))<<MCG_SC_FCRDIV_SHIFT))&MCG_SC_FCRDIV_MASK)
//   Fast Clock Internal Reference Divider
//     0b000 ==> Divide Factor is 1
//     0b001 ==> Divide Factor is 2.
//     0b010 ==> Divide Factor is 4.
//     0b011 ==> Divide Factor is 8.
//     0b100 ==> Divide Factor is 16
//     0b101 ==> Divide Factor is 32
//     0b110 ==> Divide Factor is 64
//     0b111 ==> Divide Factor is 128.

#define  MCG_SC_FLTPRSRV_MASK        0x10u
#define  MCG_SC_FLTPRSRV_SHIFT       4
//   FLL Filter Preserve Enable
//     0b0 ==> FLL filter and FLL frequency will reset on changes to currect clock mode.
//     0b1 ==> Fll filter and FLL frequency retain their previous values during new clock mode change.

#define  MCG_SC_ATMF_MASK            0x20u
#define  MCG_SC_ATMF_SHIFT           5
//   Automatic Trim Machine Fail Flag
//     0b0 ==> Automatic Trim Machine completed normally.
//     0b1 ==> Automatic Trim Machine failed.

#define  MCG_SC_ATMS_MASK            0x40u
#define  MCG_SC_ATMS_SHIFT           6
//   Automatic Trim Machine Select
//     0b0 ==> 32 kHz Internal Reference Clock selected.
//     0b1 ==> 4 MHz Internal Reference Clock selected.

#define  MCG_SC_ATME_MASK            0x80u
#define  MCG_SC_ATME_SHIFT           7
//   Automatic Trim Machine Enable
//     0b0 ==> Auto Trim Machine disabled.
//     0b1 ==> Auto Trim Machine enabled.

#define  MCG_ATCVH_ATCVH_MASK        0xFFu
#define  MCG_ATCVH_ATCVH_SHIFT       0
#define  MCG_ATCVH_ATCVH(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVH_ATCVH_SHIFT))&MCG_ATCVH_ATCVH_MASK)
//   ATM Compare Value High

#define  MCG_ATCVL_ATCVL_MASK        0xFFu
#define  MCG_ATCVL_ATCVL_SHIFT       0
#define  MCG_ATCVL_ATCVL(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVL_ATCVL_SHIFT))&MCG_ATCVL_ATCVL_MASK)
//   ATM Compare Value Low

#define  MCG_C8_LOLRE_MASK           0x40u
#define  MCG_C8_LOLRE_SHIFT          6
//     0b0 ==> Interrupt request is generated on a PLL loss of lock indication. The PLL loss of lock interrupt enable bit must also be set to generate the interrupt request.
//     0b1 ==> Generate a reset request on a PLL loss of lock indication.

#define  MCM_PLASC_ASC_MASK          0xFFu
#define  MCM_PLASC_ASC_SHIFT         0
#define  MCM_PLASC_ASC(x)            (((uint16_t)(((uint16_t)(x))<<MCM_PLASC_ASC_SHIFT))&MCM_PLASC_ASC_MASK)
//   Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch's slave input port.
//     0b0 ==> A bus slave connection to AXBS input port n is absent
//     0b1 ==> A bus slave connection to AXBS input port n is present

#define  MCM_PLAMC_AMC_MASK          0xFFu
#define  MCM_PLAMC_AMC_SHIFT         0
#define  MCM_PLAMC_AMC(x)            (((uint16_t)(((uint16_t)(x))<<MCM_PLAMC_AMC_SHIFT))&MCM_PLAMC_AMC_MASK)
//   Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.
//     0b0 ==> A bus master connection to AXBS input port n is absent
//     0b1 ==> A bus master connection to AXBS input port n is present

#define  MCM_PLACR_ARB_MASK          0x200u
#define  MCM_PLACR_ARB_SHIFT         9
//   Arbitration select
//     0b0 ==> Fixed-priority arbitration for the crossbar masters
//     0b1 ==> Round-robin arbitration for the crossbar masters

#define  MCM_PLACR_CFCC_MASK         0x400u
#define  MCM_PLACR_CFCC_SHIFT        10
//   Clear Flash Controller Cache

#define  MCM_PLACR_DFCDA_MASK        0x800u
#define  MCM_PLACR_DFCDA_SHIFT       11
//   Disable Flash Controller Data Caching
//     0b0 ==> Enable flash controller data caching
//     0b1 ==> Disable flash controller data caching.

#define  MCM_PLACR_DFCIC_MASK        0x1000u
#define  MCM_PLACR_DFCIC_SHIFT       12
//   Disable Flash Controller Instruction Caching
//     0b0 ==> Enable flash controller instruction caching.
//     0b1 ==> Disable flash controller instruction caching.

#define  MCM_PLACR_DFCC_MASK         0x2000u
#define  MCM_PLACR_DFCC_SHIFT        13
//   Disable Flash Controller Cache
//     0b0 ==> Enable flash controller cache.
//     0b1 ==> Disable flash controller cache.

#define  MCM_PLACR_EFDS_MASK         0x4000u
#define  MCM_PLACR_EFDS_SHIFT        14
//   Enable Flash Data Speculation
//     0b0 ==> Disable flash data speculation.
//     0b1 ==> Enable flash data speculation.

#define  MCM_PLACR_DFCS_MASK         0x8000u
#define  MCM_PLACR_DFCS_SHIFT        15
//   Disable Flash Controller Speculation
//     0b0 ==> Enable flash controller speculation.
//     0b1 ==> Disable flash controller speculation.

