ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  MCM_PLACR_ESFC_MASK         0x10000u
#define  MCM_PLACR_ESFC_SHIFT        16
//   Enable Stalling Flash Controller
//     0b0 ==> Disable stalling flash controller when flash is busy.
//     0b1 ==> Enable stalling flash controller when flash is busy.

#define  MCM_CPO_CPOREQ_MASK         0x1u
#define  MCM_CPO_CPOREQ_SHIFT        0
//   Compute Operation request
//     0b0 ==> Request is cleared.
//     0b1 ==> Request Compute Operation.

#define  MCM_CPO_CPOACK_MASK         0x2u
#define  MCM_CPO_CPOACK_SHIFT        1
//   Compute Operation acknowledge

#define  MCM_CPO_CPOWOI_MASK         0x4u
#define  MCM_CPO_CPOWOI_SHIFT        2
//   Compute Operation wakeup on interrupt

#define  MTB_POSITION_WRAP_MASK      0x4u
#define  MTB_POSITION_WRAP_SHIFT     2

#define  MTB_POSITION_POINTER_MASK   0xFFFFFFF8u
#define  MTB_POSITION_POINTER_SHIFT  3
#define  MTB_POSITION_POINTER(x)     (((uint32_t)(((uint32_t)(x))<<MTB_POSITION_POINTER_SHIFT))&MTB_POSITION_POINTER_MASK)
//   Trace Packet Address Pointer

#define  MTB_MASTER_MASK_MASK        0x1Fu
#define  MTB_MASTER_MASK_SHIFT       0
#define  MTB_MASTER_MASK(x)          (((uint32_t)(((uint32_t)(x))<<MTB_MASTER_MASK_SHIFT))&MTB_MASTER_MASK_MASK)
//   Mask

#define  MTB_MASTER_TSTARTEN_MASK    0x20u
#define  MTB_MASTER_TSTARTEN_SHIFT   5
//   Trace start input enable

#define  MTB_MASTER_TSTOPEN_MASK     0x40u
#define  MTB_MASTER_TSTOPEN_SHIFT    6
//   Trace stop input enable

#define  MTB_MASTER_SFRWPRIV_MASK    0x80u
#define  MTB_MASTER_SFRWPRIV_SHIFT   7
//   Special Function Register Write Privilege bit

#define  MTB_MASTER_RAMPRIV_MASK     0x100u
#define  MTB_MASTER_RAMPRIV_SHIFT    8
//   RAM privilege bit

#define  MTB_MASTER_HALTREQ_MASK     0x200u
#define  MTB_MASTER_HALTREQ_SHIFT    9
//   Halt request bit

#define  MTB_MASTER_EN_MASK          0x80000000u
#define  MTB_MASTER_EN_SHIFT         31
//   Main trace enable bit

#define  MTB_FLOW_AUTOSTOP_MASK      0x1u
#define  MTB_FLOW_AUTOSTOP_SHIFT     0

#define  MTB_FLOW_AUTOHALT_MASK      0x2u
#define  MTB_FLOW_AUTOHALT_SHIFT     1

#define  MTB_FLOW_WATERMARK_MASK     0xFFFFFFF8u
#define  MTB_FLOW_WATERMARK_SHIFT    3
#define  MTB_FLOW_WATERMARK(x)       (((uint32_t)(((uint32_t)(x))<<MTB_FLOW_WATERMARK_SHIFT))&MTB_FLOW_WATERMARK_MASK)
//   WATERMARK value

#define  MTB_BASE_BASEADDR_MASK      0xFFFFFFFFu
#define  MTB_BASE_BASEADDR_SHIFT     0
#define  MTB_BASE_BASEADDR(x)        (((uint32_t)(((uint32_t)(x))<<MTB_BASE_BASEADDR_SHIFT))&MTB_BASE_BASEADDR_MASK)

#define  MTB_MODECTRL_MODECTRL_MASK  0xFFFFFFFFu
#define  MTB_MODECTRL_MODECTRL_SHIFT 0
#define  MTB_MODECTRL_MODECTRL(x)    (((uint32_t)(((uint32_t)(x))<<MTB_MODECTRL_MODECTRL_SHIFT))&MTB_MODECTRL_MODECTRL_MASK)

#define  MTB_TAGSET_TAGSET_MASK      0xFFFFFFFFu
#define  MTB_TAGSET_TAGSET_SHIFT     0
#define  MTB_TAGSET_TAGSET(x)        (((uint32_t)(((uint32_t)(x))<<MTB_TAGSET_TAGSET_SHIFT))&MTB_TAGSET_TAGSET_MASK)

#define  MTB_TAGCLEAR_TAGCLEAR_MASK  0xFFFFFFFFu
#define  MTB_TAGCLEAR_TAGCLEAR_SHIFT 0
#define  MTB_TAGCLEAR_TAGCLEAR(x)    (((uint32_t)(((uint32_t)(x))<<MTB_TAGCLEAR_TAGCLEAR_SHIFT))&MTB_TAGCLEAR_TAGCLEAR_MASK)

#define  MTB_LOCKACCESS_LOCKACCESS_MASK 0xFFFFFFFFu
#define  MTB_LOCKACCESS_LOCKACCESS_SHIFT 0
#define  MTB_LOCKACCESS_LOCKACCESS(x) (((uint32_t)(((uint32_t)(x))<<MTB_LOCKACCESS_LOCKACCESS_SHIFT))&MTB_LOCKACCESS_LOCKACCESS_MASK)

#define  MTB_LOCKSTAT_LOCKSTAT_MASK  0xFFFFFFFFu
#define  MTB_LOCKSTAT_LOCKSTAT_SHIFT 0
#define  MTB_LOCKSTAT_LOCKSTAT(x)    (((uint32_t)(((uint32_t)(x))<<MTB_LOCKSTAT_LOCKSTAT_SHIFT))&MTB_LOCKSTAT_LOCKSTAT_MASK)

#define  MTB_AUTHSTAT_BIT0_MASK      0x1u
#define  MTB_AUTHSTAT_BIT0_SHIFT     0

#define  MTB_AUTHSTAT_BIT1_MASK      0x2u
#define  MTB_AUTHSTAT_BIT1_SHIFT     1

#define  MTB_AUTHSTAT_BIT2_MASK      0x4u
#define  MTB_AUTHSTAT_BIT2_SHIFT     2

#define  MTB_AUTHSTAT_BIT3_MASK      0x8u
#define  MTB_AUTHSTAT_BIT3_SHIFT     3

#define  MTB_DEVICEARCH_DEVICEARCH_MASK 0xFFFFFFFFu
#define  MTB_DEVICEARCH_DEVICEARCH_SHIFT 0
#define  MTB_DEVICEARCH_DEVICEARCH(x) (((uint32_t)(((uint32_t)(x))<<MTB_DEVICEARCH_DEVICEARCH_SHIFT))&MTB_DEVICEARCH_DEVICEARCH_MASK)

#define  MTB_DEVICECFG_DEVICECFG_MASK 0xFFFFFFFFu
#define  MTB_DEVICECFG_DEVICECFG_SHIFT 0
#define  MTB_DEVICECFG_DEVICECFG(x)  (((uint32_t)(((uint32_t)(x))<<MTB_DEVICECFG_DEVICECFG_SHIFT))&MTB_DEVICECFG_DEVICECFG_MASK)

#define  MTB_DEVICETYPID_DEVICETYPID_MASK 0xFFFFFFFFu
#define  MTB_DEVICETYPID_DEVICETYPID_SHIFT 0
#define  MTB_DEVICETYPID_DEVICETYPID(x) (((uint32_t)(((uint32_t)(x))<<MTB_DEVICETYPID_DEVICETYPID_SHIFT))&MTB_DEVICETYPID_DEVICETYPID_MASK)

#define  MTB_PERIPHID4_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID4_PERIPHID_SHIFT 0
#define  MTB_PERIPHID4_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID4_PERIPHID_SHIFT))&MTB_PERIPHID4_PERIPHID_MASK)

#define  MTB_PERIPHID5_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID5_PERIPHID_SHIFT 0
#define  MTB_PERIPHID5_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID5_PERIPHID_SHIFT))&MTB_PERIPHID5_PERIPHID_MASK)

#define  MTB_PERIPHID6_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID6_PERIPHID_SHIFT 0
#define  MTB_PERIPHID6_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID6_PERIPHID_SHIFT))&MTB_PERIPHID6_PERIPHID_MASK)

#define  MTB_PERIPHID7_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID7_PERIPHID_SHIFT 0
#define  MTB_PERIPHID7_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID7_PERIPHID_SHIFT))&MTB_PERIPHID7_PERIPHID_MASK)

#define  MTB_PERIPHID0_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID0_PERIPHID_SHIFT 0
#define  MTB_PERIPHID0_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID0_PERIPHID_SHIFT))&MTB_PERIPHID0_PERIPHID_MASK)

#define  MTB_PERIPHID1_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID1_PERIPHID_SHIFT 0
#define  MTB_PERIPHID1_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID1_PERIPHID_SHIFT))&MTB_PERIPHID1_PERIPHID_MASK)

#define  MTB_PERIPHID2_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID2_PERIPHID_SHIFT 0
#define  MTB_PERIPHID2_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID2_PERIPHID_SHIFT))&MTB_PERIPHID2_PERIPHID_MASK)

#define  MTB_PERIPHID3_PERIPHID_MASK 0xFFFFFFFFu
#define  MTB_PERIPHID3_PERIPHID_SHIFT 0
#define  MTB_PERIPHID3_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID3_PERIPHID_SHIFT))&MTB_PERIPHID3_PERIPHID_MASK)

