ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  MTBDWT_COMPID0_COMPID_MASK  0xFFFFFFFFu
#define  MTBDWT_COMPID0_COMPID_SHIFT 0
#define  MTBDWT_COMPID0_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID0_COMPID_SHIFT))&MTBDWT_COMPID0_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID1_COMPID_MASK  0xFFFFFFFFu
#define  MTBDWT_COMPID1_COMPID_SHIFT 0
#define  MTBDWT_COMPID1_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID1_COMPID_SHIFT))&MTBDWT_COMPID1_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID2_COMPID_MASK  0xFFFFFFFFu
#define  MTBDWT_COMPID2_COMPID_SHIFT 0
#define  MTBDWT_COMPID2_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID2_COMPID_SHIFT))&MTBDWT_COMPID2_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID3_COMPID_MASK  0xFFFFFFFFu
#define  MTBDWT_COMPID3_COMPID_SHIFT 0
#define  MTBDWT_COMPID3_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID3_COMPID_SHIFT))&MTBDWT_COMPID3_COMPID_MASK)
//   Component ID

#define  OSC0_CR_SC16P_MASK          0x1u
#define  OSC0_CR_SC16P_SHIFT         0
//   Oscillator 16 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 16 pF capacitor to the oscillator load.

#define  OSC0_CR_SC8P_MASK           0x2u
#define  OSC0_CR_SC8P_SHIFT          1
//   Oscillator 8 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 8 pF capacitor to the oscillator load.

#define  OSC0_CR_SC4P_MASK           0x4u
#define  OSC0_CR_SC4P_SHIFT          2
//   Oscillator 4 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 4 pF capacitor to the oscillator load.

#define  OSC0_CR_SC2P_MASK           0x8u
#define  OSC0_CR_SC2P_SHIFT          3
//   Oscillator 2 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 2 pF capacitor to the oscillator load.

#define  OSC0_CR_EREFSTEN_MASK       0x20u
#define  OSC0_CR_EREFSTEN_SHIFT      5
//   External Reference Stop Enable
//     0b0 ==> External reference clock is disabled in Stop mode.
//     0b1 ==> External reference clock stays enabled in Stop mode if ERCLKEN is set before entering Stop mode.

#define  OSC0_CR_ERCLKEN_MASK        0x80u
#define  OSC0_CR_ERCLKEN_SHIFT       7
//   External Reference Enable
//     0b0 ==> External reference clock is inactive.
//     0b1 ==> External reference clock is enabled.

#define  PIT_MCR_FRZ_MASK            0x1u
#define  PIT_MCR_FRZ_SHIFT           0
//   Freeze
//     0b0 ==> Timers continue to run in Debug mode.
//     0b1 ==> Timers are stopped in Debug mode.

#define  PIT_MCR_MDIS_MASK           0x2u
#define  PIT_MCR_MDIS_SHIFT          1
//   Module Disable
//     0b0 ==> Clock for PIT timers is enabled.
//     0b1 ==> Clock for PIT timers is disabled.

#define  PIT_LTMR64H_LTH_MASK        0xFFFFFFFFu
#define  PIT_LTMR64H_LTH_SHIFT       0
#define  PIT_LTMR64H_LTH(x)          (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64H_LTH_SHIFT))&PIT_LTMR64H_LTH_MASK)
//   Life Timer value

#define  PIT_LTMR64L_LTL_MASK        0xFFFFFFFFu
#define  PIT_LTMR64L_LTL_SHIFT       0
#define  PIT_LTMR64L_LTL(x)          (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64L_LTL_SHIFT))&PIT_LTMR64L_LTL_MASK)
//   Life Timer value

#define  PIT_LDVAL0_TSV_MASK         0xFFFFFFFFu
#define  PIT_LDVAL0_TSV_SHIFT        0
#define  PIT_LDVAL0_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL0_TSV_SHIFT))&PIT_LDVAL0_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL0_TVL_MASK          0xFFFFFFFFu
#define  PIT_CVAL0_TVL_SHIFT         0
#define  PIT_CVAL0_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL0_TVL_SHIFT))&PIT_CVAL0_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL0_TEN_MASK         0x1u
#define  PIT_TCTRL0_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL0_TIE_MASK         0x2u
#define  PIT_TCTRL0_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL0_CHN_MASK         0x4u
#define  PIT_TCTRL0_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG0_TIF_MASK          0x1u
#define  PIT_TFLG0_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT_LDVAL1_TSV_MASK         0xFFFFFFFFu
#define  PIT_LDVAL1_TSV_SHIFT        0
#define  PIT_LDVAL1_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL1_TSV_SHIFT))&PIT_LDVAL1_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL1_TVL_MASK          0xFFFFFFFFu
#define  PIT_CVAL1_TVL_SHIFT         0
#define  PIT_CVAL1_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL1_TVL_SHIFT))&PIT_CVAL1_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL1_TEN_MASK         0x1u
#define  PIT_TCTRL1_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL1_TIE_MASK         0x2u
#define  PIT_TCTRL1_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL1_CHN_MASK         0x4u
#define  PIT_TCTRL1_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG1_TIF_MASK          0x1u
#define  PIT_TFLG1_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT_LDVAL2_TSV_MASK         0xFFFFFFFFu
#define  PIT_LDVAL2_TSV_SHIFT        0
#define  PIT_LDVAL2_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL2_TSV_SHIFT))&PIT_LDVAL2_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL2_TVL_MASK          0xFFFFFFFFu
#define  PIT_CVAL2_TVL_SHIFT         0
#define  PIT_CVAL2_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL2_TVL_SHIFT))&PIT_CVAL2_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL2_TEN_MASK         0x1u
#define  PIT_TCTRL2_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL2_TIE_MASK         0x2u
#define  PIT_TCTRL2_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL2_CHN_MASK         0x4u
#define  PIT_TCTRL2_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG2_TIF_MASK          0x1u
#define  PIT_TFLG2_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

