ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  PORTA_PCR22_SRE_MASK        0x4u
#define  PORTA_PCR22_SRE_SHIFT       2
//   Slew Rate Enable
//     0b0 ==> Fast slew rate is configured on the corresponding pin, if the pin is configured as a digital output.
//     0b1 ==> Slow slew rate is configured on the corresponding pin, if the pin is configured as a digital output.

#define  PORTA_PCR22_PFE_MASK        0x10u
#define  PORTA_PCR22_PFE_SHIFT       4
//   Passive Filter Enable
//     0b0 ==> Passive input filter is disabled on the corresponding pin.
//     0b1 ==> Passive input filter is enabled on the corresponding pin, if the pin is configured as a digital input. A low pass filter of 10 MHz to 30 MHz bandwidth is enabled on the digital input path. Disable the passive input filter when high speed interfaces of more than 2 MHz are supported on the pin.

#define  PORTA_PCR22_DSE_MASK        0x40u
#define  PORTA_PCR22_DSE_SHIFT       6
//   Drive Strength Enable
//     0b0 ==> Low drive strength is configured on the corresponding pin, if pin is configured as a digital output.
//     0b1 ==> High drive strength is configured on the corresponding pin, if pin is configured as a digital output.

#define  PORTA_PCR22_MUX_MASK        0x700u
#define  PORTA_PCR22_MUX_SHIFT       8
#define  PORTA_PCR22_MUX(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR22_MUX_SHIFT))&PORTA_PCR22_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR22_IRQC_MASK       0xF0000u
#define  PORTA_PCR22_IRQC_SHIFT      16
#define  PORTA_PCR22_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTA_PCR22_IRQC_SHIFT))&PORTA_PCR22_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR22_ISF_MASK        0x1000000u
#define  PORTA_PCR22_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR23_PS_MASK         0x1u
#define  PORTA_PCR23_PS_SHIFT        0
//   Pull Select
//     0b0 ==> Internal pulldown resistor is enabled on the corresponding pin, if the corresponding Port Pull Enable field is set.
//     0b1 ==> Internal pullup resistor is enabled on the corresponding pin, if the corresponding Port Pull Enable field is set.

#define  PORTA_PCR23_PE_MASK         0x2u
#define  PORTA_PCR23_PE_SHIFT        1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

#define  PORTA_PCR23_SRE_MASK        0x4u
#define  PORTA_PCR23_SRE_SHIFT       2
//   Slew Rate Enable
//     0b0 ==> Fast slew rate is configured on the corresponding pin, if the pin is configured as a digital output.
//     0b1 ==> Slow slew rate is configured on the corresponding pin, if the pin is configured as a digital output.

#define  PORTA_PCR23_PFE_MASK        0x10u
#define  PORTA_PCR23_PFE_SHIFT       4
//   Passive Filter Enable
//     0b0 ==> Passive input filter is disabled on the corresponding pin.
//     0b1 ==> Passive input filter is enabled on the corresponding pin, if the pin is configured as a digital input. A low pass filter of 10 MHz to 30 MHz bandwidth is enabled on the digital input path. Disable the passive input filter when high speed interfaces of more than 2 MHz are supported on the pin.

#define  PORTA_PCR23_DSE_MASK        0x40u
#define  PORTA_PCR23_DSE_SHIFT       6
//   Drive Strength Enable
//     0b0 ==> Low drive strength is configured on the corresponding pin, if pin is configured as a digital output.
//     0b1 ==> High drive strength is configured on the corresponding pin, if pin is configured as a digital output.

#define  PORTA_PCR23_MUX_MASK        0x700u
#define  PORTA_PCR23_MUX_SHIFT       8
#define  PORTA_PCR23_MUX(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR23_MUX_SHIFT))&PORTA_PCR23_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR23_IRQC_MASK       0xF0000u
#define  PORTA_PCR23_IRQC_SHIFT      16
#define  PORTA_PCR23_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTA_PCR23_IRQC_SHIFT))&PORTA_PCR23_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR23_ISF_MASK        0x1000000u
#define  PORTA_PCR23_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR24_PS_MASK         0x1u
#define  PORTA_PCR24_PS_SHIFT        0
//   Pull Select
//     0b0 ==> Internal pulldown resistor is enabled on the corresponding pin, if the corresponding Port Pull Enable field is set.
//     0b1 ==> Internal pullup resistor is enabled on the corresponding pin, if the corresponding Port Pull Enable field is set.

#define  PORTA_PCR24_PE_MASK         0x2u
#define  PORTA_PCR24_PE_SHIFT        1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

