ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  RCM_SRS0_LOL_MASK           0x8u
#define  RCM_SRS0_LOL_SHIFT          3
//   Loss-of-Lock Reset
//     0b0 ==> Reset not caused by a loss of lock in the PLL
//     0b1 ==> Reset caused by a loss of lock in the PLL

#define  RCM_SRS0_WDOG_MASK          0x20u
#define  RCM_SRS0_WDOG_SHIFT         5
//   Watchdog
//     0b0 ==> Reset not caused by watchdog timeout
//     0b1 ==> Reset caused by watchdog timeout

#define  RCM_SRS0_PIN_MASK           0x40u
#define  RCM_SRS0_PIN_SHIFT          6
//   External Reset Pin
//     0b0 ==> Reset not caused by external reset pin
//     0b1 ==> Reset caused by external reset pin

#define  RCM_SRS0_POR_MASK           0x80u
#define  RCM_SRS0_POR_SHIFT          7
//   Power-On Reset
//     0b0 ==> Reset not caused by POR
//     0b1 ==> Reset caused by POR

#define  RCM_SRS1_LOCKUP_MASK        0x2u
#define  RCM_SRS1_LOCKUP_SHIFT       1
//   Core Lockup
//     0b0 ==> Reset not caused by core LOCKUP event
//     0b1 ==> Reset caused by core LOCKUP event

#define  RCM_SRS1_SW_MASK            0x4u
#define  RCM_SRS1_SW_SHIFT           2
//   Software
//     0b0 ==> Reset not caused by software setting of SYSRESETREQ bit
//     0b1 ==> Reset caused by software setting of SYSRESETREQ bit

#define  RCM_SRS1_MDM_AP_MASK        0x8u
#define  RCM_SRS1_MDM_AP_SHIFT       3
//   MDM-AP System Reset Request
//     0b0 ==> Reset not caused by host debugger system setting of the System Reset Request bit
//     0b1 ==> Reset caused by host debugger system setting of the System Reset Request bit

#define  RCM_SRS1_SACKERR_MASK       0x20u
#define  RCM_SRS1_SACKERR_SHIFT      5
//   Stop Mode Acknowledge Error Reset
//     0b0 ==> Reset not caused by peripheral failure to acknowledge attempt to enter stop mode
//     0b1 ==> Reset caused by peripheral failure to acknowledge attempt to enter stop mode

#define  RCM_RPFC_RSTFLTSRW_MASK     0x3u
#define  RCM_RPFC_RSTFLTSRW_SHIFT    0
#define  RCM_RPFC_RSTFLTSRW(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK)
//   Reset Pin Filter Select in Run and Wait Modes
//     0b00 ==> All filtering disabled
//     0b01 ==> Bus clock filter enabled for normal operation
//     0b10 ==> LPO clock filter enabled for normal operation
//     0b11 ==> Reserved

#define  RCM_RPFC_RSTFLTSS_MASK      0x4u
#define  RCM_RPFC_RSTFLTSS_SHIFT     2
//   Reset Pin Filter Select in Stop Mode
//     0b0 ==> All filtering disabled
//     0b1 ==> LPO clock filter enabled

#define  RCM_RPFW_RSTFLTSEL_MASK     0x1Fu
#define  RCM_RPFW_RSTFLTSEL_SHIFT    0
#define  RCM_RPFW_RSTFLTSEL(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK)
//   Reset Pin Filter Bus Clock Select
//     0b00000 ==> Bus clock filter count is 1
//     0b00001 ==> Bus clock filter count is 2
//     0b00010 ==> Bus clock filter count is 3
//     0b00011 ==> Bus clock filter count is 4
//     0b00100 ==> Bus clock filter count is 5
//     0b00101 ==> Bus clock filter count is 6
//     0b00110 ==> Bus clock filter count is 7
//     0b00111 ==> Bus clock filter count is 8
//     0b01000 ==> Bus clock filter count is 9
//     0b01001 ==> Bus clock filter count is 10
//     0b01010 ==> Bus clock filter count is 11
//     0b01011 ==> Bus clock filter count is 12
//     0b01100 ==> Bus clock filter count is 13
//     0b01101 ==> Bus clock filter count is 14
//     0b01110 ==> Bus clock filter count is 15
//     0b01111 ==> Bus clock filter count is 16
//     0b10000 ==> Bus clock filter count is 17
//     0b10001 ==> Bus clock filter count is 18
//     0b10010 ==> Bus clock filter count is 19
//     0b10011 ==> Bus clock filter count is 20
//     0b10100 ==> Bus clock filter count is 21
//     0b10101 ==> Bus clock filter count is 22
//     0b10110 ==> Bus clock filter count is 23
//     0b10111 ==> Bus clock filter count is 24
//     0b11000 ==> Bus clock filter count is 25
//     0b11001 ==> Bus clock filter count is 26
//     0b11010 ==> Bus clock filter count is 27
//     0b11011 ==> Bus clock filter count is 28
//     0b11100 ==> Bus clock filter count is 29
//     0b11101 ==> Bus clock filter count is 30
//     0b11110 ==> Bus clock filter count is 31
//     0b11111 ==> Bus clock filter count is 32

#define  ROM_ENTRY0_ENTRY_MASK       0xFFFFFFFFu
#define  ROM_ENTRY0_ENTRY_SHIFT      0
#define  ROM_ENTRY0_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY0_ENTRY_SHIFT))&ROM_ENTRY0_ENTRY_MASK)
//   ENTRY

#define  ROM_ENTRY1_ENTRY_MASK       0xFFFFFFFFu
#define  ROM_ENTRY1_ENTRY_SHIFT      0
#define  ROM_ENTRY1_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY1_ENTRY_SHIFT))&ROM_ENTRY1_ENTRY_MASK)
//   ENTRY

#define  ROM_ENTRY2_ENTRY_MASK       0xFFFFFFFFu
#define  ROM_ENTRY2_ENTRY_SHIFT      0
#define  ROM_ENTRY2_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY2_ENTRY_SHIFT))&ROM_ENTRY2_ENTRY_MASK)
//   ENTRY

#define  ROM_TABLEMARK_MARK_MASK     0xFFFFFFFFu
#define  ROM_TABLEMARK_MARK_SHIFT    0
#define  ROM_TABLEMARK_MARK(x)       (((uint32_t)(((uint32_t)(x))<<ROM_TABLEMARK_MARK_SHIFT))&ROM_TABLEMARK_MARK_MASK)

#define  ROM_SYSACCESS_SYSACCESS_MASK 0xFFFFFFFFu
#define  ROM_SYSACCESS_SYSACCESS_SHIFT 0
#define  ROM_SYSACCESS_SYSACCESS(x)  (((uint32_t)(((uint32_t)(x))<<ROM_SYSACCESS_SYSACCESS_SHIFT))&ROM_SYSACCESS_SYSACCESS_MASK)

#define  ROM_PERIPHID4_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID4_PERIPHID_SHIFT 0
#define  ROM_PERIPHID4_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID4_PERIPHID_SHIFT))&ROM_PERIPHID4_PERIPHID_MASK)

#define  ROM_PERIPHID5_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID5_PERIPHID_SHIFT 0
#define  ROM_PERIPHID5_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID5_PERIPHID_SHIFT))&ROM_PERIPHID5_PERIPHID_MASK)

#define  ROM_PERIPHID6_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID6_PERIPHID_SHIFT 0
#define  ROM_PERIPHID6_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID6_PERIPHID_SHIFT))&ROM_PERIPHID6_PERIPHID_MASK)

#define  ROM_PERIPHID7_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID7_PERIPHID_SHIFT 0
#define  ROM_PERIPHID7_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID7_PERIPHID_SHIFT))&ROM_PERIPHID7_PERIPHID_MASK)

#define  ROM_PERIPHID0_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID0_PERIPHID_SHIFT 0
#define  ROM_PERIPHID0_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID0_PERIPHID_SHIFT))&ROM_PERIPHID0_PERIPHID_MASK)

#define  ROM_PERIPHID1_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID1_PERIPHID_SHIFT 0
#define  ROM_PERIPHID1_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID1_PERIPHID_SHIFT))&ROM_PERIPHID1_PERIPHID_MASK)

#define  ROM_PERIPHID2_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID2_PERIPHID_SHIFT 0
#define  ROM_PERIPHID2_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID2_PERIPHID_SHIFT))&ROM_PERIPHID2_PERIPHID_MASK)

