ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  ROM_PERIPHID3_PERIPHID_MASK 0xFFFFFFFFu
#define  ROM_PERIPHID3_PERIPHID_SHIFT 0
#define  ROM_PERIPHID3_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID3_PERIPHID_SHIFT))&ROM_PERIPHID3_PERIPHID_MASK)

#define  ROM_COMPID0_COMPID_MASK     0xFFFFFFFFu
#define  ROM_COMPID0_COMPID_SHIFT    0
#define  ROM_COMPID0_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID0_COMPID_SHIFT))&ROM_COMPID0_COMPID_MASK)
//   Component ID

#define  ROM_COMPID1_COMPID_MASK     0xFFFFFFFFu
#define  ROM_COMPID1_COMPID_SHIFT    0
#define  ROM_COMPID1_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID1_COMPID_SHIFT))&ROM_COMPID1_COMPID_MASK)
//   Component ID

#define  ROM_COMPID2_COMPID_MASK     0xFFFFFFFFu
#define  ROM_COMPID2_COMPID_SHIFT    0
#define  ROM_COMPID2_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID2_COMPID_SHIFT))&ROM_COMPID2_COMPID_MASK)
//   Component ID

#define  ROM_COMPID3_COMPID_MASK     0xFFFFFFFFu
#define  ROM_COMPID3_COMPID_SHIFT    0
#define  ROM_COMPID3_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID3_COMPID_SHIFT))&ROM_COMPID3_COMPID_MASK)
//   Component ID

#define  RTC_TSR_TSR_MASK            0xFFFFFFFFu
#define  RTC_TSR_TSR_SHIFT           0
#define  RTC_TSR_TSR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TSR_TSR_SHIFT))&RTC_TSR_TSR_MASK)
//   Time Seconds Register

#define  RTC_TPR_TPR_MASK            0xFFFFu
#define  RTC_TPR_TPR_SHIFT           0
#define  RTC_TPR_TPR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TPR_TPR_SHIFT))&RTC_TPR_TPR_MASK)
//   Time Prescaler Register

#define  RTC_TAR_TAR_MASK            0xFFFFFFFFu
#define  RTC_TAR_TAR_SHIFT           0
#define  RTC_TAR_TAR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TAR_TAR_SHIFT))&RTC_TAR_TAR_MASK)
//   Time Alarm Register

#define  RTC_TCR_TCR_MASK            0xFFu
#define  RTC_TCR_TCR_SHIFT           0
#define  RTC_TCR_TCR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCR_SHIFT))&RTC_TCR_TCR_MASK)
//   Time Compensation Register
//     0b10000000 ==> Time Prescaler Register overflows every 32896 clock cycles.
//     0b11111111 ==> Time Prescaler Register overflows every 32769 clock cycles.
//     0b0 ==> Time Prescaler Register overflows every 32768 clock cycles.
//     0b1 ==> Time Prescaler Register overflows every 32767 clock cycles.
//     0b1111111 ==> Time Prescaler Register overflows every 32641 clock cycles.

#define  RTC_TCR_CIR_MASK            0xFF00u
#define  RTC_TCR_CIR_SHIFT           8
#define  RTC_TCR_CIR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIR_SHIFT))&RTC_TCR_CIR_MASK)
//   Compensation Interval Register

#define  RTC_TCR_TCV_MASK            0xFF0000u
#define  RTC_TCR_TCV_SHIFT           16
#define  RTC_TCR_TCV(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCV_SHIFT))&RTC_TCR_TCV_MASK)
//   Time Compensation Value

#define  RTC_TCR_CIC_MASK            0xFF000000u
#define  RTC_TCR_CIC_SHIFT           24
#define  RTC_TCR_CIC(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIC_SHIFT))&RTC_TCR_CIC_MASK)
//   Compensation Interval Counter

#define  RTC_CR_SWR_MASK             0x1u
#define  RTC_CR_SWR_SHIFT            0
//   Software Reset
//     0b0 ==> No effect.
//     0b1 ==> Resets all RTC registers except for the SWR bit . The SWR bit is cleared by POR and by software explicitly clearing it.

#define  RTC_CR_WPE_MASK             0x2u
#define  RTC_CR_WPE_SHIFT            1
//   Wakeup Pin Enable
//     0b0 ==> Wakeup pin is disabled.
//     0b1 ==> Wakeup pin is enabled and wakeup pin asserts if the RTC interrupt asserts or the wakeup pin is turned on.

#define  RTC_CR_SUP_MASK             0x4u
#define  RTC_CR_SUP_SHIFT            2
//   Supervisor Access
//     0b0 ==> Non-supervisor mode write accesses are not supported and generate a bus error.
//     0b1 ==> Non-supervisor mode write accesses are supported.

#define  RTC_CR_UM_MASK              0x8u
#define  RTC_CR_UM_SHIFT             3
//   Update Mode
//     0b0 ==> Registers cannot be written when locked.
//     0b1 ==> Registers can be written when locked under limited conditions.

#define  RTC_CR_OSCE_MASK            0x100u
#define  RTC_CR_OSCE_SHIFT           8
//   Oscillator Enable
//     0b0 ==> 32.768 kHz oscillator is disabled.
//     0b1 ==> 32.768 kHz oscillator is enabled. After setting this bit, wait the oscillator startup time before enabling the time counter to allow the 32.768 kHz clock time to stabilize.

#define  RTC_CR_CLKO_MASK            0x200u
#define  RTC_CR_CLKO_SHIFT           9
//   Clock Output
//     0b0 ==> The 32 kHz clock is output to other peripherals.
//     0b1 ==> The 32 kHz clock is not output to other peripherals.

#define  RTC_CR_SC16P_MASK           0x400u
#define  RTC_CR_SC16P_SHIFT          10
//   Oscillator 16pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC8P_MASK            0x800u
#define  RTC_CR_SC8P_SHIFT           11
//   Oscillator 8pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC4P_MASK            0x1000u
#define  RTC_CR_SC4P_SHIFT           12
//   Oscillator 4pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC2P_MASK            0x2000u
#define  RTC_CR_SC2P_SHIFT           13
//   Oscillator 2pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_SR_TIF_MASK             0x1u
#define  RTC_SR_TIF_SHIFT            0
//   Time Invalid Flag
//     0b0 ==> Time is valid.
//     0b1 ==> Time is invalid and time counter is read as zero.

#define  RTC_SR_TOF_MASK             0x2u
#define  RTC_SR_TOF_SHIFT            1
//   Time Overflow Flag
//     0b0 ==> Time overflow has not occurred.
//     0b1 ==> Time overflow has occurred and time counter is read as zero.

#define  RTC_SR_TAF_MASK             0x4u
#define  RTC_SR_TAF_SHIFT            2
//   Time Alarm Flag
//     0b0 ==> Time alarm has not occurred.
//     0b1 ==> Time alarm has occurred.

