ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  RTC_SR_TCE_MASK             0x10u
#define  RTC_SR_TCE_SHIFT            4
//   Time Counter Enable
//     0b0 ==> Time counter is disabled.
//     0b1 ==> Time counter is enabled.

#define  RTC_LR_TCL_MASK             0x8u
#define  RTC_LR_TCL_SHIFT            3
//   Time Compensation Lock
//     0b0 ==> Time Compensation Register is locked and writes are ignored.
//     0b1 ==> Time Compensation Register is not locked and writes complete as normal.

#define  RTC_LR_CRL_MASK             0x10u
#define  RTC_LR_CRL_SHIFT            4
//   Control Register Lock
//     0b0 ==> Control Register is locked and writes are ignored.
//     0b1 ==> Control Register is not locked and writes complete as normal.

#define  RTC_LR_SRL_MASK             0x20u
#define  RTC_LR_SRL_SHIFT            5
//   Status Register Lock
//     0b0 ==> Status Register is locked and writes are ignored.
//     0b1 ==> Status Register is not locked and writes complete as normal.

#define  RTC_LR_LRL_MASK             0x40u
#define  RTC_LR_LRL_SHIFT            6
//   Lock Register Lock
//     0b0 ==> Lock Register is locked and writes are ignored.
//     0b1 ==> Lock Register is not locked and writes complete as normal.

#define  RTC_IER_TIIE_MASK           0x1u
#define  RTC_IER_TIIE_SHIFT          0
//   Time Invalid Interrupt Enable
//     0b0 ==> Time invalid flag does not generate an interrupt.
//     0b1 ==> Time invalid flag does generate an interrupt.

#define  RTC_IER_TOIE_MASK           0x2u
#define  RTC_IER_TOIE_SHIFT          1
//   Time Overflow Interrupt Enable
//     0b0 ==> Time overflow flag does not generate an interrupt.
//     0b1 ==> Time overflow flag does generate an interrupt.

#define  RTC_IER_TAIE_MASK           0x4u
#define  RTC_IER_TAIE_SHIFT          2
//   Time Alarm Interrupt Enable
//     0b0 ==> Time alarm flag does not generate an interrupt.
//     0b1 ==> Time alarm flag does generate an interrupt.

#define  RTC_IER_TSIE_MASK           0x10u
#define  RTC_IER_TSIE_SHIFT          4
//   Time Seconds Interrupt Enable
//     0b0 ==> Seconds interrupt is disabled.
//     0b1 ==> Seconds interrupt is enabled.

#define  RTC_IER_WPON_MASK           0x80u
#define  RTC_IER_WPON_SHIFT          7
//   Wakup Pin On
//     0b0 ==> No effect.
//     0b1 ==> If the wakeup pin is enabled, then the wakeup pin will assert.

#define  SIM_SOPT1_OSC32KSEL_MASK    0xC0000u
#define  SIM_SOPT1_OSC32KSEL_SHIFT   18
#define  SIM_SOPT1_OSC32KSEL(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK)
//   32K oscillator clock select
//     0b00 ==> System oscillator (OSC32KCLK)
//     0b01 ==> Reserved
//     0b10 ==> RTC_CLKIN
//     0b11 ==> LPO 1kHz

#define  SIM_SOPT1_USBVSTBY_MASK     0x20000000u
#define  SIM_SOPT1_USBVSTBY_SHIFT    29
//   USB voltage regulator in standby mode during VLPR and VLPW modes
//     0b0 ==> USB voltage regulator not in standby during VLPR and VLPW modes.
//     0b1 ==> USB voltage regulator in standby during VLPR and VLPW modes.

#define  SIM_SOPT1_USBSSTBY_MASK     0x40000000u
#define  SIM_SOPT1_USBSSTBY_SHIFT    30
//   USB voltage regulator in standby mode during Stop, VLPS, LLS and VLLS modes.
//     0b0 ==> USB voltage regulator not in standby during Stop, VLPS, LLS and VLLS modes.
//     0b1 ==> USB voltage regulator in standby during Stop, VLPS, LLS and VLLS modes.

#define  SIM_SOPT1_USBREGEN_MASK     0x80000000u
#define  SIM_SOPT1_USBREGEN_SHIFT    31
//   USB voltage regulator enable
//     0b0 ==> USB voltage regulator is disabled.
//     0b1 ==> USB voltage regulator is enabled.

#define  SIM_SOPT1CFG_URWE_MASK      0x1000000u
#define  SIM_SOPT1CFG_URWE_SHIFT     24
//   USB voltage regulator enable write enable
//     0b0 ==> SOPT1 USBREGEN cannot be written.
//     0b1 ==> SOPT1 USBREGEN can be written.

#define  SIM_SOPT1CFG_UVSWE_MASK     0x2000000u
#define  SIM_SOPT1CFG_UVSWE_SHIFT    25
//   USB voltage regulator VLP standby write enable
//     0b0 ==> SOPT1 USBVSTB cannot be written.
//     0b1 ==> SOPT1 USBVSTB can be written.

#define  SIM_SOPT1CFG_USSWE_MASK     0x4000000u
#define  SIM_SOPT1CFG_USSWE_SHIFT    26
//   USB voltage regulator stop standby write enable
//     0b0 ==> SOPT1 USBSSTB cannot be written.
//     0b1 ==> SOPT1 USBSSTB can be written.

#define  SIM_SOPT2_RTCCLKOUTSEL_MASK 0x10u
#define  SIM_SOPT2_RTCCLKOUTSEL_SHIFT 4
//   RTC clock out select
//     0b0 ==> RTC 1 Hz clock is output on the RTC_CLKOUT pin.
//     0b1 ==> OSCERCLK0 clock is output on the RTC_CLKOUT pin.

#define  SIM_SOPT2_CLKOUTSEL_MASK    0xE0u
#define  SIM_SOPT2_CLKOUTSEL_SHIFT   5
#define  SIM_SOPT2_CLKOUTSEL(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_CLKOUTSEL_SHIFT))&SIM_SOPT2_CLKOUTSEL_MASK)
//   CLKOUT select
//     0b000 ==> Reserved
//     0b001 ==> Reserved
//     0b010 ==> Bus clock
//     0b011 ==> LPO clock (1 kHz)
//     0b100 ==> MCGIRCLK
//     0b101 ==> Reserved
//     0b110 ==> OSCERCLK0
//     0b111 ==> Reserved

#define  SIM_SOPT2_PLLFLLSEL_MASK    0x10000u
#define  SIM_SOPT2_PLLFLLSEL_SHIFT   16
//   PLL/FLL clock select
//     0b0 ==> MCGFLLCLK clock
//     0b1 ==> MCGPLLCLK clock with fixed divide by two

#define  SIM_SOPT2_USBSRC_MASK       0x40000u
#define  SIM_SOPT2_USBSRC_SHIFT      18
//   USB clock source select
//     0b0 ==> External bypass clock (USB_CLKIN).
//     0b1 ==> MCGPLLCLK / MCGFLLCLK clock

#define  SIM_SOPT2_LPTPMSRC_MASK     0x3000000u
#define  SIM_SOPT2_LPTPMSRC_SHIFT    24
#define  SIM_SOPT2_LPTPMSRC(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_LPTPMSRC_SHIFT))&SIM_SOPT2_LPTPMSRC_MASK)
//   LPTPM clock source select
//     0b00 ==> Clock disabled
//     0b01 ==> MCGFLLCLK clock MCGPLLCLK or
//     0b10 ==> OSCERCLK clock
//     0b11 ==> MCGIRCLK clock

#define  SIM_SOPT2_UART0SRC_MASK     0xC000000u
#define  SIM_SOPT2_UART0SRC_SHIFT    26
#define  SIM_SOPT2_UART0SRC(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_UART0SRC_SHIFT))&SIM_SOPT2_UART0SRC_MASK)
//   UART0 clock source select
//     0b00 ==> Clock disabled
//     0b01 ==> MCGFLLCLK clock or MCGPLLCLK/2 clock
//     0b10 ==> OSCERCLK clock
//     0b11 ==> MCGIRCLK clock

#define  SIM_SOPT4_LPTPM1CH0SRC_MASK 0x40000u
#define  SIM_SOPT4_LPTPM1CH0SRC_SHIFT 18
//   LPTPM1 channel 0 input capture source select
//     0b0 ==> LPTPM1_CH0 signal
//     0b1 ==> CMP0 output

