ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  SIM_SOPT4_LPTPM2CH0SRC_MASK 0x100000u
#define  SIM_SOPT4_LPTPM2CH0SRC_SHIFT 20
//   LPTPM2 channel 0 input capture source select
//     0b0 ==> LPTPM2_CH0 signal
//     0b1 ==> CMP0 output

#define  SIM_SOPT4_LPTPM0CLKSEL_MASK 0x1000000u
#define  SIM_SOPT4_LPTPM0CLKSEL_SHIFT 24
//   LPTPM0 External Clock Pin Select
//     0b0 ==> LPTPM0 external clock driven by LPTPM_CLK0 pin.
//     0b1 ==> LPTPM0 external clock driven by LPTPM_CLK1 pin.

#define  SIM_SOPT4_LPTPM1CLKSEL_MASK 0x2000000u
#define  SIM_SOPT4_LPTPM1CLKSEL_SHIFT 25
//   LPTPM1 External Clock Pin Select
//     0b0 ==> LPTPM1 external clock driven by LPTPM_CLK0 pin.
//     0b1 ==> LPTPM1 external clock driven by LPTPM_CLK1 pin.

#define  SIM_SOPT4_LPTPM2CLKSEL_MASK 0x4000000u
#define  SIM_SOPT4_LPTPM2CLKSEL_SHIFT 26
//   LPTPM2 External Clock Pin Select
//     0b0 ==> LPTPM2 external clock driven by LPTPM_CLK0 pin.
//     0b1 ==> LPTPM2 external clock driven by LPTPM_CLK1 pin.

#define  SIM_SOPT5_UART0TXSRC_MASK   0x3u
#define  SIM_SOPT5_UART0TXSRC_SHIFT  0
#define  SIM_SOPT5_UART0TXSRC(x)     (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0TXSRC_SHIFT))&SIM_SOPT5_UART0TXSRC_MASK)
//   UART0 transmit data source select
//     0b00 ==> UART0_TX pin
//     0b01 ==> UART0_TX pin modulated with LPTPM1 channel 0 output
//     0b10 ==> UART0_TX pin modulated with LPTPM2 channel 0 output
//     0b11 ==> Reserved

#define  SIM_SOPT5_UART0RXSRC_MASK   0x4u
#define  SIM_SOPT5_UART0RXSRC_SHIFT  2
//   UART0 receive data source select
//     0b0 ==> UART0_RX pin
//     0b1 ==> CMP0 output

#define  SIM_SOPT5_UART1TXSRC_MASK   0x30u
#define  SIM_SOPT5_UART1TXSRC_SHIFT  4
#define  SIM_SOPT5_UART1TXSRC(x)     (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1TXSRC_SHIFT))&SIM_SOPT5_UART1TXSRC_MASK)
//   UART1 transmit data source select
//     0b00 ==> UART1_TX pin
//     0b01 ==> UART1_TX pin modulated with LPTPM1 channel 0 output
//     0b10 ==> UART1_TX pin modulated with LPTPM2 channel 0 output
//     0b11 ==> Reserved

#define  SIM_SOPT5_UART1RXSRC_MASK   0x40u
#define  SIM_SOPT5_UART1RXSRC_SHIFT  6
//   UART1 receive data source select
//     0b0 ==> UART1_RX pin
//     0b1 ==> CMP0 output

#define  SIM_SOPT5_UART0ODE_MASK     0x10000u
#define  SIM_SOPT5_UART0ODE_SHIFT    16
//   UART0 Open Drain Enable
//     0b0 ==> Open drain is disabled on UART0
//     0b1 ==> Open drain is enabled on UART0

#define  SIM_SOPT5_UART1ODE_MASK     0x20000u
#define  SIM_SOPT5_UART1ODE_SHIFT    17
//   UART1 Open Drain Enable
//     0b0 ==> Open drain is disabled on UART1
//     0b1 ==> Open drain is enabled on UART1

#define  SIM_SOPT5_UART2ODE_MASK     0x40000u
#define  SIM_SOPT5_UART2ODE_SHIFT    18
//   UART2 Open Drain Enable
//     0b0 ==> Open drain is disabled on UART2
//     0b1 ==> Open drain is enabled on UART2

#define  SIM_SOPT7_ADC0TRGSEL_MASK   0xFu
#define  SIM_SOPT7_ADC0TRGSEL_SHIFT  0
#define  SIM_SOPT7_ADC0TRGSEL(x)     (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0TRGSEL_SHIFT))&SIM_SOPT7_ADC0TRGSEL_MASK)
//   ADC0 trigger select
//     0b0000 ==> External trigger pin input (EXTRG_IN)
//     0b0001 ==> HSCMP0 output
//     0b0010 ==> Reserved
//     0b0011 ==> Reserved
//     0b0100 ==> PIT trigger 0
//     0b0101 ==> PIT trigger 1
//     0b0110 ==> Reserved
//     0b0111 ==> Reserved
//     0b1000 ==> LPTPM0 overflow
//     0b1001 ==> LPTPM1 overflow
//     0b1010 ==> LPTPM2 overflow
//     0b1011 ==> Reserved
//     0b1100 ==> RTC alarm
//     0b1101 ==> RTC seconds
//     0b1110 ==> LPTMR0 trigger
//     0b1111 ==> Reserved

#define  SIM_SOPT7_ADC0PRETRGSEL_MASK 0x10u
#define  SIM_SOPT7_ADC0PRETRGSEL_SHIFT 4
//   ADC0 pretrigger select
//     0b0 ==> Pre-trigger A
//     0b1 ==> Pre-trigger B

#define  SIM_SOPT7_ADC0ALTTRGEN_MASK 0x80u
#define  SIM_SOPT7_ADC0ALTTRGEN_SHIFT 7
//   ADC0 alternate trigger enable
//     0b0 ==> LPTPM1 channel 0 (A) and channel 1 (B) triggers selected for ADC0.
//     0b1 ==> Alternate trigger selected for ADC0.

#define  SIM_SDID_PINID_MASK         0xFu
#define  SIM_SDID_PINID_SHIFT        0
#define  SIM_SDID_PINID(x)           (((uint32_t)(((uint32_t)(x))<<SIM_SDID_PINID_SHIFT))&SIM_SDID_PINID_MASK)
//   Pincount identification
//     0b0000 ==> 16-pin
//     0b0001 ==> 24-pin
//     0b0010 ==> 32-pin
//     0b0011 ==> 44-pin
//     0b0100 ==> 48-pin
//     0b0101 ==> 64-pin
//     0b0110 ==> 80-pin
//     0b0111 ==> Reserved
//     0b1000 ==> 100-pin
//     0b1001 ==> Reserved
//     0b1010 ==> Reserved
//     0b1011 ==> Reserved
//     0b1100 ==> Reserved
//     0b1101 ==> Reserved
//     0b1110 ==> Reserved
//     0b1111 ==> Reserved

#define  SIM_SDID_DIEID_MASK         0xF80u
#define  SIM_SDID_DIEID_SHIFT        7
#define  SIM_SDID_DIEID(x)           (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK)
//   Device die number

#define  SIM_SDID_REVID_MASK         0xF000u
#define  SIM_SDID_REVID_SHIFT        12
#define  SIM_SDID_REVID(x)           (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK)
//   Device revision number

#define  SIM_SDID_SRAMSIZE_MASK      0xF0000u
#define  SIM_SDID_SRAMSIZE_SHIFT     16
#define  SIM_SDID_SRAMSIZE(x)        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SRAMSIZE_SHIFT))&SIM_SDID_SRAMSIZE_MASK)
//   System SRAM Size
//     0b0000 ==> 0.5kB
//     0b0001 ==> 1 kB
//     0b0010 ==> 2 kB
//     0b0011 ==> 4 kB
//     0b0100 ==> 8 kB
//     0b0101 ==> 16 kB
//     0b0110 ==> 32 kB
//     0b0111 ==> 64 kB

#define  SIM_SDID_SERIESID_MASK      0xF00000u
#define  SIM_SDID_SERIESID_SHIFT     20
#define  SIM_SDID_SERIESID(x)        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SERIESID_SHIFT))&SIM_SDID_SERIESID_MASK)
//   Kinetis Series ID
//     0b0001 ==> KL family

#define  SIM_SDID_SUBFAMID_MASK      0xF000000u
#define  SIM_SDID_SUBFAMID_SHIFT     24
#define  SIM_SDID_SUBFAMID(x)        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SUBFAMID_SHIFT))&SIM_SDID_SUBFAMID_MASK)
//   Kinetis Sub-Family ID
//     0b0100 ==> KLx4 Subfamily (basic analog)
//     0b0101 ==> KLx5 Subfamily (advanced analog)

#define  SIM_SDID_FAMID_MASK         0xF0000000u
#define  SIM_SDID_FAMID_SHIFT        28
#define  SIM_SDID_FAMID(x)           (((uint32_t)(((uint32_t)(x))<<SIM_SDID_FAMID_SHIFT))&SIM_SDID_FAMID_MASK)
//   Kinetis family ID
//     0b0000 ==> KL0x Family
//     0b0001 ==> KL1x Family (basic)
//     0b0010 ==> KL2x Family (USB)
//     0b0011 ==> KL3x Family (Segment LCD)
//     0b0100 ==> KL4x Family (USB and Segment LCD)

#define  SIM_SCGC4_I2C0_MASK         0x40u
#define  SIM_SCGC4_I2C0_SHIFT        6
//   I2C0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_I2C1_MASK         0x80u
#define  SIM_SCGC4_I2C1_SHIFT        7
//   I2C1 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_UART0_MASK        0x400u
#define  SIM_SCGC4_UART0_SHIFT       10
//   UART0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

