ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  SIM_SCGC4_UART1_MASK        0x800u
#define  SIM_SCGC4_UART1_SHIFT       11
//   UART1 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_UART2_MASK        0x1000u
#define  SIM_SCGC4_UART2_SHIFT       12
//   UART2 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_USBOTG_MASK       0x40000u
#define  SIM_SCGC4_USBOTG_SHIFT      18
//   USB Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_CMP_MASK          0x80000u
#define  SIM_SCGC4_CMP_SHIFT         19
//   Comparator Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_SPI0_MASK         0x400000u
#define  SIM_SCGC4_SPI0_SHIFT        22
//   SPI0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC4_SPI1_MASK         0x800000u
#define  SIM_SCGC4_SPI1_SHIFT        23
//   SPI1 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC5_LPTMR_MASK        0x1u
#define  SIM_SCGC5_LPTMR_SHIFT       0
//   Low Power Timer Access Control
//     0b0 ==> Access disabled
//     0b1 ==> Access enabled

#define  SIM_SCGC5_TSI_MASK          0x20u
#define  SIM_SCGC5_TSI_SHIFT         5
//   TSI Access Control
//     0b0 ==> Access disabled
//     0b1 ==> Access enabled

#define  SIM_SCGC5_PORTA_MASK        0x200u
#define  SIM_SCGC5_PORTA_SHIFT       9
//   Port A Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC5_PORTB_MASK        0x400u
#define  SIM_SCGC5_PORTB_SHIFT       10
//   Port B Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC5_PORTC_MASK        0x800u
#define  SIM_SCGC5_PORTC_SHIFT       11
//   Port C Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC5_PORTD_MASK        0x1000u
#define  SIM_SCGC5_PORTD_SHIFT       12
//   Port D Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC5_PORTE_MASK        0x2000u
#define  SIM_SCGC5_PORTE_SHIFT       13
//   Port E Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_FTF_MASK          0x1u
#define  SIM_SCGC6_FTF_SHIFT         0
//   Flash Memory Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_DMAMUX_MASK       0x2u
#define  SIM_SCGC6_DMAMUX_SHIFT      1
//   DMA Mux Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_PIT_MASK          0x800000u
#define  SIM_SCGC6_PIT_SHIFT         23
//   PIT Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_LPTPM0_MASK       0x1000000u
#define  SIM_SCGC6_LPTPM0_SHIFT      24
//   LPTPM0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_LPTPM1_MASK       0x2000000u
#define  SIM_SCGC6_LPTPM1_SHIFT      25
//   LPTPM1 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_LPTPM2_MASK       0x4000000u
#define  SIM_SCGC6_LPTPM2_SHIFT      26
//   LPTPM2 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_ADC0_MASK         0x8000000u
#define  SIM_SCGC6_ADC0_SHIFT        27
//   ADC0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_RTC_MASK          0x20000000u
#define  SIM_SCGC6_RTC_SHIFT         29
//   RTC Access Control
//     0b0 ==> Access and interrupts disabled
//     0b1 ==> Access and interrupts enabled

#define  SIM_SCGC6_DAC0_MASK         0x80000000u
#define  SIM_SCGC6_DAC0_SHIFT        31
//   DAC0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC7_DMA_MASK          0x100u
#define  SIM_SCGC7_DMA_SHIFT         8
//   DMA Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_CLKDIV1_OUTDIV4_MASK    0x70000u
#define  SIM_CLKDIV1_OUTDIV4_SHIFT   16
#define  SIM_CLKDIV1_OUTDIV4(x)      (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK)
//   Clock 4 output divider value
//     0b000 ==> Divide-by-1.
//     0b001 ==> Divide-by-2.
//     0b010 ==> Divide-by-3.
//     0b011 ==> Divide-by-4.
//     0b100 ==> Divide-by-5.
//     0b101 ==> Divide-by-6.
//     0b110 ==> Divide-by-7.
//     0b111 ==> Divide-by-8.

#define  SIM_CLKDIV1_OUTDIV1_MASK    0xF0000000u
#define  SIM_CLKDIV1_OUTDIV1_SHIFT   28
#define  SIM_CLKDIV1_OUTDIV1(x)      (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK)
//   Clock 1 output divider value
//     0b0000 ==> Divide-by-1.
//     0b0001 ==> Divide-by-2.
//     0b0010 ==> Divide-by-3.
//     0b0011 ==> Divide-by-4.
//     0b0100 ==> Divide-by-5.
//     0b0101 ==> Divide-by-6.
//     0b0110 ==> Divide-by-7.
//     0b0111 ==> Divide-by-8.
//     0b1000 ==> Divide-by-9.
//     0b1001 ==> Divide-by-10.
//     0b1010 ==> Divide-by-11.
//     0b1011 ==> Divide-by-12.
//     0b1100 ==> Divide-by-13.
//     0b1101 ==> Divide-by-14.
//     0b1110 ==> Divide-by-15.
//     0b1111 ==> Divide-by-16.

#define  SIM_FCFG1_FLASHDIS_MASK     0x1u
#define  SIM_FCFG1_FLASHDIS_SHIFT    0
//   Flash Disable
//     0b0 ==> Flash is enabled
//     0b1 ==> Flash is disabled

#define  SIM_FCFG1_FLASHDOZE_MASK    0x2u
#define  SIM_FCFG1_FLASHDOZE_SHIFT   1
//   Flash Doze
//     0b0 ==> Flash remains enabled during Doze mode
//     0b1 ==> Flash is disabled for the duration of Doze mode

#define  SIM_FCFG1_PFSIZE_MASK       0xF000000u
#define  SIM_FCFG1_PFSIZE_SHIFT      24
#define  SIM_FCFG1_PFSIZE(x)         (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK)
//   Program flash size
//     0b0000 ==> 8 KB of program flash memory, 0.25 KB protection region
//     0b0001 ==> 16 KB of program flash memory, 0.5 KB protection region
//     0b0011 ==> 32 KB of program flash memory, 1 KB protection region
//     0b0101 ==> 64 KB of program flash memory, 2 KB protection region
//     0b0111 ==> 128 KB of program flash memory, 4 KB protection region
//     0b1001 ==> 256 KB of program flash memory, 4 KB protection region
//     0b1111 ==> 128 KB of program flash memory, 4 KB protection region

#define  SIM_FCFG2_MAXADDR_MASK      0x7F000000u
#define  SIM_FCFG2_MAXADDR_SHIFT     24
#define  SIM_FCFG2_MAXADDR(x)        (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR_SHIFT))&SIM_FCFG2_MAXADDR_MASK)
//   Max address block

#define  SIM_UIDMH_UID_MASK          0xFFFFu
#define  SIM_UIDMH_UID_SHIFT         0
#define  SIM_UIDMH_UID(x)            (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK)
//   Unique Identification

#define  SIM_UIDML_UID_MASK          0xFFFFFFFFu
#define  SIM_UIDML_UID_SHIFT         0
#define  SIM_UIDML_UID(x)            (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK)
//   Unique Identification

#define  SIM_UIDL_UID_MASK           0xFFFFFFFFu
#define  SIM_UIDL_UID_SHIFT          0
#define  SIM_UIDL_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK)
//   Unique Identification

#define  SIM_COPC_COPW_MASK          0x1u
#define  SIM_COPC_COPW_SHIFT         0
//   COP windowed mode
//     0b0 ==> Normal mode
//     0b1 ==> Windowed mode

