ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  SPI1_C1_CPOL_MASK           0x8u
#define  SPI1_C1_CPOL_SHIFT          3
//   Clock polarity
//     0b0 ==> Active-high SPI clock (idles low)
//     0b1 ==> Active-low SPI clock (idles high)

#define  SPI1_C1_MSTR_MASK           0x10u
#define  SPI1_C1_MSTR_SHIFT          4
//   Master/slave mode select
//     0b0 ==> SPI module configured as a slave SPI device
//     0b1 ==> SPI module configured as a master SPI device

#define  SPI1_C1_SPTIE_MASK          0x20u
#define  SPI1_C1_SPTIE_SHIFT         5
//   SPI transmit interrupt enable
//     0b0 ==> Interrupts from SPTEF inhibited (use polling)
//     0b1 ==> When SPTEF is 1, hardware interrupt requested

#define  SPI1_C1_SPE_MASK            0x40u
#define  SPI1_C1_SPE_SHIFT           6
//   SPI system enable
//     0b0 ==> SPI system inactive
//     0b1 ==> SPI system enabled

#define  SPI1_C1_SPIE_MASK           0x80u
#define  SPI1_C1_SPIE_SHIFT          7
//   SPI interrupt enable: for SPRF and MODF
//     0b0 ==> Interrupts from SPRF and MODF are inhibited-use polling
//     0b1 ==> Request a hardware interrupt when SPRF or MODF is 1

#define  SPI1_C2_SPC0_MASK           0x1u
#define  SPI1_C2_SPC0_SHIFT          0
//   SPI pin control 0
//     0b0 ==> SPI uses separate pins for data input and data output (pin mode is normal). In master mode of operation: MISO is master in and MOSI is master out. In slave mode of operation: MISO is slave out and MOSI is slave in.
//     0b1 ==> SPI configured for single-wire bidirectional operation (pin mode is bidirectional). In master mode of operation: MISO is not used by SPI; MOSI is master in when BIDIROE is 0 or master I/O when BIDIROE is 1. In slave mode of operation: MISO is slave in when BIDIROE is 0 or slave I/O when BIDIROE is 1; MOSI is not used by SPI.

#define  SPI1_C2_SPISWAI_MASK        0x2u
#define  SPI1_C2_SPISWAI_SHIFT       1
//   SPI stop in wait mode
//     0b0 ==> SPI clocks continue to operate in wait mode
//     0b1 ==> SPI clocks stop when the MCU enters wait mode

#define  SPI1_C2_RXDMAE_MASK         0x4u
#define  SPI1_C2_RXDMAE_SHIFT        2
//   Receive DMA enable
//     0b0 ==> DMA request for receive is disabled and interrupt from SPRF is allowed
//     0b1 ==> DMA request for receive is enabled and interrupt from SPRF is disabled

#define  SPI1_C2_BIDIROE_MASK        0x8u
#define  SPI1_C2_BIDIROE_SHIFT       3
//   Bidirectional mode output enable
//     0b0 ==> Output driver disabled so SPI data I/O pin acts as an input
//     0b1 ==> SPI I/O pin enabled as an output

#define  SPI1_C2_MODFEN_MASK         0x10u
#define  SPI1_C2_MODFEN_SHIFT        4
//   Master mode-fault function enable
//     0b0 ==> Mode fault function disabled, master SS pin reverts to general-purpose I/O not controlled by SPI
//     0b1 ==> Mode fault function enabled, master SS pin acts as the mode fault input or the slave select output

#define  SPI1_C2_TXDMAE_MASK         0x20u
#define  SPI1_C2_TXDMAE_SHIFT        5
//   Transmit DMA enable
//     0b0 ==> DMA request for transmit is disabled and interrupt from SPTEF is allowed
//     0b1 ==> DMA request for transmit is enabled and interrupt from SPTEF is disabled

#define  SPI1_C2_SPLPIE_MASK         0x40u
#define  SPI1_C2_SPLPIE_SHIFT        6
//   SPI low power interrupt enable bit
//     0b0 ==> The SPI module cannot generate an asynchronous interrupt to wake the CPU from wait mode or stop mode.
//     0b1 ==> Under specific conditions, the SPI module can generate an asynchronous interrupt to wake the CPU from wait mode or stop mode.

#define  SPI1_C2_SPMIE_MASK          0x80u
#define  SPI1_C2_SPMIE_SHIFT         7
//   SPI match interrupt enable
//     0b0 ==> Interrupts from SPMF inhibited (use polling)
//     0b1 ==> When SPMF is 1, requests a hardware interrupt

#define  SPI1_BR_SPR_MASK            0xFu
#define  SPI1_BR_SPR_SHIFT           0
#define  SPI1_BR_SPR(x)              (((uint8_t)(((uint8_t)(x))<<SPI1_BR_SPR_SHIFT))&SPI1_BR_SPR_MASK)
//   SPI baud rate divisor
//     0b0000 ==> Baud rate divisor is 2
//     0b0001 ==> Baud rate divisor is 4
//     0b0010 ==> Baud rate divisor is 8
//     0b0011 ==> Baud rate divisor is 16
//     0b0100 ==> Baud rate divisor is 32
//     0b0101 ==> Baud rate divisor is 64
//     0b0110 ==> Baud rate divisor is 128
//     0b0111 ==> Baud rate divisor is 256
//     0b1000 ==> Baud rate divisor is 512

#define  SPI1_BR_SPPR_MASK           0x70u
#define  SPI1_BR_SPPR_SHIFT          4
#define  SPI1_BR_SPPR(x)             (((uint8_t)(((uint8_t)(x))<<SPI1_BR_SPPR_SHIFT))&SPI1_BR_SPPR_MASK)
//   SPI baud rate prescale divisor
//     0b000 ==> Baud rate prescaler divisor is 1
//     0b001 ==> Baud rate prescaler divisor is 2
//     0b010 ==> Baud rate prescaler divisor is 3
//     0b011 ==> Baud rate prescaler divisor is 4
//     0b100 ==> Baud rate prescaler divisor is 5
//     0b101 ==> Baud rate prescaler divisor is 6
//     0b110 ==> Baud rate prescaler divisor is 7
//     0b111 ==> Baud rate prescaler divisor is 8

#define  SPI1_S_MODF_MASK            0x10u
#define  SPI1_S_MODF_SHIFT           4
//   Master mode fault flag
//     0b0 ==> No mode fault error
//     0b1 ==> Mode fault error detected

#define  SPI1_S_SPTEF_MASK           0x20u
#define  SPI1_S_SPTEF_SHIFT          5
//   SPI transmit buffer empty flag
//     0b0 ==> SPI transmit buffer not empty
//     0b1 ==> SPI transmit buffer empty

#define  SPI1_S_SPMF_MASK            0x40u
#define  SPI1_S_SPMF_SHIFT           6
//   SPI match flag
//     0b0 ==> Value in the receive data buffer does not match the value in the M register
//     0b1 ==> Value in the receive data buffer matches the value in the M register

#define  SPI1_S_SPRF_MASK            0x80u
#define  SPI1_S_SPRF_SHIFT           7
//   SPI read buffer full flag
//     0b0 ==> No data available in the receive data buffer
//     0b1 ==> Data available in the receive data buffer

#define  SPI1_D_Bits_MASK            0xFFu
#define  SPI1_D_Bits_SHIFT           0
#define  SPI1_D_Bits(x)              (((uint8_t)(((uint8_t)(x))<<SPI1_D_Bits_SHIFT))&SPI1_D_Bits_MASK)
//   Data (low byte)

