ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  SPI1_M_Bits_MASK            0xFFu
#define  SPI1_M_Bits_SHIFT           0
#define  SPI1_M_Bits(x)              (((uint8_t)(((uint8_t)(x))<<SPI1_M_Bits_SHIFT))&SPI1_M_Bits_MASK)
//   Hardware compare value (low byte)

#define  TSI0_GENCS_CURSW_MASK       0x2u
#define  TSI0_GENCS_CURSW_SHIFT      1
//   CURSW
//     0b0 ==> The current source pair are not swapped.
//     0b1 ==> The current source pair are swapped.

#define  TSI0_GENCS_EOSF_MASK        0x4u
#define  TSI0_GENCS_EOSF_SHIFT       2
//   End of Scan Flag
//     0b0 ==> Scan not complete.
//     0b1 ==> Scan complete.

#define  TSI0_GENCS_SCNIP_MASK       0x8u
#define  TSI0_GENCS_SCNIP_SHIFT      3
//   Scan In Progress Status
//     0b0 ==> No scan in progress.
//     0b1 ==> Scan in progress.

#define  TSI0_GENCS_STM_MASK         0x10u
#define  TSI0_GENCS_STM_SHIFT        4
//   Scan Trigger Mode
//     0b0 ==> Software trigger scan.
//     0b1 ==> Hardware trigger scan.

#define  TSI0_GENCS_STPE_MASK        0x20u
#define  TSI0_GENCS_STPE_SHIFT       5
//   TSI STOP Enable
//     0b0 ==> TSI is disabled when MCU goes into low power mode.
//     0b1 ==> Allows TSI to continue running in all low power modes.

#define  TSI0_GENCS_TSIIEN_MASK      0x40u
#define  TSI0_GENCS_TSIIEN_SHIFT     6
//   Touch Sensing Input Interrupt Enable
//     0b0 ==> TSI interrupt is disabled.
//     0b1 ==> TSI interrupt is enabled.

#define  TSI0_GENCS_TSIEN_MASK       0x80u
#define  TSI0_GENCS_TSIEN_SHIFT      7
//   Touch Sensing Input Module Enable
//     0b0 ==> TSI module disabled.
//     0b1 ==> TSI module enabled.

#define  TSI0_GENCS_NSCN_MASK        0x1F00u
#define  TSI0_GENCS_NSCN_SHIFT       8
#define  TSI0_GENCS_NSCN(x)          (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_NSCN_SHIFT))&TSI0_GENCS_NSCN_MASK)
//   NSCN
//     0b00000 ==> Once per electrode
//     0b00001 ==> Twice per electrode
//     0b00010 ==> 3 times per electrode
//     0b00011 ==> 4 times per electrode
//     0b00100 ==> 5 times per electrode
//     0b00101 ==> 6 times per electrode
//     0b00110 ==> 7 times per electrode
//     0b00111 ==> 8 times per electrode
//     0b01000 ==> 9 times per electrode
//     0b01001 ==> 10 times per electrode
//     0b01010 ==> 11 times per electrode
//     0b01011 ==> 12 times per electrode
//     0b01100 ==> 13 times per electrode
//     0b01101 ==> 14 times per electrode
//     0b01110 ==> 15 times per electrode
//     0b01111 ==> 16 times per electrode
//     0b10000 ==> 17 times per electrode
//     0b10001 ==> 18 times per electrode
//     0b10010 ==> 19 times per electrode
//     0b10011 ==> 20 times per electrode
//     0b10100 ==> 21 times per electrode
//     0b10101 ==> 22 times per electrode
//     0b10110 ==> 23 times per electrode
//     0b10111 ==> 24 times per electrode
//     0b11000 ==> 25 times per electrode
//     0b11001 ==> 26 times per electrode
//     0b11010 ==> 27 times per electrode
//     0b11011 ==> 28 times per electrode
//     0b11100 ==> 29 times per electrode
//     0b11101 ==> 30 times per electrode
//     0b11110 ==> 31 times per electrode
//     0b11111 ==> 32 times per electrode

#define  TSI0_GENCS_PS_MASK          0xE000u
#define  TSI0_GENCS_PS_SHIFT         13
#define  TSI0_GENCS_PS(x)            (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_PS_SHIFT))&TSI0_GENCS_PS_MASK)
//   PS
//     0b000 ==> Electrode Oscillator Frequency divided by 1
//     0b001 ==> Electrode Oscillator Frequency divided by 2
//     0b010 ==> Electrode Oscillator Frequency divided by 4
//     0b011 ==> Electrode Oscillator Frequency divided by 8
//     0b100 ==> Electrode Oscillator Frequency divided by 16
//     0b101 ==> Electrode Oscillator Frequency divided by 32
//     0b110 ==> Electrode Oscillator Frequency divided by 64
//     0b111 ==> Electrode Oscillator Frequency divided by 128

#define  TSI0_GENCS_EXTCHRG_MASK     0x70000u
#define  TSI0_GENCS_EXTCHRG_SHIFT    16
#define  TSI0_GENCS_EXTCHRG(x)       (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_EXTCHRG_SHIFT))&TSI0_GENCS_EXTCHRG_MASK)
//   EXTCHRG
//     0b000 ==> 500 nA.
//     0b001 ==> 1 μA.
//     0b010 ==> 2 μA.
//     0b011 ==> 4 μA.
//     0b100 ==> 8 μA.
//     0b101 ==> 16 μA.
//     0b110 ==> 32 μA.
//     0b111 ==> 64 μA.

#define  TSI0_GENCS_DVOLT_MASK       0x180000u
#define  TSI0_GENCS_DVOLT_SHIFT      19
#define  TSI0_GENCS_DVOLT(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_DVOLT_SHIFT))&TSI0_GENCS_DVOLT_MASK)
//   DVOLT
//     0b00 ==> DV = 1.03 V; VP = 1.33 V; Vm = 0.30 V.
//     0b01 ==> DV = 0.73 V; VP = 1.18 V; Vm = 0.45 V.
//     0b10 ==> DV = 0.43 V; VP = 1.03 V; Vm = 0.60 V.
//     0b11 ==> DV = 0.29 V; VP = 0.95 V; Vm = 0.67 V.

#define  TSI0_GENCS_REFCHRG_MASK     0xE00000u
#define  TSI0_GENCS_REFCHRG_SHIFT    21
#define  TSI0_GENCS_REFCHRG(x)       (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_REFCHRG_SHIFT))&TSI0_GENCS_REFCHRG_MASK)
//   REFCHRG
//     0b000 ==> 500 nA.
//     0b001 ==> 1 μA.
//     0b010 ==> 2 μA.
//     0b011 ==> 4 μA.
//     0b100 ==> 8 μA.
//     0b101 ==> 16 μA.
//     0b110 ==> 32 μA.
//     0b111 ==> 64 μA.

#define  TSI0_GENCS_STATUS_SETUP_MASK 0xF000000u
#define  TSI0_GENCS_STATUS_SETUP_SHIFT 24
#define  TSI0_GENCS_STATUS_SETUP(x)  (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_STATUS_SETUP_SHIFT))&TSI0_GENCS_STATUS_SETUP_MASK)
//   TSI analog modes setup and status bits.
//     0b0000 ==> Set TSI in capacitive sensing(non-noise detection) mode.
//     0b0100 ==> Set TSI analog to work in single threshold noise detection mode and the frequency limitation circuit is disabled.
//     0b1000 ==> Set TSI analog to work in single threshold noise detection mode and the frequency limitation circuit is enabled to work in higher frequencies operations.
//     0b1100 ==> Set TSI analog to work in automatic noise detection mode.

#define  TSI0_GENCS_ESOR_MASK        0x10000000u
#define  TSI0_GENCS_ESOR_SHIFT       28
//   End-of-scan or Out-of-Range Interrupt Selection
//     0b0 ==> Out-of-range interrupt is allowed.
//     0b1 ==> End-of-scan interrupt is allowed.

#define  TSI0_GENCS_OUTRGF_MASK      0x80000000u
#define  TSI0_GENCS_OUTRGF_SHIFT     31
//   Out of Range Flag.

#define  TSI0_DATA_TSICNT_MASK       0xFFFFu
#define  TSI0_DATA_TSICNT_SHIFT      0
#define  TSI0_DATA_TSICNT(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_DATA_TSICNT_SHIFT))&TSI0_DATA_TSICNT_MASK)
//   TSI Conversion Counter Value

#define  TSI0_DATA_SWTS_MASK         0x400000u
#define  TSI0_DATA_SWTS_SHIFT        22
//   Software Trigger Start
//     0b0 ==> No effect.
//     0b1 ==> Start a scan to determine which channel is specified by TSI_DATA[TSICH].

#define  TSI0_DATA_DMAEN_MASK        0x800000u
#define  TSI0_DATA_DMAEN_SHIFT       23
//   DMA Transfer Enabled
//     0b0 ==> Interrupt is selected when the interrupt enable bit is set and the corresponding TSI events assert.
//     0b1 ==> DMA transfer request is selected when the interrupt enable bit is set and the corresponding TSI events assert.

