ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  TSI0_DATA_TSICH_MASK        0xF0000000u
#define  TSI0_DATA_TSICH_SHIFT       28
#define  TSI0_DATA_TSICH(x)          (((uint32_t)(((uint32_t)(x))<<TSI0_DATA_TSICH_SHIFT))&TSI0_DATA_TSICH_MASK)
//   TSICH
//     0b0000 ==> Channel 0.
//     0b0001 ==> Channel 1.
//     0b0010 ==> Channel 2.
//     0b0011 ==> Channel 3.
//     0b0100 ==> Channel 4.
//     0b0101 ==> Channel 5.
//     0b0110 ==> Channel 6.
//     0b0111 ==> Channel 7.
//     0b1000 ==> Channel 8.
//     0b1001 ==> Channel 9.
//     0b1010 ==> Channel 10.
//     0b1011 ==> Channel 11.
//     0b1100 ==> Channel 12.
//     0b1101 ==> Channel 13.
//     0b1110 ==> Channel 14.
//     0b1111 ==> Channel 15.

#define  TSI0_TSHD_THRESL_MASK       0xFFFFu
#define  TSI0_TSHD_THRESL_SHIFT      0
#define  TSI0_TSHD_THRESL(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_TSHD_THRESL_SHIFT))&TSI0_TSHD_THRESL_MASK)
//   TSI Wakeup Channel Low-threshold

#define  TSI0_TSHD_THRESH_MASK       0xFFFF0000u
#define  TSI0_TSHD_THRESH_SHIFT      16
#define  TSI0_TSHD_THRESH(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_TSHD_THRESH_SHIFT))&TSI0_TSHD_THRESH_MASK)
//   TSI Wakeup Channel High-threshold
/*
#define  UART0_BDH_SBR_MASK          0x1Fu
#define  UART0_BDH_SBR_SHIFT         0
#define  UART0_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART0_BDH_SBR_SHIFT))&UART0_BDH_SBR_MASK)
//   Baud Rate Modulo Divisor.

#define  UART0_BDH_SBNS_MASK         0x20u
#define  UART0_BDH_SBNS_SHIFT        5
//   Stop Bit Number Select
//     0b0 ==> One stop bit.
//     0b1 ==> Two stop bit.

#define  UART0_BDH_RXEDGIE_MASK      0x40u
#define  UART0_BDH_RXEDGIE_SHIFT     6
//   RX Input Active Edge Interrupt Enable (for RXEDGIF)
//     0b0 ==> Hardware interrupts from UART_S2[RXEDGIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when UART_S2[RXEDGIF] flag is 1.

#define  UART0_BDH_LBKDIE_MASK       0x80u
#define  UART0_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable (for LBKDIF)
//     0b0 ==> Hardware interrupts from UART_S2[LBKDIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when UART_S2[LBKDIF] flag is 1.

#define  UART0_BDL_SBR_MASK          0xFFu
#define  UART0_BDL_SBR_SHIFT         0
#define  UART0_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART0_BDL_SBR_SHIFT))&UART0_BDL_SBR_MASK)
//   Baud Rate Modulo Divisor

#define  UART0_C1_PT_MASK            0x1u
#define  UART0_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART0_C1_PE_MASK            0x2u
#define  UART0_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> No hardware parity generation or checking.
//     0b1 ==> Parity enabled.

#define  UART0_C1_ILT_MASK           0x4u
#define  UART0_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

#define  UART0_C1_WAKE_MASK          0x8u
#define  UART0_C1_WAKE_SHIFT         3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle-line wakeup.
//     0b1 ==> Address-mark wakeup.

#define  UART0_C1_M_MASK             0x10u
#define  UART0_C1_M_SHIFT            4
//   9-Bit or 8-Bit Mode Select
//     0b0 ==> Receiver and transmitter use 8-bit data characters.
//     0b1 ==> Receiver and transmitter use 9-bit data characters.

#define  UART0_C1_RSRC_MASK          0x20u
#define  UART0_C1_RSRC_SHIFT         5
//   Receiver Source Select
//     0b0 ==> Provided LOOPS is set, RSRC is cleared, selects internal loop back mode and the UART does not use the UART_RX pins.
//     0b1 ==> Single-wire UART mode where the UART_TX pin is connected to the transmitter output and receiver input.

#define  UART0_C1_DOZEEN_MASK        0x40u
#define  UART0_C1_DOZEEN_SHIFT       6
//   Doze Enable
//     0b0 ==> UART is enabled in Wait mode.
//     0b1 ==> UART is disabled in Wait mode.

#define  UART0_C1_LOOPS_MASK         0x80u
#define  UART0_C1_LOOPS_SHIFT        7
//   Loop Mode Select
//     0b0 ==> Normal operation - UART_RX and UART_TX use separate pins.
//     0b1 ==> Loop mode or single-wire mode where transmitter outputs are internally connected to receiver input. (See RSRC bit.) UART_RX pin is not used by UART.

#define  UART0_C2_SBK_MASK           0x1u
#define  UART0_C2_SBK_SHIFT          0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break character(s) to be sent.

#define  UART0_C2_RWU_MASK           0x2u
#define  UART0_C2_RWU_SHIFT          1
//   Receiver Wakeup Control
//     0b0 ==> Normal UART receiver operation.
//     0b1 ==> UART receiver in standby waiting for wakeup condition.

#define  UART0_C2_RE_MASK            0x4u
#define  UART0_C2_RE_SHIFT           2
//   Receiver Enable
//     0b0 ==> Receiver disabled.
//     0b1 ==> Receiver enabled.

#define  UART0_C2_TE_MASK            0x8u
#define  UART0_C2_TE_SHIFT           3
//   Transmitter Enable
//     0b0 ==> Transmitter disabled.
//     0b1 ==> Transmitter enabled.

#define  UART0_C2_ILIE_MASK          0x10u
#define  UART0_C2_ILIE_SHIFT         4
//   Idle Line Interrupt Enable for IDLE
//     0b0 ==> Hardware interrupts from IDLE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when IDLE flag is 1.

#define  UART0_C2_RIE_MASK           0x20u
#define  UART0_C2_RIE_SHIFT          5
//   Receiver Interrupt Enable for RDRF
//     0b0 ==> Hardware interrupts from RDRF disabled; use polling.
//     0b1 ==> Hardware interrupt requested when RDRF flag is 1.

#define  UART0_C2_TCIE_MASK          0x40u
#define  UART0_C2_TCIE_SHIFT         6
//   Transmission Complete Interrupt Enable for TC
//     0b0 ==> Hardware interrupts from TC disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TC flag is 1.

#define  UART0_C2_TIE_MASK           0x80u
#define  UART0_C2_TIE_SHIFT          7
//   Transmit Interrupt Enable for TDRE
//     0b0 ==> Hardware interrupts from TDRE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TDRE flag is 1.

#define  UART0_S1_PF_MASK            0x1u
#define  UART0_S1_PF_SHIFT           0
//   Parity Error Flag
//     0b0 ==> No parity error.
//     0b1 ==> Parity error.

#define  UART0_S1_FE_MASK            0x2u
#define  UART0_S1_FE_SHIFT           1
//   Framing Error Flag
//     0b0 ==> No framing error detected. This does not guarantee the framing is correct.
//     0b1 ==> Framing error.

#define  UART0_S1_NF_MASK            0x4u
#define  UART0_S1_NF_SHIFT           2
//   Noise Flag
//     0b0 ==> No noise detected.
//     0b1 ==> Noise detected in the received character in UART_D.

#define  UART0_S1_OR_MASK            0x8u
#define  UART0_S1_OR_SHIFT           3
//   Receiver Overrun Flag
//     0b0 ==> No overrun.
//     0b1 ==> Receive overrun (new UART data lost).

#define  UART0_S1_IDLE_MASK          0x10u
#define  UART0_S1_IDLE_SHIFT         4
//   Idle Line Flag
//     0b0 ==> No idle line detected.
//     0b1 ==> Idle line was detected.

#define  UART0_S1_RDRF_MASK          0x20u
#define  UART0_S1_RDRF_SHIFT         5
//   Receive Data Register Full Flag
//     0b0 ==> Receive data buffer empty.
//     0b1 ==> Receive data buffer full.

#define  UART0_S1_TC_MASK            0x40u
#define  UART0_S1_TC_SHIFT           6
//   Transmission Complete Flag
//     0b0 ==> Transmitter active (sending data, a preamble, or a break).
//     0b1 ==> Transmitter idle (transmission activity complete).

#define  UART0_S1_TDRE_MASK          0x80u
#define  UART0_S1_TDRE_SHIFT         7
//   Transmit Data Register Empty Flag
//     0b0 ==> Transmit data buffer full.
//     0b1 ==> Transmit data buffer empty.

