ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  UART0_S2_RAF_MASK           0x1u
#define  UART0_S2_RAF_SHIFT          0
//   Receiver Active Flag
//     0b0 ==> UART receiver idle waiting for a start bit.
//     0b1 ==> UART receiver active (UART_RXD input not idle).

#define  UART0_S2_LBKDE_MASK         0x2u
#define  UART0_S2_LBKDE_SHIFT        1
//   LIN Break Detection Enable
//     0b0 ==> Break character is detected at length 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
//     0b1 ==> Break character is detected at length of 11 bit times (if M = 0, SBNS = 0) or 12 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 14 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 15 (if M10 = 1, SNBS = 1).

#define  UART0_S2_BRK13_MASK         0x4u
#define  UART0_S2_BRK13_SHIFT        2
//   Break Character Generation Length
//     0b0 ==> Break character is transmitted with length of 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
//     0b1 ==> Break character is transmitted with length of 13 bit times (if M = 0, SBNS = 0) or 14 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 15 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 16 (if M10 = 1, SNBS = 1).

#define  UART0_S2_RWUID_MASK         0x8u
#define  UART0_S2_RWUID_SHIFT        3
//   Receive Wake Up Idle Detect
//     0b0 ==> During receive standby state (RWU = 1), the IDLE bit does not get set upon detection of an idle character.
//     0b1 ==> During receive standby state (RWU = 1), the IDLE bit gets set upon detection of an idle character.

#define  UART0_S2_RXINV_MASK         0x10u
#define  UART0_S2_RXINV_SHIFT        4
//   Receive Data Inversion
//     0b0 ==> Receive data not inverted.
//     0b1 ==> Receive data inverted.

#define  UART0_S2_MSBF_MASK          0x20u
#define  UART0_S2_MSBF_SHIFT         5
//   MSB First
//     0b0 ==> LSB (bit0) is the first bit that is transmitted following the start bit. Further, the first bit received after the start bit is identified as bit0.
//     0b1 ==> MSB (bit9, bit8, bit7 or bit6) is the first bit that is transmitted following the start bit depending on the setting of C1[M], C1[PE] and C4[M10]. Further, the first bit received after the start bit is identified as bit9, bit8, bit7 or bit6 depending on the setting of C1[M] and C1[PE].

#define  UART0_S2_RXEDGIF_MASK       0x40u
#define  UART0_S2_RXEDGIF_SHIFT      6
//   UART_RX Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  UART0_S2_LBKDIF_MASK        0x80u
#define  UART0_S2_LBKDIF_SHIFT       7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character has been detected.
//     0b1 ==> LIN break character has been detected.

#define  UART0_C3_PEIE_MASK          0x1u
#define  UART0_C3_PEIE_SHIFT         0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when PF is set.

#define  UART0_C3_FEIE_MASK          0x2u
#define  UART0_C3_FEIE_SHIFT         1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when FE is set.

#define  UART0_C3_NEIE_MASK          0x4u
#define  UART0_C3_NEIE_SHIFT         2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when NF is set.

#define  UART0_C3_ORIE_MASK          0x8u
#define  UART0_C3_ORIE_SHIFT         3
//   Overrun Interrupt Enable
//     0b0 ==> OR interrupts disabled; use polling.
//     0b1 ==> Hardware interrupt requested when OR is set.

#define  UART0_C3_TXINV_MASK         0x10u
#define  UART0_C3_TXINV_SHIFT        4
//   Transmit Data Inversion
//     0b0 ==> Transmit data not inverted.
//     0b1 ==> Transmit data inverted.

#define  UART0_C3_TXDIR_MASK         0x20u
#define  UART0_C3_TXDIR_SHIFT        5
//   UART_TX Pin Direction in Single-Wire Mode
//     0b0 ==> UART_TXD pin is an input in single-wire mode.
//     0b1 ==> UART_TXD pin is an output in single-wire mode.

#define  UART0_C3_R9T8_MASK          0x40u
#define  UART0_C3_R9T8_SHIFT         6
//   Receive Bit 9 / Transmit Bit 8

#define  UART0_C3_R8T9_MASK          0x80u
#define  UART0_C3_R8T9_SHIFT         7
//   Receive Bit 8 / Transmit Bit 9

#define  UART0_D_R0T0_MASK           0x1u
#define  UART0_D_R0T0_SHIFT          0

#define  UART0_D_R1T1_MASK           0x2u
#define  UART0_D_R1T1_SHIFT          1

#define  UART0_D_R2T2_MASK           0x4u
#define  UART0_D_R2T2_SHIFT          2

#define  UART0_D_R3T3_MASK           0x8u
#define  UART0_D_R3T3_SHIFT          3

#define  UART0_D_R4T4_MASK           0x10u
#define  UART0_D_R4T4_SHIFT          4

#define  UART0_D_R5T5_MASK           0x20u
#define  UART0_D_R5T5_SHIFT          5

#define  UART0_D_R6T6_MASK           0x40u
#define  UART0_D_R6T6_SHIFT          6

#define  UART0_D_R7T7_MASK           0x80u
#define  UART0_D_R7T7_SHIFT          7

#define  UART0_MA1_MA_MASK           0xFFu
#define  UART0_MA1_MA_SHIFT          0
#define  UART0_MA1_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART0_MA1_MA_SHIFT))&UART0_MA1_MA_MASK)
//   Match Address

#define  UART0_MA2_MA_MASK           0xFFu
#define  UART0_MA2_MA_SHIFT          0
#define  UART0_MA2_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART0_MA2_MA_SHIFT))&UART0_MA2_MA_MASK)
//   Match Address

#define  UART0_C4_OSR_MASK           0x1Fu
#define  UART0_C4_OSR_SHIFT          0
#define  UART0_C4_OSR(x)             (((uint8_t)(((uint8_t)(x))<<UART0_C4_OSR_SHIFT))&UART0_C4_OSR_MASK)
//   Over Sampling Ratio

#define  UART0_C4_M10_MASK           0x20u
#define  UART0_C4_M10_SHIFT          5
//   10-bit Mode select
//     0b0 ==> Receiver and transmitter use 8-bit or 9-bit data characters.
//     0b1 ==> Receiver and transmitter use 10-bit data characters.

#define  UART0_C4_MAEN2_MASK         0x40u
#define  UART0_C4_MAEN2_SHIFT        6
//   Match Address Mode Enable 2
//     0b0 ==> All data received is transferred to the data buffer if MAEN1 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA2 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer.

#define  UART0_C4_MAEN1_MASK         0x80u
#define  UART0_C4_MAEN1_SHIFT        7
//   Match Address Mode Enable 1
//     0b0 ==> All data received is transferred to the data buffer if MAEN2 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA1 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer.

#define  UART0_C5_RESYNCDIS_MASK     0x1u
#define  UART0_C5_RESYNCDIS_SHIFT    0
//   Resynchronization Disable
//     0b0 ==> Resynchronization during received data word is supported
//     0b1 ==> Resynchronization during received data word is disabled

#define  UART0_C5_BOTHEDGE_MASK      0x2u
#define  UART0_C5_BOTHEDGE_SHIFT     1
//   Both Edge Sampling
//     0b0 ==> Receiver samples input data using the rising edge of the baud rate clock.
//     0b1 ==> Receiver samples input data using the rising and falling edge of the baud rate clock.

