ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  UART1_S2_RWUID_MASK         0x8u
#define  UART1_S2_RWUID_SHIFT        3
//   Receive Wake Up Idle Detect
//     0b0 ==> During receive standby state (RWU = 1), the IDLE bit does not get set upon detection of an idle character.
//     0b1 ==> During receive standby state (RWU = 1), the IDLE bit gets set upon detection of an idle character.

#define  UART1_S2_RXINV_MASK         0x10u
#define  UART1_S2_RXINV_SHIFT        4
//   Receive Data Inversion
//     0b0 ==> Receive data not inverted.
//     0b1 ==> Receive data inverted.

#define  UART1_S2_RXEDGIF_MASK       0x40u
#define  UART1_S2_RXEDGIF_SHIFT      6
//   RxD Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  UART1_S2_LBKDIF_MASK        0x80u
#define  UART1_S2_LBKDIF_SHIFT       7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character has been detected.
//     0b1 ==> LIN break character has been detected.

#define  UART1_C3_PEIE_MASK          0x1u
#define  UART1_C3_PEIE_SHIFT         0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when PF is set.

#define  UART1_C3_FEIE_MASK          0x2u
#define  UART1_C3_FEIE_SHIFT         1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when FE is set.

#define  UART1_C3_NEIE_MASK          0x4u
#define  UART1_C3_NEIE_SHIFT         2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when NF is set.

#define  UART1_C3_ORIE_MASK          0x8u
#define  UART1_C3_ORIE_SHIFT         3
//   Overrun Interrupt Enable
//     0b0 ==> OR interrupts disabled; use polling.
//     0b1 ==> Hardware interrupt requested when OR is set.

#define  UART1_C3_TXINV_MASK         0x10u
#define  UART1_C3_TXINV_SHIFT        4
//   Transmit Data Inversion
//     0b0 ==> Transmit data not inverted.
//     0b1 ==> Transmit data inverted.

#define  UART1_C3_TXDIR_MASK         0x20u
#define  UART1_C3_TXDIR_SHIFT        5
//   TxD Pin Direction in Single-Wire Mode
//     0b0 ==> TxD pin is an input in single-wire mode.
//     0b1 ==> TxD pin is an output in single-wire mode.

#define  UART1_C3_T8_MASK            0x40u
#define  UART1_C3_T8_SHIFT           6
//   Ninth Data Bit for Transmitter

#define  UART1_C3_R8_MASK            0x80u
#define  UART1_C3_R8_SHIFT           7
//   Ninth Data Bit for Receiver

#define  UART1_D_R0T0_MASK           0x1u
#define  UART1_D_R0T0_SHIFT          0

#define  UART1_D_R1T1_MASK           0x2u
#define  UART1_D_R1T1_SHIFT          1

#define  UART1_D_R2T2_MASK           0x4u
#define  UART1_D_R2T2_SHIFT          2

#define  UART1_D_R3T3_MASK           0x8u
#define  UART1_D_R3T3_SHIFT          3

#define  UART1_D_R4T4_MASK           0x10u
#define  UART1_D_R4T4_SHIFT          4

#define  UART1_D_R5T5_MASK           0x20u
#define  UART1_D_R5T5_SHIFT          5

#define  UART1_D_R6T6_MASK           0x40u
#define  UART1_D_R6T6_SHIFT          6

#define  UART1_D_R7T7_MASK           0x80u
#define  UART1_D_R7T7_SHIFT          7

#define  UART1_C4_LBKDDMAS_MASK      0x8u
#define  UART1_C4_LBKDDMAS_SHIFT     3
//   LIN Break Detect DMA Select Bit
//     0b0 ==> If LBKDIE is set and the LBKDIF flag is set, the LBKDIF interrupt signal is asserted to request interrupt service.
//     0b1 ==> If LBKDIE is set and the LBKDIF flag is set, the LBKDIF DMA request signal is asserted to request a DMA transfer.

#define  UART1_C4_ILDMAS_MASK        0x10u
#define  UART1_C4_ILDMAS_SHIFT       4
//   Idle Line DMA Select
//     0b0 ==> If ILIE is set and the IDLE flag is set, the IDLE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If ILIE is set and the IDLE flag is set, the IDLE DMA request signal is asserted to request a DMA transfer.

#define  UART1_C4_RDMAS_MASK         0x20u
#define  UART1_C4_RDMAS_SHIFT        5
//   Receiver Full DMA Select
//     0b0 ==> If RIE is set and the RDRF flag is set, the RDRF interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If RIE is set and the RDRF flag is set, the RDRF DMA request signal is asserted to request a DMA transfer.

#define  UART1_C4_TCDMAS_MASK        0x40u
#define  UART1_C4_TCDMAS_SHIFT       6
//   Transmission Complete DMA Select
//     0b0 ==> If TCIE is set and the TC flag is set, the TC interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If TCIE is set and the TC flag is set, the TC DMA request signal is asserted to request a DMA transfer.

#define  UART1_C4_TDMAS_MASK         0x80u
#define  UART1_C4_TDMAS_SHIFT        7
//   Transmitter DMA Select
//     0b0 ==> If TIE is set and the TDRE flag is set, the TDRE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If TIE is set and the TDRE flag is set, the TDRE DMA request signal is asserted to request a DMA transfer.

#define  UART2_BDH_SBR_MASK          0x1Fu
#define  UART2_BDH_SBR_SHIFT         0
#define  UART2_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART2_BDH_SBR_SHIFT))&UART2_BDH_SBR_MASK)
//   Baud Rate Modulo Divisor.

#define  UART2_BDH_SBNS_MASK         0x20u
#define  UART2_BDH_SBNS_SHIFT        5
//   Stop Bit Number Select
//     0b0 ==> One stop bit.
//     0b1 ==> Two stop bit.

#define  UART2_BDH_RXEDGIE_MASK      0x40u
#define  UART2_BDH_RXEDGIE_SHIFT     6
//   RxD Input Active Edge Interrupt Enable (for RXEDGIF)
//     0b0 ==> Hardware interrupts from UART_S2[RXEDGIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when UART_S2[RXEDGIF] flag is 1.

#define  UART2_BDH_LBKDIE_MASK       0x80u
#define  UART2_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable (for LBKDIF)
//     0b0 ==> Hardware interrupts from UART_S2[LBKDIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when UART_S2[LBKDIF] flag is 1.

#define  UART2_BDL_SBR_MASK          0xFFu
#define  UART2_BDL_SBR_SHIFT         0
#define  UART2_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART2_BDL_SBR_SHIFT))&UART2_BDL_SBR_MASK)
//   Baud Rate Modulo Divisor

#define  UART2_C1_PT_MASK            0x1u
#define  UART2_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART2_C1_PE_MASK            0x2u
#define  UART2_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> No hardware parity generation or checking.
//     0b1 ==> Parity enabled.

#define  UART2_C1_ILT_MASK           0x4u
#define  UART2_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

