ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  UART2_C1_WAKE_MASK          0x8u
#define  UART2_C1_WAKE_SHIFT         3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle-line wakeup.
//     0b1 ==> Address-mark wakeup.

#define  UART2_C1_M_MASK             0x10u
#define  UART2_C1_M_SHIFT            4
//   9-Bit or 8-Bit Mode Select
//     0b0 ==> Normal - start + 8 data bits (lsb first) + stop.
//     0b1 ==> Receiver and transmitter use 9-bit data characters start + 8 data bits (lsb first) + 9th data bit + stop.

#define  UART2_C1_RSRC_MASK          0x20u
#define  UART2_C1_RSRC_SHIFT         5
//   Receiver Source Select
//     0b0 ==> Provided LOOPS is set, RSRC is cleared, selects internal loop back mode and the UART does not use the RxD pins.
//     0b1 ==> Single-wire UART mode where the TxD pin is connected to the transmitter output and receiver input.

#define  UART2_C1_SCISWAI_MASK       0x40u
#define  UART2_C1_SCISWAI_SHIFT      6
//   UART Stops in Wait Mode
//     0b0 ==> UART clocks continue to run in wait mode so the UART can be the source of an interrupt that wakes up the CPU.
//     0b1 ==> UART clocks freeze while CPU is in wait mode.

#define  UART2_C1_LOOPS_MASK         0x80u
#define  UART2_C1_LOOPS_SHIFT        7
//   Loop Mode Select
//     0b0 ==> Normal operation - RxD and TxD use separate pins.
//     0b1 ==> Loop mode or single-wire mode where transmitter outputs are internally connected to receiver input. (See RSRC bit.) RxD pin is not used by UART.

#define  UART2_C2_SBK_MASK           0x1u
#define  UART2_C2_SBK_SHIFT          0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break character(s) to be sent.

#define  UART2_C2_RWU_MASK           0x2u
#define  UART2_C2_RWU_SHIFT          1
//   Receiver Wakeup Control
//     0b0 ==> Normal UART receiver operation.
//     0b1 ==> UART receiver in standby waiting for wakeup condition.

#define  UART2_C2_RE_MASK            0x4u
#define  UART2_C2_RE_SHIFT           2
//   Receiver Enable
//     0b0 ==> Receiver off.
//     0b1 ==> Receiver on.

#define  UART2_C2_TE_MASK            0x8u
#define  UART2_C2_TE_SHIFT           3
//   Transmitter Enable
//     0b0 ==> Transmitter off.
//     0b1 ==> Transmitter on.

#define  UART2_C2_ILIE_MASK          0x10u
#define  UART2_C2_ILIE_SHIFT         4
//   Idle Line Interrupt Enable for IDLE
//     0b0 ==> Hardware interrupts from IDLE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when IDLE flag is 1.

#define  UART2_C2_RIE_MASK           0x20u
#define  UART2_C2_RIE_SHIFT          5
//   Receiver Interrupt Enable for RDRF
//     0b0 ==> Hardware interrupts from RDRF disabled; use polling.
//     0b1 ==> Hardware interrupt requested when RDRF flag is 1.

#define  UART2_C2_TCIE_MASK          0x40u
#define  UART2_C2_TCIE_SHIFT         6
//   Transmission Complete Interrupt Enable for TC
//     0b0 ==> Hardware interrupts from TC disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TC flag is 1.

#define  UART2_C2_TIE_MASK           0x80u
#define  UART2_C2_TIE_SHIFT          7
//   Transmit Interrupt Enable for TDRE
//     0b0 ==> Hardware interrupts from TDRE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TDRE flag is 1.

#define  UART2_S1_PF_MASK            0x1u
#define  UART2_S1_PF_SHIFT           0
//   Parity Error Flag
//     0b0 ==> No parity error.
//     0b1 ==> Parity error.

#define  UART2_S1_FE_MASK            0x2u
#define  UART2_S1_FE_SHIFT           1
//   Framing Error Flag
//     0b0 ==> No framing error detected. This does not guarantee the framing is correct.
//     0b1 ==> Framing error.

#define  UART2_S1_NF_MASK            0x4u
#define  UART2_S1_NF_SHIFT           2
//   Noise Flag
//     0b0 ==> No noise detected.
//     0b1 ==> Noise detected in the received character in UART_D.

#define  UART2_S1_OR_MASK            0x8u
#define  UART2_S1_OR_SHIFT           3
//   Receiver Overrun Flag
//     0b0 ==> No overrun.
//     0b1 ==> Receive overrun (new UART data lost).

#define  UART2_S1_IDLE_MASK          0x10u
#define  UART2_S1_IDLE_SHIFT         4
//   Idle Line Flag
//     0b0 ==> No idle line detected.
//     0b1 ==> Idle line was detected.

#define  UART2_S1_RDRF_MASK          0x20u
#define  UART2_S1_RDRF_SHIFT         5
//   Receive Data Register Full Flag
//     0b0 ==> Receive data register empty.
//     0b1 ==> Receive data register full.

#define  UART2_S1_TC_MASK            0x40u
#define  UART2_S1_TC_SHIFT           6
//   Transmission Complete Flag
//     0b0 ==> Transmitter active (sending data, a preamble, or a break).
//     0b1 ==> Transmitter idle (transmission activity complete).

#define  UART2_S1_TDRE_MASK          0x80u
#define  UART2_S1_TDRE_SHIFT         7
//   Transmit Data Register Empty Flag
//     0b0 ==> Transmit data register (buffer) full.
//     0b1 ==> Transmit data register (buffer) empty.

#define  UART2_S2_RAF_MASK           0x1u
#define  UART2_S2_RAF_SHIFT          0
//   Receiver Active Flag
//     0b0 ==> UART receiver idle waiting for a start bit.
//     0b1 ==> UART receiver active (RxD input not idle).

#define  UART2_S2_LBKDE_MASK         0x2u
#define  UART2_S2_LBKDE_SHIFT        1
//   LIN Break Detection Enable
//     0b0 ==> Break character is detected at length 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1).
//     0b1 ==> Break character is detected at length of 11 bit times (if M = 0, SBNS = 0) or 12 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 13 (if M = 1, SBNS = 1).

#define  UART2_S2_BRK13_MASK         0x4u
#define  UART2_S2_BRK13_SHIFT        2
//   Break Character Generation Length
//     0b0 ==> Break character is transmitted with length of 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1).
//     0b1 ==> Break character is transmitted with length of 13 bit times (if M = 0, SBNS = 0) or 14 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 15 (if M = 1, SBNS = 1).

#define  UART2_S2_RWUID_MASK         0x8u
#define  UART2_S2_RWUID_SHIFT        3
//   Receive Wake Up Idle Detect
//     0b0 ==> During receive standby state (RWU = 1), the IDLE bit does not get set upon detection of an idle character.
//     0b1 ==> During receive standby state (RWU = 1), the IDLE bit gets set upon detection of an idle character.

#define  UART2_S2_RXINV_MASK         0x10u
#define  UART2_S2_RXINV_SHIFT        4
//   Receive Data Inversion
//     0b0 ==> Receive data not inverted.
//     0b1 ==> Receive data inverted.

#define  UART2_S2_RXEDGIF_MASK       0x40u
#define  UART2_S2_RXEDGIF_SHIFT      6
//   RxD Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  UART2_S2_LBKDIF_MASK        0x80u
#define  UART2_S2_LBKDIF_SHIFT       7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character has been detected.
//     0b1 ==> LIN break character has been detected.

#define  UART2_C3_PEIE_MASK          0x1u
#define  UART2_C3_PEIE_SHIFT         0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when PF is set.

#define  UART2_C3_FEIE_MASK          0x2u
#define  UART2_C3_FEIE_SHIFT         1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when FE is set.

#define  UART2_C3_NEIE_MASK          0x4u
#define  UART2_C3_NEIE_SHIFT         2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when NF is set.

#define  UART2_C3_ORIE_MASK          0x8u
#define  UART2_C3_ORIE_SHIFT         3
//   Overrun Interrupt Enable
//     0b0 ==> OR interrupts disabled; use polling.
//     0b1 ==> Hardware interrupt requested when OR is set.

