ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  UART2_C3_TXINV_MASK         0x10u
#define  UART2_C3_TXINV_SHIFT        4
//   Transmit Data Inversion
//     0b0 ==> Transmit data not inverted.
//     0b1 ==> Transmit data inverted.

#define  UART2_C3_TXDIR_MASK         0x20u
#define  UART2_C3_TXDIR_SHIFT        5
//   TxD Pin Direction in Single-Wire Mode
//     0b0 ==> TxD pin is an input in single-wire mode.
//     0b1 ==> TxD pin is an output in single-wire mode.

#define  UART2_C3_T8_MASK            0x40u
#define  UART2_C3_T8_SHIFT           6
//   Ninth Data Bit for Transmitter

#define  UART2_C3_R8_MASK            0x80u
#define  UART2_C3_R8_SHIFT           7
//   Ninth Data Bit for Receiver

#define  UART2_D_R0T0_MASK           0x1u
#define  UART2_D_R0T0_SHIFT          0

#define  UART2_D_R1T1_MASK           0x2u
#define  UART2_D_R1T1_SHIFT          1

#define  UART2_D_R2T2_MASK           0x4u
#define  UART2_D_R2T2_SHIFT          2

#define  UART2_D_R3T3_MASK           0x8u
#define  UART2_D_R3T3_SHIFT          3

#define  UART2_D_R4T4_MASK           0x10u
#define  UART2_D_R4T4_SHIFT          4

#define  UART2_D_R5T5_MASK           0x20u
#define  UART2_D_R5T5_SHIFT          5

#define  UART2_D_R6T6_MASK           0x40u
#define  UART2_D_R6T6_SHIFT          6

#define  UART2_D_R7T7_MASK           0x80u
#define  UART2_D_R7T7_SHIFT          7

#define  UART2_C4_LBKDDMAS_MASK      0x8u
#define  UART2_C4_LBKDDMAS_SHIFT     3
//   LIN Break Detect DMA Select Bit
//     0b0 ==> If LBKDIE is set and the LBKDIF flag is set, the LBKDIF interrupt signal is asserted to request interrupt service.
//     0b1 ==> If LBKDIE is set and the LBKDIF flag is set, the LBKDIF DMA request signal is asserted to request a DMA transfer.

#define  UART2_C4_ILDMAS_MASK        0x10u
#define  UART2_C4_ILDMAS_SHIFT       4
//   Idle Line DMA Select
//     0b0 ==> If ILIE is set and the IDLE flag is set, the IDLE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If ILIE is set and the IDLE flag is set, the IDLE DMA request signal is asserted to request a DMA transfer.

#define  UART2_C4_RDMAS_MASK         0x20u
#define  UART2_C4_RDMAS_SHIFT        5
//   Receiver Full DMA Select
//     0b0 ==> If RIE is set and the RDRF flag is set, the RDRF interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If RIE is set and the RDRF flag is set, the RDRF DMA request signal is asserted to request a DMA transfer.

#define  UART2_C4_TCDMAS_MASK        0x40u
#define  UART2_C4_TCDMAS_SHIFT       6
//   Transmission Complete DMA Select
//     0b0 ==> If TCIE is set and the TC flag is set, the TC interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If TCIE is set and the TC flag is set, the TC DMA request signal is asserted to request a DMA transfer.

#define  UART2_C4_TDMAS_MASK         0x80u
#define  UART2_C4_TDMAS_SHIFT        7
//   Transmitter DMA Select
//     0b0 ==> If TIE is set and the TDRE flag is set, the TDRE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If TIE is set and the TDRE flag is set, the TDRE DMA request signal is asserted to request a DMA transfer.
*/
#define  USB0_PERID_ID_MASK          0x3Fu
#define  USB0_PERID_ID_SHIFT         0
#define  USB0_PERID_ID(x)            (((uint8_t)(((uint8_t)(x))<<USB0_PERID_ID_SHIFT))&USB0_PERID_ID_MASK)
//   Peripheral Identification

#define  USB0_IDCOMP_NID_MASK        0x3Fu
#define  USB0_IDCOMP_NID_SHIFT       0
#define  USB0_IDCOMP_NID(x)          (((uint8_t)(((uint8_t)(x))<<USB0_IDCOMP_NID_SHIFT))&USB0_IDCOMP_NID_MASK)

#define  USB0_REV_REV_MASK           0xFFu
#define  USB0_REV_REV_SHIFT          0
#define  USB0_REV_REV(x)             (((uint8_t)(((uint8_t)(x))<<USB0_REV_REV_SHIFT))&USB0_REV_REV_MASK)
//   Revision

#define  USB0_ADDINFO_IEHOST_MASK    0x1u
#define  USB0_ADDINFO_IEHOST_SHIFT   0

#define  USB0_ADDINFO_IRQNUM_MASK    0xF8u
#define  USB0_ADDINFO_IRQNUM_SHIFT   3
#define  USB0_ADDINFO_IRQNUM(x)      (((uint8_t)(((uint8_t)(x))<<USB0_ADDINFO_IRQNUM_SHIFT))&USB0_ADDINFO_IRQNUM_MASK)
//   Assigned Interrupt Request Number

#define  USB0_OTGISTAT_AVBUSCHG_MASK 0x1u
#define  USB0_OTGISTAT_AVBUSCHG_SHIFT 0

#define  USB0_OTGISTAT_B_SESS_CHG_MASK 0x4u
#define  USB0_OTGISTAT_B_SESS_CHG_SHIFT 2

#define  USB0_OTGISTAT_SESSVLDCHG_MASK 0x8u
#define  USB0_OTGISTAT_SESSVLDCHG_SHIFT 3

#define  USB0_OTGISTAT_LINE_STATE_CHG_MASK 0x20u
#define  USB0_OTGISTAT_LINE_STATE_CHG_SHIFT 5

#define  USB0_OTGISTAT_ONEMSEC_MASK  0x40u
#define  USB0_OTGISTAT_ONEMSEC_SHIFT 6

#define  USB0_OTGISTAT_IDCHG_MASK    0x80u
#define  USB0_OTGISTAT_IDCHG_SHIFT   7

#define  USB0_OTGICR_AVBUSEN_MASK    0x1u
#define  USB0_OTGICR_AVBUSEN_SHIFT   0
//   A VBUS Valid Interrupt Enable
//     0b0 ==> Disables the AVBUSCHG interrupt.
//     0b1 ==> Enables the AVBUSCHG interrupt.

#define  USB0_OTGICR_BSESSEN_MASK    0x4u
#define  USB0_OTGICR_BSESSEN_SHIFT   2
//   B Session END Interrupt Enable
//     0b0 ==> Disables the B_SESS_CHG interrupt.
//     0b1 ==> Enables the B_SESS_CHG interrupt.

#define  USB0_OTGICR_SESSVLDEN_MASK  0x8u
#define  USB0_OTGICR_SESSVLDEN_SHIFT 3
//   Session Valid Interrupt Enable
//     0b0 ==> Disables the SESSVLDCHG interrupt.
//     0b1 ==> Enables the SESSVLDCHG interrupt.

#define  USB0_OTGICR_LINESTATEEN_MASK 0x20u
#define  USB0_OTGICR_LINESTATEEN_SHIFT 5
//   Line State Change Interrupt Enable
//     0b0 ==> Disables the LINE_STAT_CHG interrupt.
//     0b1 ==> Enables the LINE_STAT_CHG interrupt.

#define  USB0_OTGICR_ONEMSECEN_MASK  0x40u
#define  USB0_OTGICR_ONEMSECEN_SHIFT 6
//   One Millisecond Interrupt Enable
//     0b0 ==> Diables the 1ms timer interrupt.
//     0b1 ==> Enables the 1ms timer interrupt.

#define  USB0_OTGICR_IDEN_MASK       0x80u
#define  USB0_OTGICR_IDEN_SHIFT      7
//   ID Interrupt Enable
//     0b0 ==> The ID interrupt is disabled
//     0b1 ==> The ID interrupt is enabled

#define  USB0_OTGSTAT_AVBUSVLD_MASK  0x1u
#define  USB0_OTGSTAT_AVBUSVLD_SHIFT 0
//   A VBUS Valid
//     0b0 ==> The VBUS voltage is below the A VBUS Valid threshold.
//     0b1 ==> The VBUS voltage is above the A VBUS Valid threshold.

#define  USB0_OTGSTAT_BSESSEND_MASK  0x4u
#define  USB0_OTGSTAT_BSESSEND_SHIFT 2
//   B Session End
//     0b0 ==> The VBUS voltage is above the B session end threshold.
//     0b1 ==> The VBUS voltage is below the B session end threshold.

#define  USB0_OTGSTAT_SESS_VLD_MASK  0x8u
#define  USB0_OTGSTAT_SESS_VLD_SHIFT 3
//   Session Valid
//     0b0 ==> The VBUS voltage is below the B session valid threshold
//     0b1 ==> The VBUS voltage is above the B session valid threshold.

#define  USB0_OTGSTAT_LINESTATESTABLE_MASK 0x20u
#define  USB0_OTGSTAT_LINESTATESTABLE_SHIFT 5
//     0b0 ==> The LINE_STAT_CHG bit is not yet stable.
//     0b1 ==> The LINE_STAT_CHG bit has been debounced and is stable.

#define  USB0_OTGSTAT_ONEMSECEN_MASK 0x40u
#define  USB0_OTGSTAT_ONEMSECEN_SHIFT 6

#define  USB0_OTGSTAT_ID_MASK        0x80u
#define  USB0_OTGSTAT_ID_SHIFT       7
//     0b0 ==> Indicates a Type A cable is plugged into the USB connector.
//     0b1 ==> Indicates no cable is attached or a Type B cable is plugged into the USB connector.

