ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  USB0_OTGCTL_OTGEN_MASK      0x4u
#define  USB0_OTGCTL_OTGEN_SHIFT     2
//   On-The-Go pullup/pulldown resistor enable
//     0b0 ==> If USB_EN is 1 and HOST_MODE is 0 in the Control Register (CTL), then the D+ Data Line pull-up resistors are enabled. If HOST_MODE is 1 the D+ and D- Data Line pull-down resistors are engaged.
//     0b1 ==> The pull-up and pull-down controls in this register are used.

#define  USB0_OTGCTL_DMLOW_MASK      0x10u
#define  USB0_OTGCTL_DMLOW_SHIFT     4
//   D- Data Line pull-down resistor enable
//     0b0 ==> D- pulldown resistor is not enabled.
//     0b1 ==> D- pulldown resistor is enabled.

#define  USB0_OTGCTL_DPLOW_MASK      0x20u
#define  USB0_OTGCTL_DPLOW_SHIFT     5
//   D+ Data Line pull-down resistor enable
//     0b0 ==> D+ pulldown resistor is not enabled.
//     0b1 ==> D+ pulldown resistor is enabled.

#define  USB0_OTGCTL_DPHIGH_MASK     0x80u
#define  USB0_OTGCTL_DPHIGH_SHIFT    7
//   D+ Data Line pullup resistor enable
//     0b0 ==> D+ pullup resistor is not enabled
//     0b1 ==> D+ pullup resistor is enabled

#define  USB0_ISTAT_USBRST_MASK      0x1u
#define  USB0_ISTAT_USBRST_SHIFT     0

#define  USB0_ISTAT_ERROR_MASK       0x2u
#define  USB0_ISTAT_ERROR_SHIFT      1

#define  USB0_ISTAT_SOFTOK_MASK      0x4u
#define  USB0_ISTAT_SOFTOK_SHIFT     2

#define  USB0_ISTAT_TOKDNE_MASK      0x8u
#define  USB0_ISTAT_TOKDNE_SHIFT     3

#define  USB0_ISTAT_SLEEP_MASK       0x10u
#define  USB0_ISTAT_SLEEP_SHIFT      4

#define  USB0_ISTAT_RESUME_MASK      0x20u
#define  USB0_ISTAT_RESUME_SHIFT     5

#define  USB0_ISTAT_ATTACH_MASK      0x40u
#define  USB0_ISTAT_ATTACH_SHIFT     6
//   Attach Interrupt

#define  USB0_ISTAT_STALL_MASK       0x80u
#define  USB0_ISTAT_STALL_SHIFT      7
//   Stall Interrupt

#define  USB0_INTEN_USBRSTEN_MASK    0x1u
#define  USB0_INTEN_USBRSTEN_SHIFT   0
//   USBRST Interrupt Enable
//     0b0 ==> Disables the USBRST interrupt.
//     0b1 ==> Enables the USBRST interrupt.

#define  USB0_INTEN_ERROREN_MASK     0x2u
#define  USB0_INTEN_ERROREN_SHIFT    1
//   ERROR Interrupt Enable
//     0b0 ==> Disables the ERROR interrupt.
//     0b1 ==> Enables the ERROR interrupt.

#define  USB0_INTEN_SOFTOKEN_MASK    0x4u
#define  USB0_INTEN_SOFTOKEN_SHIFT   2
//   SOFTOK Interrupt Enable
//     0b0 ==> Disbles the SOFTOK interrupt.
//     0b1 ==> Enables the SOFTOK interrupt.

#define  USB0_INTEN_TOKDNEEN_MASK    0x8u
#define  USB0_INTEN_TOKDNEEN_SHIFT   3
//   TOKDNE Interrupt Enable
//     0b0 ==> Disables the TOKDNE interrupt.
//     0b1 ==> Enables the TOKDNE interrupt.

#define  USB0_INTEN_SLEEPEN_MASK     0x10u
#define  USB0_INTEN_SLEEPEN_SHIFT    4
//   SLEEP Interrupt Enable
//     0b0 ==> Disables the SLEEP interrupt.
//     0b1 ==> Enables the SLEEP interrupt.

#define  USB0_INTEN_RESUMEEN_MASK    0x20u
#define  USB0_INTEN_RESUMEEN_SHIFT   5
//   RESUME Interrupt Enable
//     0b0 ==> Disables the RESUME interrupt.
//     0b1 ==> Enables the RESUME interrupt.

#define  USB0_INTEN_ATTACHEN_MASK    0x40u
#define  USB0_INTEN_ATTACHEN_SHIFT   6
//   ATTACH Interrupt Enable
//     0b0 ==> Disables the ATTACH interrupt.
//     0b1 ==> Enables the ATTACH interrupt.

#define  USB0_INTEN_STALLEN_MASK     0x80u
#define  USB0_INTEN_STALLEN_SHIFT    7
//   STALL Interrupt Enable
//     0b0 ==> Diasbles the STALL interrupt.
//     0b1 ==> Enables the STALL interrupt.

#define  USB0_ERRSTAT_PIDERR_MASK    0x1u
#define  USB0_ERRSTAT_PIDERR_SHIFT   0

#define  USB0_ERRSTAT_CRC5EOF_MASK   0x2u
#define  USB0_ERRSTAT_CRC5EOF_SHIFT  1

#define  USB0_ERRSTAT_CRC16_MASK     0x4u
#define  USB0_ERRSTAT_CRC16_SHIFT    2

#define  USB0_ERRSTAT_DFN8_MASK      0x8u
#define  USB0_ERRSTAT_DFN8_SHIFT     3

#define  USB0_ERRSTAT_BTOERR_MASK    0x10u
#define  USB0_ERRSTAT_BTOERR_SHIFT   4

#define  USB0_ERRSTAT_DMAERR_MASK    0x20u
#define  USB0_ERRSTAT_DMAERR_SHIFT   5

#define  USB0_ERRSTAT_BTSERR_MASK    0x80u
#define  USB0_ERRSTAT_BTSERR_SHIFT   7

#define  USB0_ERREN_PIDERREN_MASK    0x1u
#define  USB0_ERREN_PIDERREN_SHIFT   0
//   PIDERR Interrupt Enable
//     0b0 ==> Disables the PIDERR interrupt.
//     0b1 ==> Enters the PIDERR interrupt.

#define  USB0_ERREN_CRC5EOFEN_MASK   0x2u
#define  USB0_ERREN_CRC5EOFEN_SHIFT  1
//   CRC5/EOF Interrupt Enable
//     0b0 ==> Disables the CRC5/EOF interrupt.
//     0b1 ==> Enables the CRC5/EOF interrupt.

#define  USB0_ERREN_CRC16EN_MASK     0x4u
#define  USB0_ERREN_CRC16EN_SHIFT    2
//   CRC16 Interrupt Enable
//     0b0 ==> Disables the CRC16 interrupt.
//     0b1 ==> Enables the CRC16 interrupt.

#define  USB0_ERREN_DFN8EN_MASK      0x8u
#define  USB0_ERREN_DFN8EN_SHIFT     3
//   DFN8 Interrupt Enable
//     0b0 ==> Disables the DFN8 interrupt.
//     0b1 ==> Enables the DFN8 interrupt.

#define  USB0_ERREN_BTOERREN_MASK    0x10u
#define  USB0_ERREN_BTOERREN_SHIFT   4
//   BTOERR Interrupt Enable
//     0b0 ==> Disables the BTOERR interrupt.
//     0b1 ==> Enables the BTOERR interrupt.

#define  USB0_ERREN_DMAERREN_MASK    0x20u
#define  USB0_ERREN_DMAERREN_SHIFT   5
//   DMAERR Interrupt Enable
//     0b0 ==> Disables the DMAERR interrupt.
//     0b1 ==> Enables the DMAERR interrupt.

#define  USB0_ERREN_BTSERREN_MASK    0x80u
#define  USB0_ERREN_BTSERREN_SHIFT   7
//   BTSERR Interrupt Enable
//     0b0 ==> Disables the BTSERR interrupt.
//     0b1 ==> Enables the BTSERR interrupt.

#define  USB0_STAT_ODD_MASK          0x4u
#define  USB0_STAT_ODD_SHIFT         2

#define  USB0_STAT_TX_MASK           0x8u
#define  USB0_STAT_TX_SHIFT          3
//   Transmit Indicator
//     0b0 ==> The most recent transaction was a receive operation.
//     0b1 ==> The most recent transaction was a transmit operation.

#define  USB0_STAT_ENDP_MASK         0xF0u
#define  USB0_STAT_ENDP_SHIFT        4
#define  USB0_STAT_ENDP(x)           (((uint8_t)(((uint8_t)(x))<<USB0_STAT_ENDP_SHIFT))&USB0_STAT_ENDP_MASK)

#define  USB0_CTL_USBENSOFEN_MASK    0x1u
#define  USB0_CTL_USBENSOFEN_SHIFT   0
//   USB Enable
//     0b0 ==> Disables the USB Module.
//     0b1 ==> Enables the USB Module.

