ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  USB0_CTL_ODDRST_MASK        0x2u
#define  USB0_CTL_ODDRST_SHIFT       1

#define  USB0_CTL_RESUME_MASK        0x4u
#define  USB0_CTL_RESUME_SHIFT       2

#define  USB0_CTL_HOSTMODEEN_MASK    0x8u
#define  USB0_CTL_HOSTMODEEN_SHIFT   3

#define  USB0_CTL_RESET_MASK         0x10u
#define  USB0_CTL_RESET_SHIFT        4

#define  USB0_CTL_TXSUSPENDTOKENBUSY_MASK 0x20u
#define  USB0_CTL_TXSUSPENDTOKENBUSY_SHIFT 5

#define  USB0_CTL_SE0_MASK           0x40u
#define  USB0_CTL_SE0_SHIFT          6
//   Live USB Single Ended Zero signal

#define  USB0_CTL_JSTATE_MASK        0x80u
#define  USB0_CTL_JSTATE_SHIFT       7
//   Live USB differential receiver JSTATE signal

#define  USB0_ADDR_ADDR_MASK         0x7Fu
#define  USB0_ADDR_ADDR_SHIFT        0
#define  USB0_ADDR_ADDR(x)           (((uint8_t)(((uint8_t)(x))<<USB0_ADDR_ADDR_SHIFT))&USB0_ADDR_ADDR_MASK)
//   USB Address

#define  USB0_ADDR_LSEN_MASK         0x80u
#define  USB0_ADDR_LSEN_SHIFT        7
//   Low Speed Enable bit

#define  USB0_BDTPAGE1_BDTBA_MASK    0xFEu
#define  USB0_BDTPAGE1_BDTBA_SHIFT   1
#define  USB0_BDTPAGE1_BDTBA(x)      (((uint8_t)(((uint8_t)(x))<<USB0_BDTPAGE1_BDTBA_SHIFT))&USB0_BDTPAGE1_BDTBA_MASK)

#define  USB0_FRMNUML_FRM_MASK       0xFFu
#define  USB0_FRMNUML_FRM_SHIFT      0
#define  USB0_FRMNUML_FRM(x)         (((uint8_t)(((uint8_t)(x))<<USB0_FRMNUML_FRM_SHIFT))&USB0_FRMNUML_FRM_MASK)

#define  USB0_FRMNUMH_FRM_MASK       0x7u
#define  USB0_FRMNUMH_FRM_SHIFT      0
#define  USB0_FRMNUMH_FRM(x)         (((uint8_t)(((uint8_t)(x))<<USB0_FRMNUMH_FRM_SHIFT))&USB0_FRMNUMH_FRM_MASK)

#define  USB0_TOKEN_TOKENENDPT_MASK  0xFu
#define  USB0_TOKEN_TOKENENDPT_SHIFT 0
#define  USB0_TOKEN_TOKENENDPT(x)    (((uint8_t)(((uint8_t)(x))<<USB0_TOKEN_TOKENENDPT_SHIFT))&USB0_TOKEN_TOKENENDPT_MASK)

#define  USB0_TOKEN_TOKENPID_MASK    0xF0u
#define  USB0_TOKEN_TOKENPID_SHIFT   4
#define  USB0_TOKEN_TOKENPID(x)      (((uint8_t)(((uint8_t)(x))<<USB0_TOKEN_TOKENPID_SHIFT))&USB0_TOKEN_TOKENPID_MASK)
//     0b0001 ==> OUT Token. USB Module performs an OUT (TX) transaction.
//     0b1001 ==> IN Token. USB Module performs an In (RX) transaction.
//     0b1101 ==> SETUP Token. USB Module performs a SETUP (TX) transaction

#define  USB0_SOFTHLD_CNT_MASK       0xFFu
#define  USB0_SOFTHLD_CNT_SHIFT      0
#define  USB0_SOFTHLD_CNT(x)         (((uint8_t)(((uint8_t)(x))<<USB0_SOFTHLD_CNT_SHIFT))&USB0_SOFTHLD_CNT_MASK)

#define  USB0_BDTPAGE2_BDTBA_MASK    0xFFu
#define  USB0_BDTPAGE2_BDTBA_SHIFT   0
#define  USB0_BDTPAGE2_BDTBA(x)      (((uint8_t)(((uint8_t)(x))<<USB0_BDTPAGE2_BDTBA_SHIFT))&USB0_BDTPAGE2_BDTBA_MASK)

#define  USB0_BDTPAGE3_BDTBA_MASK    0xFFu
#define  USB0_BDTPAGE3_BDTBA_SHIFT   0
#define  USB0_BDTPAGE3_BDTBA(x)      (((uint8_t)(((uint8_t)(x))<<USB0_BDTPAGE3_BDTBA_SHIFT))&USB0_BDTPAGE3_BDTBA_MASK)

#define  USB0_ENDPT0_EPHSHK_MASK     0x1u
#define  USB0_ENDPT0_EPHSHK_SHIFT    0

#define  USB0_ENDPT0_EPSTALL_MASK    0x2u
#define  USB0_ENDPT0_EPSTALL_SHIFT   1

#define  USB0_ENDPT0_EPTXEN_MASK     0x4u
#define  USB0_ENDPT0_EPTXEN_SHIFT    2

#define  USB0_ENDPT0_EPRXEN_MASK     0x8u
#define  USB0_ENDPT0_EPRXEN_SHIFT    3

#define  USB0_ENDPT0_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT0_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT0_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT0_RETRYDIS_SHIFT  6

#define  USB0_ENDPT0_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT0_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT1_EPHSHK_MASK     0x1u
#define  USB0_ENDPT1_EPHSHK_SHIFT    0

#define  USB0_ENDPT1_EPSTALL_MASK    0x2u
#define  USB0_ENDPT1_EPSTALL_SHIFT   1

#define  USB0_ENDPT1_EPTXEN_MASK     0x4u
#define  USB0_ENDPT1_EPTXEN_SHIFT    2

#define  USB0_ENDPT1_EPRXEN_MASK     0x8u
#define  USB0_ENDPT1_EPRXEN_SHIFT    3

#define  USB0_ENDPT1_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT1_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT1_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT1_RETRYDIS_SHIFT  6

#define  USB0_ENDPT1_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT1_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT2_EPHSHK_MASK     0x1u
#define  USB0_ENDPT2_EPHSHK_SHIFT    0

#define  USB0_ENDPT2_EPSTALL_MASK    0x2u
#define  USB0_ENDPT2_EPSTALL_SHIFT   1

#define  USB0_ENDPT2_EPTXEN_MASK     0x4u
#define  USB0_ENDPT2_EPTXEN_SHIFT    2

#define  USB0_ENDPT2_EPRXEN_MASK     0x8u
#define  USB0_ENDPT2_EPRXEN_SHIFT    3

#define  USB0_ENDPT2_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT2_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT2_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT2_RETRYDIS_SHIFT  6

#define  USB0_ENDPT2_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT2_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT3_EPHSHK_MASK     0x1u
#define  USB0_ENDPT3_EPHSHK_SHIFT    0

#define  USB0_ENDPT3_EPSTALL_MASK    0x2u
#define  USB0_ENDPT3_EPSTALL_SHIFT   1

#define  USB0_ENDPT3_EPTXEN_MASK     0x4u
#define  USB0_ENDPT3_EPTXEN_SHIFT    2

#define  USB0_ENDPT3_EPRXEN_MASK     0x8u
#define  USB0_ENDPT3_EPRXEN_SHIFT    3

#define  USB0_ENDPT3_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT3_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT3_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT3_RETRYDIS_SHIFT  6

#define  USB0_ENDPT3_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT3_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT4_EPHSHK_MASK     0x1u
#define  USB0_ENDPT4_EPHSHK_SHIFT    0

#define  USB0_ENDPT4_EPSTALL_MASK    0x2u
#define  USB0_ENDPT4_EPSTALL_SHIFT   1

#define  USB0_ENDPT4_EPTXEN_MASK     0x4u
#define  USB0_ENDPT4_EPTXEN_SHIFT    2

#define  USB0_ENDPT4_EPRXEN_MASK     0x8u
#define  USB0_ENDPT4_EPRXEN_SHIFT    3

#define  USB0_ENDPT4_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT4_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT4_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT4_RETRYDIS_SHIFT  6

#define  USB0_ENDPT4_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT4_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT5_EPHSHK_MASK     0x1u
#define  USB0_ENDPT5_EPHSHK_SHIFT    0

#define  USB0_ENDPT5_EPSTALL_MASK    0x2u
#define  USB0_ENDPT5_EPSTALL_SHIFT   1

#define  USB0_ENDPT5_EPTXEN_MASK     0x4u
#define  USB0_ENDPT5_EPTXEN_SHIFT    2

#define  USB0_ENDPT5_EPRXEN_MASK     0x8u
#define  USB0_ENDPT5_EPRXEN_SHIFT    3

#define  USB0_ENDPT5_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT5_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT5_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT5_RETRYDIS_SHIFT  6

#define  USB0_ENDPT5_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT5_HOSTWOHUB_SHIFT 7

