ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
#define  USB0_ENDPT6_EPHSHK_MASK     0x1u
#define  USB0_ENDPT6_EPHSHK_SHIFT    0

#define  USB0_ENDPT6_EPSTALL_MASK    0x2u
#define  USB0_ENDPT6_EPSTALL_SHIFT   1

#define  USB0_ENDPT6_EPTXEN_MASK     0x4u
#define  USB0_ENDPT6_EPTXEN_SHIFT    2

#define  USB0_ENDPT6_EPRXEN_MASK     0x8u
#define  USB0_ENDPT6_EPRXEN_SHIFT    3

#define  USB0_ENDPT6_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT6_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT6_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT6_RETRYDIS_SHIFT  6

#define  USB0_ENDPT6_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT6_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT7_EPHSHK_MASK     0x1u
#define  USB0_ENDPT7_EPHSHK_SHIFT    0

#define  USB0_ENDPT7_EPSTALL_MASK    0x2u
#define  USB0_ENDPT7_EPSTALL_SHIFT   1

#define  USB0_ENDPT7_EPTXEN_MASK     0x4u
#define  USB0_ENDPT7_EPTXEN_SHIFT    2

#define  USB0_ENDPT7_EPRXEN_MASK     0x8u
#define  USB0_ENDPT7_EPRXEN_SHIFT    3

#define  USB0_ENDPT7_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT7_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT7_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT7_RETRYDIS_SHIFT  6

#define  USB0_ENDPT7_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT7_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT8_EPHSHK_MASK     0x1u
#define  USB0_ENDPT8_EPHSHK_SHIFT    0

#define  USB0_ENDPT8_EPSTALL_MASK    0x2u
#define  USB0_ENDPT8_EPSTALL_SHIFT   1

#define  USB0_ENDPT8_EPTXEN_MASK     0x4u
#define  USB0_ENDPT8_EPTXEN_SHIFT    2

#define  USB0_ENDPT8_EPRXEN_MASK     0x8u
#define  USB0_ENDPT8_EPRXEN_SHIFT    3

#define  USB0_ENDPT8_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT8_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT8_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT8_RETRYDIS_SHIFT  6

#define  USB0_ENDPT8_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT8_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT9_EPHSHK_MASK     0x1u
#define  USB0_ENDPT9_EPHSHK_SHIFT    0

#define  USB0_ENDPT9_EPSTALL_MASK    0x2u
#define  USB0_ENDPT9_EPSTALL_SHIFT   1

#define  USB0_ENDPT9_EPTXEN_MASK     0x4u
#define  USB0_ENDPT9_EPTXEN_SHIFT    2

#define  USB0_ENDPT9_EPRXEN_MASK     0x8u
#define  USB0_ENDPT9_EPRXEN_SHIFT    3

#define  USB0_ENDPT9_EPCTLDIS_MASK   0x10u
#define  USB0_ENDPT9_EPCTLDIS_SHIFT  4

#define  USB0_ENDPT9_RETRYDIS_MASK   0x40u
#define  USB0_ENDPT9_RETRYDIS_SHIFT  6

#define  USB0_ENDPT9_HOSTWOHUB_MASK  0x80u
#define  USB0_ENDPT9_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT10_EPHSHK_MASK    0x1u
#define  USB0_ENDPT10_EPHSHK_SHIFT   0

#define  USB0_ENDPT10_EPSTALL_MASK   0x2u
#define  USB0_ENDPT10_EPSTALL_SHIFT  1

#define  USB0_ENDPT10_EPTXEN_MASK    0x4u
#define  USB0_ENDPT10_EPTXEN_SHIFT   2

#define  USB0_ENDPT10_EPRXEN_MASK    0x8u
#define  USB0_ENDPT10_EPRXEN_SHIFT   3

#define  USB0_ENDPT10_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT10_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT10_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT10_RETRYDIS_SHIFT 6

#define  USB0_ENDPT10_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT10_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT11_EPHSHK_MASK    0x1u
#define  USB0_ENDPT11_EPHSHK_SHIFT   0

#define  USB0_ENDPT11_EPSTALL_MASK   0x2u
#define  USB0_ENDPT11_EPSTALL_SHIFT  1

#define  USB0_ENDPT11_EPTXEN_MASK    0x4u
#define  USB0_ENDPT11_EPTXEN_SHIFT   2

#define  USB0_ENDPT11_EPRXEN_MASK    0x8u
#define  USB0_ENDPT11_EPRXEN_SHIFT   3

#define  USB0_ENDPT11_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT11_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT11_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT11_RETRYDIS_SHIFT 6

#define  USB0_ENDPT11_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT11_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT12_EPHSHK_MASK    0x1u
#define  USB0_ENDPT12_EPHSHK_SHIFT   0

#define  USB0_ENDPT12_EPSTALL_MASK   0x2u
#define  USB0_ENDPT12_EPSTALL_SHIFT  1

#define  USB0_ENDPT12_EPTXEN_MASK    0x4u
#define  USB0_ENDPT12_EPTXEN_SHIFT   2

#define  USB0_ENDPT12_EPRXEN_MASK    0x8u
#define  USB0_ENDPT12_EPRXEN_SHIFT   3

#define  USB0_ENDPT12_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT12_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT12_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT12_RETRYDIS_SHIFT 6

#define  USB0_ENDPT12_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT12_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT13_EPHSHK_MASK    0x1u
#define  USB0_ENDPT13_EPHSHK_SHIFT   0

#define  USB0_ENDPT13_EPSTALL_MASK   0x2u
#define  USB0_ENDPT13_EPSTALL_SHIFT  1

#define  USB0_ENDPT13_EPTXEN_MASK    0x4u
#define  USB0_ENDPT13_EPTXEN_SHIFT   2

#define  USB0_ENDPT13_EPRXEN_MASK    0x8u
#define  USB0_ENDPT13_EPRXEN_SHIFT   3

#define  USB0_ENDPT13_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT13_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT13_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT13_RETRYDIS_SHIFT 6

#define  USB0_ENDPT13_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT13_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT14_EPHSHK_MASK    0x1u
#define  USB0_ENDPT14_EPHSHK_SHIFT   0

#define  USB0_ENDPT14_EPSTALL_MASK   0x2u
#define  USB0_ENDPT14_EPSTALL_SHIFT  1

#define  USB0_ENDPT14_EPTXEN_MASK    0x4u
#define  USB0_ENDPT14_EPTXEN_SHIFT   2

#define  USB0_ENDPT14_EPRXEN_MASK    0x8u
#define  USB0_ENDPT14_EPRXEN_SHIFT   3

#define  USB0_ENDPT14_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT14_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT14_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT14_RETRYDIS_SHIFT 6

#define  USB0_ENDPT14_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT14_HOSTWOHUB_SHIFT 7

#define  USB0_ENDPT15_EPHSHK_MASK    0x1u
#define  USB0_ENDPT15_EPHSHK_SHIFT   0

#define  USB0_ENDPT15_EPSTALL_MASK   0x2u
#define  USB0_ENDPT15_EPSTALL_SHIFT  1

#define  USB0_ENDPT15_EPTXEN_MASK    0x4u
#define  USB0_ENDPT15_EPTXEN_SHIFT   2

#define  USB0_ENDPT15_EPRXEN_MASK    0x8u
#define  USB0_ENDPT15_EPRXEN_SHIFT   3

#define  USB0_ENDPT15_EPCTLDIS_MASK  0x10u
#define  USB0_ENDPT15_EPCTLDIS_SHIFT 4

#define  USB0_ENDPT15_RETRYDIS_MASK  0x40u
#define  USB0_ENDPT15_RETRYDIS_SHIFT 6

#define  USB0_ENDPT15_HOSTWOHUB_MASK 0x80u
#define  USB0_ENDPT15_HOSTWOHUB_SHIFT 7

#define  USB0_USBCTRL_PDE_MASK       0x40u
#define  USB0_USBCTRL_PDE_SHIFT      6
//     0b0 ==> Weak pulldowns are disabled on D+ and D-.
//     0b1 ==> Weak pulldowns are enabled on D+ and D-.

#define  USB0_USBCTRL_SUSP_MASK      0x80u
#define  USB0_USBCTRL_SUSP_SHIFT     7
//     0b0 ==> USB transceiver is not in suspend state.
//     0b1 ==> USB transceiver is in suspend state.

#define  USB0_OBSERVE_DMPD_MASK      0x10u
#define  USB0_OBSERVE_DMPD_SHIFT     4
//     0b0 ==> D- pulldown disabled.
//     0b1 ==> D- pulldown enabled.

#define  USB0_OBSERVE_DPPD_MASK      0x40u
#define  USB0_OBSERVE_DPPD_SHIFT     6
//     0b0 ==> D+ pulldown disabled.
//     0b1 ==> D+ pulldown enabled.

#define  USB0_OBSERVE_DPPU_MASK      0x80u
#define  USB0_OBSERVE_DPPU_SHIFT     7
//     0b0 ==> D+ pullup disabled.
//     0b1 ==> D+ pullup enabled.

#define  USB0_CONTROL_DPPULLUPNONOTG_MASK 0x10u
#define  USB0_CONTROL_DPPULLUPNONOTG_SHIFT 4
//     0b0 ==> DP Pullup in non-OTG device mode is not enabled.
//     0b1 ==> DP Pullup in non-OTG device mode is enabled.

