ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
/** UART0 Bit Fields **/
/* BDH Bit Fields */
#define UART0_BDH_SBR_MASK                        0x1Fu
#define UART0_BDH_SBR_SHIFT                       0
#define UART0_BDH_SBR(x)                          (((uint8_t)(((uint8_t)(x))<<UART0_BDH_SBR_SHIFT))&UART0_BDH_SBR_MASK)
#define UART0_BDH_RXEDGIE_MASK                    0x40u
#define UART0_BDH_RXEDGIE_SHIFT                   6
#define UART0_BDH_LBKDIE_MASK                     0x80u
#define UART0_BDH_LBKDIE_SHIFT                    7
#define UART0_BDH_SBNS_MASK                       0x20u
#define UART0_BDH_SBNS_SHIFT                      5
/* BDL Bit Fields */
#define UART0_BDL_SBR_MASK                        0xFFu
#define UART0_BDL_SBR_SHIFT                       0
#define UART0_BDL_SBR(x)                          (((uint8_t)(((uint8_t)(x))<<UART0_BDL_SBR_SHIFT))&UART0_BDL_SBR_MASK)
/* C1 Bit Fields */
#define UART0_C1_PT_MASK                          0x1u
#define UART0_C1_PT_SHIFT                         0
#define UART0_C1_PE_MASK                          0x2u
#define UART0_C1_PE_SHIFT                         1
#define UART0_C1_ILT_MASK                         0x4u
#define UART0_C1_ILT_SHIFT                        2
#define UART0_C1_WAKE_MASK                        0x8u
#define UART0_C1_WAKE_SHIFT                       3
#define UART0_C1_M_MASK                           0x10u
#define UART0_C1_M_SHIFT                          4
#define UART0_C1_RSRC_MASK                        0x20u
#define UART0_C1_RSRC_SHIFT                       5
#define UART0_C1_UART0DOZEEN_MASK                  0x40u
#define UART0_C1_UART0DOZEEN_SHIFT                 6
#define UART0_C1_LOOPS_MASK                       0x80u
#define UART0_C1_LOOPS_SHIFT                      7
/* C2 Bit Fields */
#define UART0_C2_SBK_MASK                         0x1u
#define UART0_C2_SBK_SHIFT                        0
#define UART0_C2_RWU_MASK                         0x2u
#define UART0_C2_RWU_SHIFT                        1
#define UART0_C2_RE_MASK                          0x4u
#define UART0_C2_RE_SHIFT                         2
#define UART0_C2_TE_MASK                          0x8u
#define UART0_C2_TE_SHIFT                         3
#define UART0_C2_ILIE_MASK                        0x10u
#define UART0_C2_ILIE_SHIFT                       4
#define UART0_C2_RIE_MASK                         0x20u
#define UART0_C2_RIE_SHIFT                        5
#define UART0_C2_TCIE_MASK                        0x40u
#define UART0_C2_TCIE_SHIFT                       6
#define UART0_C2_TIE_MASK                         0x80u
#define UART0_C2_TIE_SHIFT                        7
/* S1 Bit Fields */
#define UART0_S1_PF_MASK                          0x1u
#define UART0_S1_PF_SHIFT                         0
#define UART0_S1_FE_MASK                          0x2u
#define UART0_S1_FE_SHIFT                         1
#define UART0_S1_NF_MASK                          0x4u
#define UART0_S1_NF_SHIFT                         2
#define UART0_S1_OR_MASK                          0x8u
#define UART0_S1_OR_SHIFT                         3
#define UART0_S1_IDLE_MASK                        0x10u
#define UART0_S1_IDLE_SHIFT                       4
#define UART0_S1_RDRF_MASK                        0x20u
#define UART0_S1_RDRF_SHIFT                       5
#define UART0_S1_TC_MASK                          0x40u
#define UART0_S1_TC_SHIFT                         6
#define UART0_S1_TDRE_MASK                        0x80u
#define UART0_S1_TDRE_SHIFT                       7
/* S2 Bit Fields */
#define UART0_S2_RAF_MASK                         0x1u
#define UART0_S2_RAF_SHIFT                        0
#define UART0_S2_LBKDE_MASK                       0x2u
#define UART0_S2_LBKDE_SHIFT                      1
#define UART0_S2_BRK13_MASK                       0x4u
#define UART0_S2_BRK13_SHIFT                      2
#define UART0_S2_RWUID_MASK                       0x8u
#define UART0_S2_RWUID_SHIFT                      3
#define UART0_S2_RXINV_MASK                       0x10u
#define UART0_S2_RXINV_SHIFT                      4
#define UART0_S2_RXEDGIF_MASK                     0x40u
#define UART0_S2_RXEDGIF_SHIFT                    6
#define UART0_S2_LBKDIF_MASK                      0x80u
#define UART0_S2_LBKDIF_SHIFT                     7
/* C3 Bit Fields */
#define UART0_C3_PEIE_MASK                        0x1u
#define UART0_C3_PEIE_SHIFT                       0
#define UART0_C3_FEIE_MASK                        0x2u
#define UART0_C3_FEIE_SHIFT                       1
#define UART0_C3_NEIE_MASK                        0x4u
#define UART0_C3_NEIE_SHIFT                       2
#define UART0_C3_ORIE_MASK                        0x8u
#define UART0_C3_ORIE_SHIFT                       3
#define UART0_C3_TXINV_MASK                       0x10u
#define UART0_C3_TXINV_SHIFT                      4
#define UART0_C3_TXDIR_MASK                       0x20u
#define UART0_C3_TXDIR_SHIFT                      5
#define UART0_C3_R9T8_MASK                          0x40u
#define UART0_C3_R9T8_SHIFT                         6
#define UART0_C3_R8T9_MASK                          0x80u
#define UART0_C3_R8T9_SHIFT                         7
/* D Bit Fields */
#define UART0_D_RT_MASK                           0xFFu
#define UART0_D_RT_SHIFT                          0
#define UART0_D_RT(x)                             (((uint8_t)(((uint8_t)(x))<<UART0_D_RT_SHIFT))&UART0_D_RT_MASK)
/* MA1 Bit Fields */
#define UART0_MA1_MASK                            0xFFu
#define UART0_MA1_SHIFT                           0
/* MA2 Bit Fields */
#define UART0_MA2_MASK                            0xFFu
#define UART0_MA2_SHIFT                           0
/* C4 Bit Fields */
#define UART0_C4_OSR_MASK                         0x1Fu
#define UART0_C4_OSR_SHIFT                        0
#define UART0_C4_OSR(x)                           (((uint8_t)(((uint8_t)(x))<<UART0_C4_OSR_SHIFT))&UART0_C4_OSR_MASK)
#define UART0_C4_MAEN2_MASK                       0x40u
#define UART0_C4_MAEN2_SHIFT                      6
#define UART0_C4_MAEN1_MASK                       0x80u
#define UART0_C4_MAEN1_SHIFT                      7
#define UART0_C4_M10_MASK                         0x20u
#define UART0_C4_M10_SHIFT                        5
/* C5 Bit Fields */
#define UART0_C5_RESYNCDIS_MASK                   0x1u
#define UART0_C5_RESYNCDIS_SHIFT                  0
#define UART0_C5_BOTHEDGE_MASK                    0x2u
#define UART0_C5_BOTHEDGE_SHIFT                   1
#define UART0_C5_RDMAE_MASK                       0x4u
#define UART0_C5_RDMAE_SHIFT                      2
#define UART0_C5_TDMAE_MASK                       0x8u
#define UART0_C5_TDMAE_SHIFT                      3
/**
 * @}
 */ /* end of group UART0_Register_Masks */


/* UART - Peripheral instance base addresses */

