ErichStyger/mcuoneclipse/Examples/FreeRTOS_Ports/IAR/FreeRTOS_FRDM-KL25Z/Sources/MKL25Z128LK4.h
/* GPIO - Peripheral instance base addresses */
/** Peripheral PTA base pointer */
#define FPTA_BASE_PTR                             ((FGPIO_MemMapPtr)0xF80FF000u)
/** Peripheral PTB base pointer */
#define FPTB_BASE_PTR                             ((FGPIO_MemMapPtr)0xF80FF040u)
/** Peripheral PTC base pointer */
#define FPTC_BASE_PTR                             ((FGPIO_MemMapPtr)0xF80FF080u)
/** Peripheral PTD base pointer */
#define FPTD_BASE_PTR                             ((FGPIO_MemMapPtr)0xF80FF0C0u)
/** Peripheral PTE base pointer */
#define FPTE_BASE_PTR                             ((FGPIO_MemMapPtr)0xF80FF100u)
		
/* ----------------------------------------------------------------------------
   -- GPIO - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup GPIO_Register_Accessor_Macros GPIO - Register accessor macros
 * @{
 */


/* GPIO - Register instance definitions */
/* PTA */
#define FGPIOA_PDOR                               FGPIO_PDOR_REG(FPTA_BASE_PTR)
#define FGPIOA_PSOR                               FGPIO_PSOR_REG(FPTA_BASE_PTR)
#define FGPIOA_PCOR                               FGPIO_PCOR_REG(FPTA_BASE_PTR)
#define FGPIOA_PTOR                               FGPIO_PTOR_REG(FPTA_BASE_PTR)
#define FGPIOA_PDIR                               FGPIO_PDIR_REG(FPTA_BASE_PTR)
#define FGPIOA_PDDR                               FGPIO_PDDR_REG(FPTA_BASE_PTR)
/* PTB */
#define FGPIOB_PDOR                               FGPIO_PDOR_REG(FPTB_BASE_PTR)
#define FGPIOB_PSOR                               FGPIO_PSOR_REG(FPTB_BASE_PTR)
#define FGPIOB_PCOR                               FGPIO_PCOR_REG(FPTB_BASE_PTR)
#define FGPIOB_PTOR                               FGPIO_PTOR_REG(FPTB_BASE_PTR)
#define FGPIOB_PDIR                               FGPIO_PDIR_REG(FPTB_BASE_PTR)
#define FGPIOB_PDDR                               FGPIO_PDDR_REG(FPTB_BASE_PTR)
/* PTC */
#define FGPIOC_PDOR                               FGPIO_PDOR_REG(FPTC_BASE_PTR)
#define FGPIOC_PSOR                               FGPIO_PSOR_REG(FPTC_BASE_PTR)
#define FGPIOC_PCOR                               FGPIO_PCOR_REG(FPTC_BASE_PTR)
#define FGPIOC_PTOR                               FGPIO_PTOR_REG(FPTC_BASE_PTR)
#define FGPIOC_PDIR                               FGPIO_PDIR_REG(FPTC_BASE_PTR)
#define FGPIOC_PDDR                               FGPIO_PDDR_REG(FPTC_BASE_PTR)
/* PTD */
#define FGPIOD_PDOR                               FGPIO_PDOR_REG(FPTD_BASE_PTR)
#define FGPIOD_PSOR                               FGPIO_PSOR_REG(FPTD_BASE_PTR)
#define FGPIOD_PCOR                               FGPIO_PCOR_REG(FPTD_BASE_PTR)
#define FGPIOD_PTOR                               FGPIO_PTOR_REG(FPTD_BASE_PTR)
#define FGPIOD_PDIR                               FGPIO_PDIR_REG(FPTD_BASE_PTR)
#define FGPIOD_PDDR                               FGPIO_PDDR_REG(FPTD_BASE_PTR)
/* PTE */
#define FGPIOE_PDOR                               FGPIO_PDOR_REG(FPTE_BASE_PTR)
#define FGPIOE_PSOR                               FGPIO_PSOR_REG(FPTE_BASE_PTR)
#define FGPIOE_PCOR                               FGPIO_PCOR_REG(FPTE_BASE_PTR)
#define FGPIOE_PTOR                               FGPIO_PTOR_REG(FPTE_BASE_PTR)
#define FGPIOE_PDIR                               FGPIO_PDIR_REG(FPTE_BASE_PTR)
#define FGPIOE_PDDR                               FGPIO_PDDR_REG(FPTE_BASE_PTR)

/**
 * @}
 */ /* end of group IOPORT GPIO_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group IOPORT GPIO_Peripheral */